{"description": "Enterprise techniques used by Tropic Trooper, ATT&CK group G0081 v1.1", "name": "Tropic Trooper (G0081)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1197", "comment": "Tropic Trooper has leveraged the BITSadmin command-line tool to create a job and launch a malicious process."}, {"score": 1, "techniqueID": "T1043", "comment": "Tropic Trooper can use ports 443 and 53 for C2 communications via malware called TClient."}, {"score": 1, "techniqueID": "T1140", "comment": "Tropic Trooper used shellcode with an XOR algorithm to decrypt a payload."}, {"score": 1, "techniqueID": "T1073", "comment": "Tropic Trooper has been known to side-load DLLs using a valid version of Windows Address Book executable with one of their tools."}, {"score": 1, "techniqueID": "T1203", "comment": "Tropic Trooper has executed commands through Microsoft security vulnerabilities, including CVE-2017-11882, CVE-2018-0802, and CVE-2012-0158."}, {"score": 1, "techniqueID": "T1158", "comment": "Tropic Trooper has created a hidden directory under C:\\ProgramData\\Apple\\Updates\\."}, {"score": 1, "techniqueID": "T1046", "comment": "Tropic Trooper used pr to scan for open ports on target systems."}, {"score": 1, "techniqueID": "T1135", "comment": "Tropic Trooper used netview to scan target systems for shared resources."}, {"score": 1, "techniqueID": "T1050", "comment": "Tropic Trooper installs a service pointing to a malicious DLL dropped to disk."}, {"score": 1, "techniqueID": "T1027", "comment": "Tropic Trooper has encrypted configuration files."}, {"score": 1, "techniqueID": "T1057", "comment": "Tropic Trooper enumerates the running processes on the system."}, {"score": 1, "techniqueID": "T1055", "comment": "Tropic Trooper has injected a DLL backdoor into a file dllhost.exe."}, {"score": 1, "techniqueID": "T1063", "comment": "Tropic Trooper searches for anti-virus software running on the system."}, {"score": 1, "techniqueID": "T1193", "comment": "Tropic Trooper sent spearphishing emails that contained malicious Microsoft Office attachments."}, {"score": 1, "techniqueID": "T1032", "comment": "Tropic Trooper uses SSL to connect to C2 servers."}, {"score": 1, "techniqueID": "T1082", "comment": "Tropic Trooper has detected a target system’s OS version."}, {"score": 1, "techniqueID": "T1033", "comment": "Tropic Trooper used letmein to scan for saved usernames on the target system."}, {"score": 1, "techniqueID": "T1221", "comment": "Tropic Trooper delivered malicious documents with the XLSX extension, typically used by OpenXML documents, but the file itself was actually an OLE (XLS) document."}, {"score": 1, "techniqueID": "T1004", "comment": "Tropic Trooper creates the Registry key HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell and sets the value to establish persistence."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Tropic Trooper", "color": "#66b1ff"}]}