{"description": "Enterprise techniques used by Duqu, ATT&CK software S0038 v1.1", "name": "Duqu (S0038)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "Duqu examines running system processes for tokens that have specific system privileges. If it finds one, it will copy the token and store it for later use. Eventually it will start new processes with the stored token attached. It can also steal tokens to acquire administrative privileges."}, {"score": 1, "techniqueID": "T1087", "comment": "The discovery modules used with Duqu can collect information on accounts and permissions."}, {"score": 1, "techniqueID": "T1010", "comment": "The discovery modules used with Duqu can collect information on open windows."}, {"score": 1, "techniqueID": "T1043", "comment": "Duqu uses a custom command and control protocol that communicates over commonly used ports, and is frequently encapsulated by application layer protocols."}, {"score": 1, "techniqueID": "T1090", "comment": "Duqu can be configured to have commands relayed over a peer-to-peer network of infected hosts if some of the hosts do not have Internet access."}, {"score": 1, "techniqueID": "T1094", "comment": "Duqu is capable of using its command and control protocol over port 443. However, Duqu is also capable of encapsulating its command protocol over standard application layer protocols. The Duqu command and control protocol implements many of the same features as TCP and is a reliable transport protocol."}, {"score": 1, "techniqueID": "T1002", "comment": "Modules can be pushed to and executed by Duqu that copy data to a staging area, compress it, and XOR encrypt it."}, {"score": 1, "techniqueID": "T1022", "comment": "Modules can be pushed to and executed by Duqu that copy data to a staging area, compress it, and XOR encrypt it."}, {"score": 1, "techniqueID": "T1001", "comment": "When the Duqu command and control is operating over HTTP or HTTPS, Duqu uploads data to its controller by appending it to a blank JPG file."}, {"score": 1, "techniqueID": "T1074", "comment": "Modules can be pushed to and executed by Duqu that copy data to a staging area, compress it, and XOR encrypt it."}, {"score": 1, "techniqueID": "T1056", "comment": "Duqu can track key presses with a keylogger module."}, {"score": 1, "techniqueID": "T1050", "comment": "Duqu creates a new service that loads a malicious driver when the system starts. When Duqu is active, the operating system believes that the driver is legitimate, as it has been signed with a valid private key."}, {"score": 1, "techniqueID": "T1057", "comment": "The discovery modules used with Duqu can collect information on process details."}, {"score": 1, "techniqueID": "T1093", "comment": "Duqu is capable of loading executable code via process hollowing."}, {"score": 1, "techniqueID": "T1055", "comment": "Duqu will inject itself into different processes to evade detection. The selection of the target process is influenced by the security software that is installed on the system (Duqu will inject into different processes depending on which security suite is installed on the infected host)."}, {"score": 1, "techniqueID": "T1053", "comment": "Adversaries can instruct Duqu to spread laterally by copying itself to shares it has enumerated and for which it has obtained legitimate credentials (via keylogging or other means). The remote host is then infected by using the compromised credentials to schedule a task on remote machines that executes the malware."}, {"score": 1, "techniqueID": "T1218", "comment": "Duqu has used msiexec to execute malicious Windows Installer packages. Additionally, a PROPERTY=VALUE pair containing a 56-bit encryption key has been used to decrypt the main payload from the installer packages."}, {"score": 1, "techniqueID": "T1071", "comment": "Duqu uses a custom command and control protocol that communicates over commonly used ports, and is frequently encapsulated by application layer protocols."}, {"score": 1, "techniqueID": "T1032", "comment": "The Duqu command and control protocol's data stream can be encrypted with AES-CBC."}, {"score": 1, "techniqueID": "T1016", "comment": "The reconnaissance modules used with Duqu can collect information on network configuration."}, {"score": 1, "techniqueID": "T1049", "comment": "The discovery modules used with Duqu can collect information on network connections."}, {"score": 1, "techniqueID": "T1078", "comment": "Adversaries can instruct Duqu to spread laterally by copying itself to shares it has enumerated and for which it has obtained legitimate credentials (via keylogging or other means). The remote host is then infected by using the compromised credentials to schedule a task on remote machines that executes the malware."}, {"score": 1, "techniqueID": "T1077", "comment": "Adversaries can instruct Duqu to spread laterally by copying itself to shares it has enumerated and for which it has obtained legitimate credentials (via keylogging or other means). The remote host is then infected by using the compromised credentials to schedule a task on remote machines that executes the malware."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Duqu", "color": "#66b1ff"}]}