{"description": "Enterprise techniques used by Empire, ATT&CK software S0363 v1.0", "name": "Empire (S0363)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "Empire can use Invoke-RunAs to make tokens as well as PowerSploit's Invoke-TokenManipulation to manipulate access tokens."}, {"score": 1, "techniqueID": "T1015", "comment": "Empire can leverage WMI debugging to remotely replace binaries like sethc.exe, Utilman.exe, and Magnify.exe with cmd.exe."}, {"score": 1, "techniqueID": "T1087", "comment": "Empire can acquire local and domain user account information."}, {"score": 1, "techniqueID": "T1217", "comment": "Empire has the ability to gather browser data such as bookmarks and visited sites."}, {"score": 1, "techniqueID": "T1088", "comment": "Empire includes various modules to attempt to bypass UAC for escalation of privileges."}, {"score": 1, "techniqueID": "T1115", "comment": "Empire can harvest clipboard data on both Windows and macOS systems."}, {"score": 1, "techniqueID": "T1059", "comment": "Empire uses a command-line interface to interact with systems."}, {"score": 1, "techniqueID": "T1043", "comment": "Empire can conduct command and control over commonly used ports like 80 and 443."}, {"score": 1, "techniqueID": "T1136", "comment": "Empire has a module for creating a new domain user or local user if permissions allow."}, {"score": 1, "techniqueID": "T1003", "comment": "Empire contains an implementation of Mimikatz to gather credentials from memory."}, {"score": 1, "techniqueID": "T1081", "comment": "Empire can use various modules to search for files containing passwords."}, {"score": 1, "techniqueID": "T1002", "comment": "Empire can ZIP directories on the target system."}, {"score": 1, "techniqueID": "T1175", "comment": "Empire can utilize Invoke-DCOM to leverage remote COM execution for lateral movement."}, {"score": 1, "techniqueID": "T1038", "comment": "Empire contains modules that can discover and exploit various DLL hijacking opportunities."}, {"score": 1, "techniqueID": "T1482", "comment": "Empire has modules for enumerating domain trusts."}, {"score": 1, "techniqueID": "T1114", "comment": "Empire has the ability to collect emails on a target system."}, {"score": 1, "techniqueID": "T1106", "comment": "Empire contains a variety of enumeration modules that have an option to use API calls to carry out tasks."}, {"score": 1, "techniqueID": "T1048", "comment": "Empire can use Dropbox and GitHub for data exfiltration."}, {"score": 1, "techniqueID": "T1041", "comment": "Empire can send data gathered from a target through the command and control channel."}, {"score": 1, "techniqueID": "T1068", "comment": "Empire can exploit vulnerabilities such as MS16-032 and MS16-135."}, {"score": 1, "techniqueID": "T1210", "comment": "Empire has a limited number of built-in modules for exploiting remote SMB, JBoss, and Jenkins servers."}, {"score": 1, "techniqueID": "T1083", "comment": "Empire includes various modules for finding files of interest on hosts and network shares."}, {"score": 1, "techniqueID": "T1484", "comment": "Empire can use New-GPOImmediateTask to modify a GPO that will install and execute a malicious Scheduled Task."}, {"score": 1, "techniqueID": "T1179", "comment": "Empire contains some modules that leverage API hooking to carry out tasks, such as netripper."}, {"score": 1, "techniqueID": "T1056", "comment": "Empire includes keylogging capabilities for Windows, Linux, and macOS systems."}, {"score": 1, "techniqueID": "T1208", "comment": "Empire uses PowerSploit's Invoke-Kerberoast to request service tickets and return crackable ticket hashes."}, {"score": 1, "techniqueID": "T1171", "comment": "Empire can use Inveigh to conduct name service poisoning for credential theft and associated relay attacks."}, {"score": 1, "techniqueID": "T1031", "comment": "Empire can utilize built-in modules to modify service binaries and restore them to their original state."}, {"score": 1, "techniqueID": "T1046", "comment": "Empire can perform port scans from an infected host."}, {"score": 1, "techniqueID": "T1135", "comment": "Empire can find shared drives on the local system."}, {"score": 1, "techniqueID": "T1040", "comment": "Empire can be used to conduct packet captures on target hosts."}, {"score": 1, "techniqueID": "T1027", "comment": "Empire has the ability to obfuscate commands using Invoke-Obfuscation."}, {"score": 1, "techniqueID": "T1075", "comment": "Empire can perform pass the hash attacks."}, {"score": 1, "techniqueID": "T1097", "comment": "Empire can leverage its implementation of Mimikatz to obtain and use Silver and Golden Tickets."}, {"score": 1, "techniqueID": "T1034", "comment": "Empire contains modules that can discover and exploit various path interception opportunities."}, {"score": 1, "techniqueID": "T1086", "comment": "Empire leverages PowerShell for the majority of its client-side agent tasks. Empire also contains the ability to conduct PowerShell remoting with the Invoke-PSRemoting module."}, {"score": 1, "techniqueID": "T1145", "comment": "Empire can use modules like Invoke-SessionGopher to extract private key and session information."}, {"score": 1, "techniqueID": "T1057", "comment": "Empire can find information about processes running on local and remote systems."}, {"score": 1, "techniqueID": "T1055", "comment": "Empire contains multiple modules for injecting into processes, such as Invoke-PSInject."}, {"score": 1, "techniqueID": "T1060", "comment": "Empire can modify the registry run keys HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run and HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run for persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "Empire can upload and download to and from a victim machine."}, {"score": 1, "techniqueID": "T1021", "comment": "Empire contains modules for executing commands over SSH as well as in-memory VNC agent injection."}, {"score": 1, "techniqueID": "T1053", "comment": "Empire has modules to interact with the Windows task scheduler."}, {"score": 1, "techniqueID": "T1113", "comment": "Empire is capable of capturing screenshots on Windows and macOS systems."}, {"score": 1, "techniqueID": "T1064", "comment": "Empire has modules for executing scripts."}, {"score": 1, "techniqueID": "T1063", "comment": "Empire can enumerate antivirus software on the target."}, {"score": 1, "techniqueID": "T1101", "comment": "Empire can enumerate Security Support Providers (SSPs) as well as utilize PowerSploit's Install-SSP and Invoke-Mimikatz to install malicious SSPs and log authentication events."}, {"score": 1, "techniqueID": "T1035", "comment": "Empire can use PsExec to execute a payload on a remote host."}, {"score": 1, "techniqueID": "T1023", "comment": "Empire can persist by modifying a .LNK file to include a backdoor."}, {"score": 1, "techniqueID": "T1178", "comment": "Empire can add a SID-History to a user if on a domain controller."}, {"score": 1, "techniqueID": "T1071", "comment": "Empire can conduct command and control over protocols like HTTP and HTTPS."}, {"score": 1, "techniqueID": "T1032", "comment": "Empire can use TLS to encrypt its C2 channel."}, {"score": 1, "techniqueID": "T1082", "comment": "Empire can enumerate host system information like OS, architecture, applied patches, and more."}, {"score": 1, "techniqueID": "T1016", "comment": "Empire can acquire network configuration information like DNS servers and network proxies used by a host."}, {"score": 1, "techniqueID": "T1049", "comment": "Empire can enumerate the current network connections of a host."}, {"score": 1, "techniqueID": "T1099", "comment": "Empire can timestomp any files or payloads placed on a target machine to help them blend in."}, {"score": 1, "techniqueID": "T1127", "comment": "Empire can use built-in modules to abuse trusted utilities like MSBuild.exe."}, {"score": 1, "techniqueID": "T1125", "comment": "Empire can capture webcam data on Windows and macOS systems."}, {"score": 1, "techniqueID": "T1102", "comment": "Empire can use Dropbox and GitHub for C2."}, {"score": 1, "techniqueID": "T1047", "comment": "Empire can use WMI to deliver a payload to a remote host. "}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Empire", "color": "#66b1ff"}]}