{"description": "Enterprise techniques used by OilRig, ATT&CK group G0049 v1.1", "name": "OilRig (G0049)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "OilRig has run net user, net user /domain, net group “domain admins” /domain, and net group “Exchange Trusted Subsystem” /domain to get account listings on a victim."}, {"score": 1, "techniqueID": "T1119", "comment": "OilRig has used automated collection."}, {"score": 1, "techniqueID": "T1110", "comment": "OilRig has used brute force techniques to obtain credentials."}, {"score": 1, "techniqueID": "T1059", "comment": "OilRig has used the command-line interface for execution."}, {"score": 1, "techniqueID": "T1223", "comment": "OilRig has used a CHM payload to load and execute another malicious file once delivered to a victim."}, {"score": 1, "techniqueID": "T1003", "comment": "OilRig has used credential dumping tools such as Mimikatz and LaZagne to steal credentials to accounts logged into the compromised system and to Outlook Web Access."}, {"score": 1, "techniqueID": "T1094", "comment": "OilRig has used custom DNS Tunneling protocols for C2."}, {"score": 1, "techniqueID": "T1140", "comment": "A OilRig macro has run a PowerShell command to decode file contents. OilRig has also used certutil to decode base64-encoded files on victims."}, {"score": 1, "techniqueID": "T1048", "comment": "OilRig has exfiltrated data over FTP separately from its primary C2 channel over DNS."}, {"score": 1, "techniqueID": "T1133", "comment": "OilRig uses remote services such as VPN, Citrix, or OWA to persist in an environment."}, {"score": 1, "techniqueID": "T1008", "comment": "OilRig malware ISMAgent falls back to its DNS tunneling mechanism if it is unable to reach the C2 server over HTTP."}, {"score": 1, "techniqueID": "T1107", "comment": "OilRig has deleted files associated with their payload after execution."}, {"score": 1, "techniqueID": "T1066", "comment": "OilRig has tested malware samples to determine AV detection and subsequently modified the samples to ensure AV evasion."}, {"score": 1, "techniqueID": "T1056", "comment": "OilRig has used a keylogging tool called KEYPUNCH."}, {"score": 1, "techniqueID": "T1046", "comment": "OilRig has used the publicly available tool SoftPerfect Network Scanner as well as a custom tool called GOLDIRONY to conduct network scanning."}, {"score": 1, "techniqueID": "T1027", "comment": "OilRig has encrypted and encoded data in its malware, including by using base64."}, {"score": 1, "techniqueID": "T1201", "comment": "OilRig has used net.exe in a script with net accounts /domain to find the password policy of a domain."}, {"score": 1, "techniqueID": "T1069", "comment": "OilRig has used net group /domain, net localgroup administrators, net group “domain admins” /domain, and net group “Exchange Trusted Subsystem” /domain to find group permission settings on a victim."}, {"score": 1, "techniqueID": "T1086", "comment": "OilRig has used PowerShell scripts for execution, including use of a macro to run a PowerShell command to decode file contents."}, {"score": 1, "techniqueID": "T1057", "comment": "OilRig has run tasklist on a victim's machine."}, {"score": 1, "techniqueID": "T1012", "comment": "OilRig has used reg query “HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Default” on a victim to query the Registry."}, {"score": 1, "techniqueID": "T1108", "comment": "OilRig has used RGDoor via Web shell to establish redundant access. The group has also used harvested credentials to gain access to Internet-accessible resources such as Outlook Web Access, which could be used for redundant access."}, {"score": 1, "techniqueID": "T1076", "comment": "OilRig has used Remote Desktop Protocol for lateral movement. The group has also used tunneling tools to tunnel RDP into the environment."}, {"score": 1, "techniqueID": "T1105", "comment": "OilRig can download remote files onto victims."}, {"score": 1, "techniqueID": "T1021", "comment": "OilRig has used Putty to access compromised systems."}, {"score": 1, "techniqueID": "T1053", "comment": "OilRig has created scheduled tasks that run a VBScript to execute a payload on victim machines."}, {"score": 1, "techniqueID": "T1113", "comment": "OilRig has a tool called CANDYKING to capture a screenshot of user's desktop."}, {"score": 1, "techniqueID": "T1064", "comment": "OilRig has used various types of scripting for execution, including .bat and .vbs scripts. The group has also used macros to deliver malware such as QUADAGENT and OopsIE."}, {"score": 1, "techniqueID": "T1193", "comment": "OilRig has sent spearphising emails with malicious attachments to potential victims using compromised and/or spoofed email accounts."}, {"score": 1, "techniqueID": "T1192", "comment": "OilRig has sent spearphising emails with malicious links to potential victims."}, {"score": 1, "techniqueID": "T1071", "comment": "OilRig has used HTTP and DNS for C2. The group has also used the Plink utility and other tools to create tunnels to C2 servers."}, {"score": 1, "techniqueID": "T1032", "comment": "OilRig used the Plink utility and other tools to create tunnels to C2 servers."}, {"score": 1, "techniqueID": "T1082", "comment": "OilRig has run hostname and systeminfo on a victim."}, {"score": 1, "techniqueID": "T1016", "comment": "OilRig has run ipconfig /all on a victim."}, {"score": 1, "techniqueID": "T1049", "comment": "OilRig has used netstat -an on a victim to get a listing of network connections."}, {"score": 1, "techniqueID": "T1033", "comment": "OilRig has run whoami on a victim."}, {"score": 1, "techniqueID": "T1007", "comment": "OilRig has used sc query on a victim to gather information about services."}, {"score": 1, "techniqueID": "T1204", "comment": "OilRig has delivered malicious links and macro-enabled documents that required targets to click the \"enable content\" button to execute the payload on the system."}, {"score": 1, "techniqueID": "T1078", "comment": "OilRig has used compromised credentials to access other systems on a victim network."}, {"score": 1, "techniqueID": "T1100", "comment": "OilRig has used Web shells, often to maintain access to a victim network."}, {"score": 1, "techniqueID": "T1047", "comment": "OilRig has used WMI for execution."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by OilRig", "color": "#66b1ff"}]}