{"description": "Enterprise techniques used by Gazer, ATT&CK software S0168 v1.0", "name": "Gazer (S0168)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1116", "comment": "Gazer versions are signed with various valid certificates; one was likely faked and issued by Comodo for \"Solid Loop Ltd,\" and another was issued for \"Ultimate Computer Support Ltd.\""}, {"score": 1, "techniqueID": "T1090", "comment": "Gazer identifies a proxy server if it exists and uses it to make HTTP requests."}, {"score": 1, "techniqueID": "T1024", "comment": "Gazer uses custom encryption for C2 using 3DES and RSA."}, {"score": 1, "techniqueID": "T1107", "comment": "Gazer has commands to delete files and persistence mechanisms from the victim."}, {"score": 1, "techniqueID": "T1096", "comment": "Gazer stores configuration items in alternate data streams (ADSs) if the Registry is not accessible."}, {"score": 1, "techniqueID": "T1027", "comment": "Gazer logs its actions into files that are encrypted with 3DES. It also uses RSA to encrypt resources."}, {"score": 1, "techniqueID": "T1055", "comment": "Gazer performs thread execution hijacking to inject its orchestrator into a running thread from a remote process. Gazer performs a separate injection of its communication module into an Internet accessible process through which it performs C2."}, {"score": 1, "techniqueID": "T1060", "comment": "Gazer can establish persistence by creating a .lnk file in the Start menu."}, {"score": 1, "techniqueID": "T1105", "comment": "Gazer can execute a task to download a file."}, {"score": 1, "techniqueID": "T1053", "comment": "Gazer can establish persistence by creating a scheduled task."}, {"score": 1, "techniqueID": "T1180", "comment": "Gazer can establish persistence through the system screensaver by configuring it to execute the malware."}, {"score": 1, "techniqueID": "T1023", "comment": "Gazer can establish persistence by creating a .lnk file in the Start menu or by modifying existing .lnk files to execute the malware through cmd.exe."}, {"score": 1, "techniqueID": "T1071", "comment": "Gazer communicates with its C2 servers over HTTP."}, {"score": 1, "techniqueID": "T1033", "comment": "Gazer obtains the current user's security identifier."}, {"score": 1, "techniqueID": "T1099", "comment": "For early Gazer versions, the compilation timestamp was faked."}, {"score": 1, "techniqueID": "T1004", "comment": "Gazer can establish persistence by setting the value “Shell” with “explorer.exe, %malware_pathfile%” under the Registry key HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Gazer", "color": "#66b1ff"}]}