{"description": "Enterprise techniques used by Hydraq, ATT&CK software S0203 v1.0", "name": "Hydraq (S0203)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "Hydraq creates a backdoor through which remote attackers can adjust token privileges."}, {"score": 1, "techniqueID": "T1024", "comment": "Hydraq C2 traffic is encrypted using bitwise NOT and XOR operations."}, {"score": 1, "techniqueID": "T1005", "comment": "Hydraq creates a backdoor through which remote attackers can read data from files."}, {"score": 1, "techniqueID": "T1129", "comment": "Hydraq creates a backdoor through which remote attackers can load and call DLL functions."}, {"score": 1, "techniqueID": "T1048", "comment": "Hydraq connects to a predefined domain on port 443 to exfil gathered information."}, {"score": 1, "techniqueID": "T1083", "comment": "Hydraq creates a backdoor through which remote attackers can check for the existence of files, including its own components, as well as retrieve a list of logical drives."}, {"score": 1, "techniqueID": "T1107", "comment": "Hydraq creates a backdoor through which remote attackers can delete files."}, {"score": 1, "techniqueID": "T1070", "comment": "Hydraq creates a backdoor through which remote attackers can clear all system event logs."}, {"score": 1, "techniqueID": "T1112", "comment": "Hydraq creates a Registry subkey to register its created service, and can also uninstall itself later by deleting this value. Hydraq's backdoor also enables remote attackers to modify and delete subkeys."}, {"score": 1, "techniqueID": "T1050", "comment": "Hydraq creates new services to establish persistence."}, {"score": 1, "techniqueID": "T1027", "comment": "Hydraq uses basic obfuscation in the form of spaghetti code."}, {"score": 1, "techniqueID": "T1057", "comment": "Hydraq creates a backdoor through which remote attackers can monitor processes."}, {"score": 1, "techniqueID": "T1012", "comment": "Hydraq creates a backdoor through which remote attackers can retrieve system information, such as CPU speed, from Registry keys."}, {"score": 1, "techniqueID": "T1105", "comment": "Hydraq creates a backdoor through which remote attackers can download files and additional malware components."}, {"score": 1, "techniqueID": "T1113", "comment": "Hydraq includes a component based on the code of VNC that can stream a live feed of the desktop of an infected host."}, {"score": 1, "techniqueID": "T1035", "comment": "Hydraq uses svchost.exe to execute a malicious DLL included in a new service group."}, {"score": 1, "techniqueID": "T1082", "comment": "Hydraq creates a backdoor through which remote attackers can retrieve information such as computer name, OS version, processor speed, memory size, and CPU speed."}, {"score": 1, "techniqueID": "T1016", "comment": "Hydraq creates a backdoor through which remote attackers can retrieve IP addresses of compromised machines."}, {"score": 1, "techniqueID": "T1007", "comment": "Hydraq creates a backdoor through which remote attackers can monitor services."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Hydraq", "color": "#66b1ff"}]}