{"description": "Enterprise techniques used by Cobalt Strike, ATT&CK software S0154 v1.2", "name": "Cobalt Strike (S0154)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "Cobalt Strike can steal access tokens from exiting processes and make tokens from known credentials."}, {"score": 1, "techniqueID": "T1197", "comment": "Cobalt Strike can download a hosted \"beacon\" payload using BITSAdmin."}, {"score": 1, "techniqueID": "T1088", "comment": "Cobalt Strike can use a number of known techniques to bypass Windows UAC."}, {"score": 1, "techniqueID": "T1059", "comment": "Cobalt Strike uses a command-line interface to interact with systems."}, {"score": 1, "techniqueID": "T1043", "comment": "Cobalt Strike uses a custom command and control protocol that communicates over commonly used ports. The C2 protocol is encapsulated in common application layer protocols."}, {"score": 1, "techniqueID": "T1090", "comment": "Cobalt Strike can be configured to have commands relayed over a peer-to-peer network of infected hosts. This can be used to limit the number of egress points, or provide access to a host without direct internet access."}, {"score": 1, "techniqueID": "T1003", "comment": "Cobalt Strike can recover hashed passwords."}, {"score": 1, "techniqueID": "T1094", "comment": "Cobalt Strike allows adversaries to modify the way the \"beacon\" payload communicates. This is called \"Malleable C2\" in the Cobalt Strike manual and is intended to allow a penetration test team to mimic known APT C2 methods."}, {"score": 1, "techniqueID": "T1005", "comment": "Cobalt Strike can collect data from a local system."}, {"score": 1, "techniqueID": "T1175", "comment": "Cobalt Strike can deliver \"beacon\" payloads for lateral movement by leveraging remote COM execution."}, {"score": 1, "techniqueID": "T1106", "comment": "Cobalt Strike's \"beacon\" payload is capable of running shell commands without cmd.exe and PowerShell commands without powershell.exe"}, {"score": 1, "techniqueID": "T1068", "comment": "Cobalt Strike can exploit vulnerabilities such as MS14-058."}, {"score": 1, "techniqueID": "T1066", "comment": "Cobalt Strike includes a capability to modify the \"beacon\" payload to eliminate known signatures or unpacking methods."}, {"score": 1, "techniqueID": "T1056", "comment": "Cobalt Strike can track key presses with a keylogger module."}, {"score": 1, "techniqueID": "T1185", "comment": "Cobalt Strike can perform browser pivoting and inject into a user's browser to inherit cookies, authenticated HTTP sessions, and client SSL certificates."}, {"score": 1, "techniqueID": "T1026", "comment": "Cobalt Strike's \"beacon\" payload can receive C2 from one protocol and respond on another. This is typically a mixture of HTTP, HTTPS, and DNS traffic."}, {"score": 1, "techniqueID": "T1046", "comment": "Cobalt Strike can perform port scans from an infected host."}, {"score": 1, "techniqueID": "T1135", "comment": "Cobalt Strike can query shared drives on the local system."}, {"score": 1, "techniqueID": "T1050", "comment": "Cobalt Strike can install a new service."}, {"score": 1, "techniqueID": "T1075", "comment": "Cobalt Strike can perform pass the hash."}, {"score": 1, "techniqueID": "T1086", "comment": "Cobalt Strike can execute a payload on a remote host with PowerShell. This technique does not write any data to disk."}, {"score": 1, "techniqueID": "T1057", "comment": "Cobalt Strike's \"beacon\" payload can collect information on process details."}, {"score": 1, "techniqueID": "T1093", "comment": "Cobalt Strike can use process hollowing for execution."}, {"score": 1, "techniqueID": "T1055", "comment": "Cobalt Strike can inject a variety of payloads into processes dynamically chosen by the adversary."}, {"score": 1, "techniqueID": "T1076", "comment": "Cobalt Strike can start a VNC-based remote desktop server and tunnel the connection through the already established C2 channel."}, {"score": 1, "techniqueID": "T1021", "comment": "Cobalt Strike can SSH to a remote service."}, {"score": 1, "techniqueID": "T1018", "comment": "Cobalt Strike uses the native Windows Network Enumeration APIs to interrogate and discover targets in a Windows Active Directory network."}, {"score": 1, "techniqueID": "T1029", "comment": "Cobalt Strike can set its \"beacon\" payload to reach out to the C2 server on an arbitrary and random interval. In addition it will break large data sets into smaller chunks for exfiltration."}, {"score": 1, "techniqueID": "T1113", "comment": "Cobalt Strike's \"beacon\" payload is capable of capturing screen shots."}, {"score": 1, "techniqueID": "T1064", "comment": "Cobalt Strike can use PowerShell, Python, VBA, PowerSploit, other scripting frameworks to perform execution."}, {"score": 1, "techniqueID": "T1035", "comment": "Cobalt Strike can use PsExec to execute a payload on a remote host. It can also use Service Control Manager to start new services."}, {"score": 1, "techniqueID": "T1071", "comment": "Cobalt Strike uses a custom command and control protocol that is encapsulated in HTTP, HTTPS, or DNS. In addition, it conducts peer-to-peer communication over Windows named pipes encapsulated in the SMB protocol. All protocols use their standard assigned ports."}, {"score": 1, "techniqueID": "T1099", "comment": "Cobalt Strike will timestomp any files or payloads placed on a target machine to help them blend in."}, {"score": 1, "techniqueID": "T1078", "comment": "Cobalt Strike can use known credentials to run commands and spawn processes as another user."}, {"score": 1, "techniqueID": "T1077", "comment": "Cobalt Strike can use Window admin shares (C$ and ADMIN$) for lateral movement."}, {"score": 1, "techniqueID": "T1047", "comment": "Cobalt Strike can use WMI to deliver a payload to a remote host."}, {"score": 1, "techniqueID": "T1028", "comment": "Cobalt Strike can use WinRM to execute a payload on a remote host."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Cobalt Strike", "color": "#66b1ff"}]}