{"description": "Enterprise techniques used by Kwampirs, ATT&CK software S0236 v1.0", "name": "Kwampirs (S0236)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Kwampirs collects a list of accounts with the command net users."}, {"score": 1, "techniqueID": "T1009", "comment": "Before writing to disk, Kwampirs inserts a randomly generated string into the middle of the decrypted payload in an attempt to evade hash-based detections."}, {"score": 1, "techniqueID": "T1140", "comment": "Kwampirs decrypts and extracts a copy of its main DLL payload when executing."}, {"score": 1, "techniqueID": "T1008", "comment": "Kwampirs uses a large list of C2 servers that it cycles through until a successful connection is established."}, {"score": 1, "techniqueID": "T1083", "comment": "Kwampirs collects a list of files and directories in C:\\ with the command dir /s /a c:\\ &gt;&gt; \"C:\\windows\\TEMP[RANDOM].tmp\"."}, {"score": 1, "techniqueID": "T1036", "comment": "Kwampirs establishes persistence by adding a new service with the display name \"WMI Performance Adapter Extension\" in an attempt to masquerade as a legitimate WMI service."}, {"score": 1, "techniqueID": "T1135", "comment": "Kwampirs collects a list of network shares with the command net share."}, {"score": 1, "techniqueID": "T1050", "comment": "Kwampirs creates a new service named WmiApSrvEx to establish persistence."}, {"score": 1, "techniqueID": "T1027", "comment": "Kwampirs downloads additional files that are base64-encoded and encrypted with another cipher."}, {"score": 1, "techniqueID": "T1201", "comment": "Kwampirs collects password policy information with the command net accounts."}, {"score": 1, "techniqueID": "T1069", "comment": "Kwampirs collects lists of local accounts with administrative access, local group user accounts, and domain local groups with the commands net localgroup administrators, net localgroup users, and net localgroup /domain."}, {"score": 1, "techniqueID": "T1057", "comment": "Kwampirs collects a list of running services with the command tasklist /v."}, {"score": 1, "techniqueID": "T1105", "comment": "Kwampirs downloads additional files from C2 servers."}, {"score": 1, "techniqueID": "T1018", "comment": "Kwampirs collects a list of available servers with the command net view."}, {"score": 1, "techniqueID": "T1085", "comment": "Kwampirs uses rundll32.exe in a Registry value added to establish persistence."}, {"score": 1, "techniqueID": "T1082", "comment": "Kwampirs collects OS version information such as registered owner details, manufacturer details, processor type, available storage, installed patches, hostname, version info, system date, and other system information by using the commands systeminfo, net config workstation, hostname, ver, set, and date /t."}, {"score": 1, "techniqueID": "T1016", "comment": "Kwampirs collects network adapter and interface information by using the commands ipconfig /all, arp -a and route print. It also collects the system's MAC address with getmac and domain configuration with net config workstation."}, {"score": 1, "techniqueID": "T1049", "comment": "Kwampirs collects a list of active and listening connections by using the command netstat -nao as well as a list of available network mappings with net use."}, {"score": 1, "techniqueID": "T1033", "comment": "Kwampirs collects registered owner details by using the commands systeminfo and net config workstation."}, {"score": 1, "techniqueID": "T1007", "comment": "Kwampirs collects a list of running services with the command tasklist /svc."}, {"score": 1, "techniqueID": "T1077", "comment": "Kwampirs copies itself over network shares to move laterally on a victim network."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Kwampirs", "color": "#66b1ff"}]}