{"description": "Enterprise techniques used by Cobalt Group, ATT&CK group G0080 v1.1", "name": "Cobalt Group (G0080)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1088", "comment": "Cobalt Group has bypassed UAC."}, {"score": 1, "techniqueID": "T1191", "comment": "Cobalt Group has used the command cmstp.exe /s /ns C:\\Users\\ADMINI~W\\AppData\\Local\\Temp\\XKNqbpzl.txt to bypass AppLocker and launch a malicious script."}, {"score": 1, "techniqueID": "T1059", "comment": "Cobalt Group has used a JavaScript backdoor that is capable of launching cmd.exe to execute shell commands."}, {"score": 1, "techniqueID": "T1173", "comment": "Cobalt Group has sent malicious Word OLE compound documents to victims."}, {"score": 1, "techniqueID": "T1203", "comment": "Cobalt Group had exploited multiple vulnerabilities for execution, including Microsoft’s Equation Editor (CVE-2017-11882), an Internet Explorer vulnerability (CVE-2018-8174), CVE-2017-8570, CVE-2017-0199, and CVE-2017-8759."}, {"score": 1, "techniqueID": "T1068", "comment": "Cobalt Group has used exploits to increase their levels of rights and privileges."}, {"score": 1, "techniqueID": "T1107", "comment": "Cobalt Group deleted the DLL dropper from the victim’s machine to cover their tracks."}, {"score": 1, "techniqueID": "T1037", "comment": "Cobalt Group has added persistence by registering the file name for the next stage malware under UserInitMprLogonScript."}, {"score": 1, "techniqueID": "T1046", "comment": "Cobalt Group leveraged an open-source tool called SoftPerfect Network Scanner to perform network scanning."}, {"score": 1, "techniqueID": "T1050", "comment": "Cobalt Group has created new services to establish persistence."}, {"score": 1, "techniqueID": "T1027", "comment": "Cobalt Group obfuscated several scriptlets and code used on the victim’s machine, including through use of XOR and RC4."}, {"score": 1, "techniqueID": "T1086", "comment": "Cobalt Group has used powershell.exe to download and execute scripts."}, {"score": 1, "techniqueID": "T1055", "comment": "Cobalt Group has injected code into trusted processes."}, {"score": 1, "techniqueID": "T1108", "comment": "Cobalt Group has used TeamViewer to preserve remote access in case control using the Cobalt Strike module was lost."}, {"score": 1, "techniqueID": "T1060", "comment": "Cobalt Group has used Registry Run keys for persistence. The group has also set a Startup path to launch the PowerShell shell command and download Cobalt Strike."}, {"score": 1, "techniqueID": "T1117", "comment": "Cobalt Group has used regsvr32.exe to execute scripts."}, {"score": 1, "techniqueID": "T1219", "comment": "Cobalt Group used the Ammyy Admin tool as well as TeamViewer for remote access."}, {"score": 1, "techniqueID": "T1076", "comment": "Cobalt Group has used Remote Desktop Protocol to conduct lateral movement."}, {"score": 1, "techniqueID": "T1105", "comment": "Cobalt Group has used public sites such as github.com and sendspace.com to upload files and then download them to victim computers. The group's JavaScript backdoor is also capable of downloading files."}, {"score": 1, "techniqueID": "T1053", "comment": "Cobalt Group has created Windows tasks to establish persistence."}, {"score": 1, "techniqueID": "T1064", "comment": "Cobalt Group has sent Word OLE compound documents with malicious obfuscated VBA macros that will run upon user execution and executed JavaScript scriptlets on the victim's machine. The group has also used an exploit toolkit known as Threadkit that launches .bat files."}, {"score": 1, "techniqueID": "T1063", "comment": "Cobalt Group used a JavaScript backdoor that is capable of collecting a list of the security solutions installed on the victim's machine."}, {"score": 1, "techniqueID": "T1218", "comment": "Cobalt Group has used odbcconf to proxy the execution of malicious DLL files."}, {"score": 1, "techniqueID": "T1193", "comment": "Cobalt Group has sent spearphishing emails with various attachment types to corporate and personal email accounts of victim organizations. Attachment types have included .rtf, .doc, .xls, archives containing LNK files, and password protected archives containing .exe and .scr executables."}, {"score": 1, "techniqueID": "T1192", "comment": "Cobalt Group has sent emails with URLs pointing to malicious documents."}, {"score": 1, "techniqueID": "T1071", "comment": "Cobalt Group has used HTTPS and DNS tunneling for C2. The group has also used the Plink utility to create SSH tunnels."}, {"score": 1, "techniqueID": "T1032", "comment": "Cobalt Group has used the Plink utility to create SSH tunnels."}, {"score": 1, "techniqueID": "T1204", "comment": "Cobalt Group has sent emails containing malicious attachments or links that require users to execute a file or macro to infect the victim machine."}, {"score": 1, "techniqueID": "T1220", "comment": "Cobalt Group used msxsl.exe to bypass AppLocker and to invoke Jscript code from an XSL file."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Cobalt Group", "color": "#66b1ff"}]}