{"description": "Enterprise techniques used by CosmicDuke, ATT&CK software S0050 v1.0", "name": "CosmicDuke (S0050)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1020", "comment": "CosmicDuke exfiltrates collected files automatically over FTP to remote servers."}, {"score": 1, "techniqueID": "T1115", "comment": "CosmicDuke copies and exfiltrates the clipboard contents every 30 seconds."}, {"score": 1, "techniqueID": "T1003", "comment": "CosmicDuke collects user credentials, including passwords, for various programs and browsers, including popular instant messaging applications, Web browsers, and email clients. Windows account hashes, domain accounts, and LSA secrets are also collected, as are WLAN keys."}, {"score": 1, "techniqueID": "T1024", "comment": "CosmicDuke contains a custom version of the RC4 algorithm that includes a programming error."}, {"score": 1, "techniqueID": "T1005", "comment": "CosmicDuke steals user files from local hard drives with file extensions that match a predefined list."}, {"score": 1, "techniqueID": "T1039", "comment": "CosmicDuke steals user files from network shared drives with file extensions and keywords that match a predefined list."}, {"score": 1, "techniqueID": "T1025", "comment": "CosmicDuke steals user files from removable media with file extensions and keywords that match a predefined list."}, {"score": 1, "techniqueID": "T1114", "comment": "CosmicDuke searches for Microsoft Outlook data files with extensions .pst and .ost for collection and exfiltration."}, {"score": 1, "techniqueID": "T1048", "comment": "CosmicDuke exfiltrates collected files over FTP or WebDAV. Exfiltration servers can be separately configured from C2 servers."}, {"score": 1, "techniqueID": "T1068", "comment": "CosmicDuke attempts to exploit privilege escalation vulnerabilities CVE-2010-0232 or CVE-2010-4398."}, {"score": 1, "techniqueID": "T1083", "comment": "CosmicDuke searches attached and mounted drives for file extensions and keywords that match a predefined list."}, {"score": 1, "techniqueID": "T1056", "comment": "CosmicDuke uses a keylogger and steals clipboard contents from victims."}, {"score": 1, "techniqueID": "T1050", "comment": "CosmicDuke uses Windows services typically named \"javamtsup\" for persistence."}, {"score": 1, "techniqueID": "T1053", "comment": "CosmicDuke uses scheduled tasks typically named \"Watchmon Service\" for persistence."}, {"score": 1, "techniqueID": "T1113", "comment": "CosmicDuke takes periodic screenshots and exfiltrates them."}, {"score": 1, "techniqueID": "T1071", "comment": "CosmicDuke can use HTTP or HTTPS for command and control to hard-coded C2 servers."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by CosmicDuke", "color": "#66b1ff"}]}