{"description": "Enterprise techniques used by Zeus Panda, ATT&CK software S0330 v1.0", "name": "Zeus Panda (S0330)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1115", "comment": "Zeus Panda can hook GetClipboardData function to watch for clipboard pastes to collect."}, {"score": 1, "techniqueID": "T1059", "comment": "Zeus Panda can launch an interface where it can execute several commands on the victim’s PC."}, {"score": 1, "techniqueID": "T1140", "comment": "Zeus Panda decrypts strings in the code during the execution process."}, {"score": 1, "techniqueID": "T1083", "comment": "Zeus Panda searches for specific directories on the victim’s machine."}, {"score": 1, "techniqueID": "T1107", "comment": "Zeus Panda has a command to delete a file."}, {"score": 1, "techniqueID": "T1179", "comment": "Zeus Panda hooks processes by leveraging its own IAT hooked functions."}, {"score": 1, "techniqueID": "T1070", "comment": "Zeus Panda can uninstall scripts and delete files to cover its track."}, {"score": 1, "techniqueID": "T1056", "comment": "Zeus Panda can perform keylogging on the victim’s machine by hooking the functions TranslateMessage and WM_KEYDOWN."}, {"score": 1, "techniqueID": "T1112", "comment": "Zeus Panda modifies several Registry keys under HKCU\\Software\\Microsoft\\Internet Explorer\\ PhishingFilter\\ to disable phishing filters."}, {"score": 1, "techniqueID": "T1027", "comment": "Zeus Panda encrypts strings with XOR and obfuscates the macro code from the initial payload. Zeus Panda also encrypts all configuration and settings in AES and RC4."}, {"score": 1, "techniqueID": "T1086", "comment": "Zeus Panda uses PowerShell to download and execute the payload."}, {"score": 1, "techniqueID": "T1057", "comment": "Zeus Panda checks for running processes on the victim’s machine."}, {"score": 1, "techniqueID": "T1055", "comment": "Zeus Panda checks processes on the system and if they meet the necessary requirements, it injects into that process."}, {"score": 1, "techniqueID": "T1012", "comment": "Zeus Panda checks for the existence of a Registry key and if it contains certain values."}, {"score": 1, "techniqueID": "T1060", "comment": "Zeus Panda adds persistence by creating Registry Run keys."}, {"score": 1, "techniqueID": "T1105", "comment": "Zeus Panda can download additional malware plug-in modules and execute them on the victim’s machine."}, {"score": 1, "techniqueID": "T1113", "comment": "Zeus Panda can take screenshots of the victim’s machine."}, {"score": 1, "techniqueID": "T1064", "comment": "Zeus Panda can launch remote scripts on the victim’s machine."}, {"score": 1, "techniqueID": "T1063", "comment": "Zeus Panda checks to see if anti-virus, anti-spyware, or firewall products are installed in the victim’s environment."}, {"score": 1, "techniqueID": "T1071", "comment": "Zeus Panda uses HTTP for C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "Zeus Panda collects the OS version, system architecture, computer name, product ID, install date, and information on the keyboard mapping to determine the language used on the system."}, {"score": 1, "techniqueID": "T1124", "comment": "Zeus Panda collects the current system time (UTC) and sends it back to the C2 server."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Zeus Panda", "color": "#66b1ff"}]}