{"description": "Enterprise techniques used by Ke3chang, ATT&CK group G0004 v1.1", "name": "Ke3chang (G0004)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Ke3chang performs account discovery using commands such as net localgroup administrators and net group \"REDACTED\" /domain on specific permissions groups."}, {"score": 1, "techniqueID": "T1059", "comment": "Malware used by Ke3chang can run commands on the command-line interface."}, {"score": 1, "techniqueID": "T1003", "comment": "Ke3chang has dumped credentials, including by using Mimikatz."}, {"score": 1, "techniqueID": "T1002", "comment": "The Ke3chang group has been known to compress data before exfiltration."}, {"score": 1, "techniqueID": "T1022", "comment": "Ke3chang is known to use RAR with passwords to encrypt data prior to exfiltration."}, {"score": 1, "techniqueID": "T1213", "comment": "Ke3chang used a SharePoint enumeration and data dumping tool known as spwebmember."}, {"score": 1, "techniqueID": "T1005", "comment": "Ke3chang gathered information and files from local directories for exfiltration."}, {"score": 1, "techniqueID": "T1114", "comment": "Ke3chang used a .NET tool to dump data from Microsoft Exchange mailboxes."}, {"score": 1, "techniqueID": "T1041", "comment": "Ke3chang transferred compressed and encrypted RAR files containing exfiltration through the established backdoor command and control channel during operations."}, {"score": 1, "techniqueID": "T1133", "comment": "Ke3chang regained access after eviction via the corporate VPN solution with a stolen VPN certificate, which they had extracted from a compromised host."}, {"score": 1, "techniqueID": "T1083", "comment": "Ke3chang uses command-line interaction to search files and directories."}, {"score": 1, "techniqueID": "T1056", "comment": "Ke3chang has used keyloggers."}, {"score": 1, "techniqueID": "T1036", "comment": "Ke3chang has used the right-to-left override character in spearphishing attachment names to trick targets into executing .scr and .exe files."}, {"score": 1, "techniqueID": "T1050", "comment": "Ke3chang backdoor RoyalDNS established persistence through adding a service called Nwsapagent."}, {"score": 1, "techniqueID": "T1097", "comment": "Ke3chang has used Mimikatz to generate Kerberos golden tickets."}, {"score": 1, "techniqueID": "T1069", "comment": "Ke3chang performs discovery of permission groups net group /domain."}, {"score": 1, "techniqueID": "T1057", "comment": "Ke3chang performs process discovery using tasklist commands."}, {"score": 1, "techniqueID": "T1060", "comment": "Several Ke3chang backdoors achieved persistence by adding a Run key."}, {"score": 1, "techniqueID": "T1018", "comment": "Ke3chang has used network scanning and enumeration tools, including Ping."}, {"score": 1, "techniqueID": "T1064", "comment": "Ke3chang has used batch scripts in its malware to install persistence mechanisms."}, {"score": 1, "techniqueID": "T1035", "comment": "Ke3chang has used a tool known as RemoteExec (similar to PsExec) to remotely execute batch scripts and binaries."}, {"score": 1, "techniqueID": "T1071", "comment": "Ke3chang malware RoyalCli and BS2005 have communicated over HTTP with the C2 server through Internet Explorer (IE) by using the COM interface IWebBrowser2. Additionally, Ke3chang malware RoyalDNS has used DNS for C2."}, {"score": 1, "techniqueID": "T1082", "comment": "Ke3chang performs operating system information discovery using systeminfo."}, {"score": 1, "techniqueID": "T1016", "comment": "Ke3chang performs local network configuration discovery using ipconfig."}, {"score": 1, "techniqueID": "T1049", "comment": "Ke3chang performs local network connection discovery using netstat."}, {"score": 1, "techniqueID": "T1007", "comment": "Ke3chang performs service discovery using net start commands."}, {"score": 1, "techniqueID": "T1077", "comment": "Ke3chang actors have been known to copy files to the network shares of other computers to move laterally."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Ke3chang", "color": "#66b1ff"}]}