{"description": "Enterprise techniques used by Restrict Web-Based Content, ATT&CK mitigation M1021 v1.0", "name": "Restrict Web-Based Content (M1021)", "domain": "enterprise-attack", "versions": {"layer": "4.3", "attack": "10", "navigator": "4.5"}, "techniques": [{"score": 1, "techniqueID": "T1059", "showSubtechniques": true, "comment": "Script blocking extensions can help prevent the execution of scripts and HTA files that may commonly be used during the exploitation process. For malicious code served up through ads, adblockers can help prevent that code from executing in the first place."}, {"score": 1, "techniqueID": "T1059.005", "showSubtechniques": true, "comment": "Script blocking extensions can help prevent the execution of scripts and HTA files that may commonly be used during the exploitation process. For malicious code served up through ads, adblockers can help prevent that code from executing in the first place."}, {"score": 1, "techniqueID": "T1059.007", "showSubtechniques": true, "comment": "Script blocking extensions can help prevent the execution of JavaScript and HTA files that may commonly be used during the exploitation process. For malicious code served up through ads, adblockers can help prevent that code from executing in the first place."}, {"score": 1, "techniqueID": "T1189", "showSubtechniques": false, "comment": "For malicious code served up through ads, adblockers can help prevent that code from executing in the first place.\n\nScript blocking extensions can help prevent the execution of JavaScript that may commonly be used during the exploitation process."}, {"score": 1, "techniqueID": "T1568", "showSubtechniques": true, "comment": "In some cases a local DNS sinkhole may be used to help prevent behaviors associated with dynamic resolution."}, {"score": 1, "techniqueID": "T1568.002", "showSubtechniques": true, "comment": "In some cases a local DNS sinkhole may be used to help prevent DGA-based command and control at a reduced cost."}, {"score": 1, "techniqueID": "T1567", "showSubtechniques": true, "comment": "Web proxies can be used to enforce an external network communication policy that prevents use of unauthorized external services."}, {"score": 1, "techniqueID": "T1567.001", "showSubtechniques": true, "comment": "Web proxies can be used to enforce an external network communication policy that prevents use of unauthorized external services."}, {"score": 1, "techniqueID": "T1567.002", "showSubtechniques": true, "comment": "Web proxies can be used to enforce an external network communication policy that prevents use of unauthorized external services."}, {"score": 1, "techniqueID": "T1566", "showSubtechniques": true, "comment": "Determine if certain websites or attachment types (ex: .scr, .exe, .pif, .cpl, etc.) that can be used for phishing are necessary for business operations and consider blocking access if activity cannot be monitored well or if it poses a significant risk."}, {"score": 1, "techniqueID": "T1566.001", "showSubtechniques": true, "comment": "Block unknown or unused attachments by default that should not be transmitted over email as a best practice to prevent some vectors, such as .scr, .exe, .pif, .cpl, etc. Some email scanning devices can open and analyze compressed and encrypted formats, such as zip and rar that may be used to conceal malicious attachments."}, {"score": 1, "techniqueID": "T1566.002", "showSubtechniques": true, "comment": "Determine if certain websites that can be used for spearphishing are necessary for business operations and consider blocking access if activity cannot be monitored well or if it poses a significant risk."}, {"score": 1, "techniqueID": "T1566.003", "showSubtechniques": true, "comment": "Determine if certain social media sites, personal webmail services, or other service that can be used for spearphishing is necessary for business operations and consider blocking access if activity cannot be monitored well or if it poses a significant risk."}, {"techniqueID": "T1218", "showSubtechniques": true}, {"score": 1, "techniqueID": "T1218.001", "showSubtechniques": true, "comment": "Consider blocking download/transfer and execution of potentially uncommon file types known to be used in adversary campaigns, such as CHM files"}, {"score": 1, "techniqueID": "T1528", "showSubtechniques": false, "comment": "Administrators can block end-user consent to OAuth applications, disabling users from authorizing third-party apps through OAuth 2.0 and forcing administrative consent for all requests. They can also block end-user registration of applications by their users, to reduce risk. A Cloud Access Security Broker can also be used to ban applications.\n\nAzure offers a couple of enterprise policy settings in the Azure Management Portal that may help:\n\n\"Users -&gt; User settings -&gt; App registrations: Users can register applications\" can be set to \"no\" to prevent users from registering new applications. \n\"Enterprise applications -&gt; User settings -&gt; Enterprise applications: Users can consent to apps accessing company data on their behalf\" can be set to \"no\" to prevent users from consenting to allow third-party multi-tenant applications"}, {"techniqueID": "T1550", "showSubtechniques": true}, {"score": 1, "techniqueID": "T1550.001", "showSubtechniques": true, "comment": "Update corporate policies to restrict what types of third-party applications may be added to any online service or tool that is linked to the company's information, accounts or network (e.g., Google, Microsoft, Dropbox, Basecamp, GitHub). However, rather than providing high-level guidance on this, be extremely specific—include a list of per-approved applications and deny all others not on the list. Administrators may also block end-user consent through administrative portals, such as the Azure Portal, disabling users from authorizing third-party apps through OAuth and forcing administrative consent.(Citation: Microsoft Azure AD Admin Consent)"}, {"score": 1, "techniqueID": "T1204", "showSubtechniques": true, "comment": "If a link is being visited by a user, block unknown or unused files in transit by default that should not be downloaded or by policy from suspicious sites as a best practice to prevent some vectors, such as .scr, .exe, .pif, .cpl, etc. Some download scanning devices can open and analyze compressed and encrypted formats, such as zip and rar that may be used to conceal malicious files."}, {"score": 1, "techniqueID": "T1204.001", "showSubtechniques": true, "comment": "If a link is being visited by a user, block unknown or unused files in transit by default that should not be downloaded or by policy from suspicious sites as a best practice to prevent some vectors, such as .scr, .exe, .pif, .cpl, etc. Some download scanning devices can open and analyze compressed and encrypted formats, such as zip and rar that may be used to conceal malicious files."}, {"score": 1, "techniqueID": "T1102", "showSubtechniques": true, "comment": "Web proxies can be used to enforce external network communication policy that prevents use of unauthorized external services."}, {"score": 1, "techniqueID": "T1102.001", "showSubtechniques": true, "comment": "Web proxies can be used to enforce external network communication policy that prevents use of unauthorized external services."}, {"score": 1, "techniqueID": "T1102.002", "showSubtechniques": true, "comment": "Web proxies can be used to enforce external network communication policy that prevents use of unauthorized external services."}, {"score": 1, "techniqueID": "T1102.003", "showSubtechniques": true, "comment": "Web proxies can be used to enforce external network communication policy that prevents use of unauthorized external services."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Restrict Web-Based Content", "color": "#66b1ff"}]}