{"description": "Enterprise techniques used by CozyCar, ATT&CK software S0046 v1.1", "name": "CozyCar (S0046)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "A module in CozyCar allows arbitrary commands to be executed by invoking C:\\Windows\\System32\\cmd.exe."}, {"score": 1, "techniqueID": "T1003", "comment": "Password stealer and NTLM stealer modules in CozyCar harvest stored credentials from the victim, including credentials used as part of Windows NTLM user authentication. CozyCar has also executed Mimikatz for further victim penetration."}, {"score": 1, "techniqueID": "T1036", "comment": "The CozyCar dropper has masqueraded a copy of the infected system's rundll32.exe executable that was moved to the malware's install directory and renamed according to a predefined configuration file."}, {"score": 1, "techniqueID": "T1050", "comment": "One persistence mechanism used by CozyCar is to register itself as a Windows service."}, {"score": 1, "techniqueID": "T1027", "comment": "The payload of CozyCar is encrypted with simple XOR with a rotating key. The CozyCar configuration file has been encrypted with RC4 keys."}, {"score": 1, "techniqueID": "T1060", "comment": "One persistence mechanism used by CozyCar is to set itself to be executed at system startup by adding a Registry value under one of the following Registry keys: HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\ HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\ HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run"}, {"score": 1, "techniqueID": "T1085", "comment": "The CozyCar dropper copies the system file rundll32.exe to the install location for the malware, then uses the copy of rundll32.exe to load and execute the main CozyCar component."}, {"score": 1, "techniqueID": "T1053", "comment": "One persistence mechanism used by CozyCar is to register itself as a scheduled task."}, {"score": 1, "techniqueID": "T1063", "comment": "The main CozyCar dropper checks whether the victim has an anti-virus product installed. If the installed product is on a predetermined list, the dropper will exit."}, {"score": 1, "techniqueID": "T1071", "comment": "CozyCar's main method of communicating with its C2 servers is using HTTP or HTTPS."}, {"score": 1, "techniqueID": "T1082", "comment": "A system info module in CozyCar gathers information on the victim host’s configuration."}, {"score": 1, "techniqueID": "T1497", "comment": "Some versions of CozyCar will check to ensure it is not being executed inside a virtual machine or a known malware analysis sandbox environment. If it detects that it is, it will exit."}, {"score": 1, "techniqueID": "T1102", "comment": "CozyCar uses Twitter as a backup C2 channel to Twitter accounts specified in its configuration file."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by CozyCar", "color": "#66b1ff"}]}