{"description": "Enterprise techniques used by Net, ATT&CK software S0039 v2.0", "name": "Net (S0039)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Commands under net user can be used in Net to gather information about and manipulate user accounts."}, {"score": 1, "techniqueID": "T1136", "comment": "The net user username \\password and net user username \\password \\domain commands in Net can be used to create a local or domain account respectively."}, {"score": 1, "techniqueID": "T1126", "comment": "The net use \\system\\share /delete command can be used in Net to remove an established connection to a network share."}, {"score": 1, "techniqueID": "T1135", "comment": "The net view \\remotesystem and net share commands in Net can be used to find shared drives and directories on remote and local systems respectively."}, {"score": 1, "techniqueID": "T1201", "comment": "The net accounts and net accounts /domain commands with Net can be used to obtain password policy information."}, {"score": 1, "techniqueID": "T1069", "comment": "Commands such as net group and net localgroup can be used in Net to gather information about and manipulate groups."}, {"score": 1, "techniqueID": "T1018", "comment": "Commands such as net view can be used in Net to gather information about available remote systems."}, {"score": 1, "techniqueID": "T1035", "comment": "The net start and net stop commands can be used in Net to execute or stop Windows services."}, {"score": 1, "techniqueID": "T1049", "comment": "Commands such as net use and net session can be used in Net to gather information about network connections from a particular host."}, {"score": 1, "techniqueID": "T1007", "comment": "The net start command can be used in Net to find information about Windows services."}, {"score": 1, "techniqueID": "T1124", "comment": "The net time command can be used in Net to determine the local or remote system time."}, {"score": 1, "techniqueID": "T1077", "comment": "Lateral movement can be done with Net through net use commands to connect to the on remote systems."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Net", "color": "#66b1ff"}]}