{"description": "Enterprise techniques used by Mimikatz, ATT&CK software S0002 v1.1", "name": "Mimikatz (S0002)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1098", "comment": "The Mimikatz credential dumper has been extended to include Skeleton Key domain controller authentication bypass functionality. The LSADUMP::ChangeNTLM and LSADUMP::SetNTLM modules can also manipulate the password hash of an account without knowing the clear text value."}, {"score": 1, "techniqueID": "T1003", "comment": "Mimikatz performs credential dumping to obtain account and password information useful in gaining access to additional systems and enterprise network resources. It contains functionality to acquire information about credentials in many ways, including from the LSA, SAM table, credential vault, DCSync/NetSync, and DPAPI."}, {"score": 1, "techniqueID": "T1081", "comment": "Mimikatz's DPAPI module can harvest protected credentials stored and/or cached by browsers and other user applications by interacting with Windows cryptographic application programming interface (API) functions."}, {"score": 1, "techniqueID": "T1207", "comment": "Mimikatz’s LSADUMP::DCShadow module can be used to make AD updates by temporarily setting a computer to be a DC."}, {"score": 1, "techniqueID": "T1075", "comment": "Mimikatz's SEKURLSA::Pth module can impersonate a user, with only a password hash, to execute arbitrary commands."}, {"score": 1, "techniqueID": "T1097", "comment": "Mimikatz’s LSADUMP::DCSync, KERBEROS::Golden, and KERBEROS::PTT modules implement the three steps required to extract the krbtgt account hash and create/use Kerberos tickets."}, {"score": 1, "techniqueID": "T1145", "comment": "Mimikatz's CRYPTO::Extract module can extract keys by interacting with Windows cryptographic application programming interface (API) functions."}, {"score": 1, "techniqueID": "T1101", "comment": "The Mimikatz credential dumper contains an implementation of an SSP."}, {"score": 1, "techniqueID": "T1178", "comment": "Mimikatz's MISC::AddSid module can appended any SID or user/group account to a user's SID-History. Mimikatz also utilizes SID-History Injection to expand the scope of other components such as generated Kerberos Golden Tickets and DCSync beyond a single domain."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Mimikatz", "color": "#66b1ff"}]}