{"description": "Enterprise techniques used by HTTPBrowser, ATT&CK software S0070 v1.0", "name": "HTTPBrowser (S0070)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "HTTPBrowser is capable of spawning a reverse shell on a victim."}, {"score": 1, "techniqueID": "T1043", "comment": "One HTTPBrowser variant connected to its C2 server over port 8080."}, {"score": 1, "techniqueID": "T1038", "comment": "HTTPBrowser abuses the Windows DLL load order by using a legitimate Symantec anti-virus binary, VPDN_LU.exe, to load a malicious DLL that mimics a legitimate Symantec DLL, navlu.dll."}, {"score": 1, "techniqueID": "T1073", "comment": "HTTPBrowser has used DLL side-loading."}, {"score": 1, "techniqueID": "T1083", "comment": "HTTPBrowser is capable of listing files, folders, and drives on a victim."}, {"score": 1, "techniqueID": "T1107", "comment": "HTTPBrowser deletes its original installer file once installation is complete."}, {"score": 1, "techniqueID": "T1056", "comment": "HTTPBrowser is capable of capturing keystrokes on victims."}, {"score": 1, "techniqueID": "T1036", "comment": "HTTPBrowser's installer contains a malicious file named navlu.dll to decrypt and run the RAT. navlu.dll is also the name of a legitimate Symantec DLL."}, {"score": 1, "techniqueID": "T1027", "comment": "HTTPBrowser's code may be obfuscated through structured exception handling and return-oriented programming."}, {"score": 1, "techniqueID": "T1060", "comment": "HTTPBrowser has established persistence by setting the HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run key value for wdm to the path of the executable. It has also used the Registry entry HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Run vpdn “%ALLUSERPROFILE%\\%APPDATA%\\vpdn\\VPDN_LU.exe” to establish persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "HTTPBrowser is capable of writing a file to the compromised system from the C2 server."}, {"score": 1, "techniqueID": "T1071", "comment": "HTTPBrowser has used HTTP, HTTPS, and DNS for command and control."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by HTTPBrowser", "color": "#66b1ff"}]}