{"description": "Enterprise techniques used by Patchwork, ATT&CK group G0040 v1.1", "name": "Patchwork (G0040)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "Patchwork developed a file stealer to search C:\\ and collect files with certain extensions. Patchwork also executed a script to enumerate all drives, store them as a list, and upload generated files to the C2 server."}, {"score": 1, "techniqueID": "T1009", "comment": "Patchwork apparently altered NDiskMonitor samples by adding four bytes of random letters in a likely attempt to change the file hashes."}, {"score": 1, "techniqueID": "T1088", "comment": "Patchwork bypassed User Access Control (UAC)."}, {"score": 1, "techniqueID": "T1059", "comment": "Patchwork ran a reverse shell with Meterpreter."}, {"score": 1, "techniqueID": "T1003", "comment": "Patchwork dumped the login data database from \\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data."}, {"score": 1, "techniqueID": "T1132", "comment": "Patchwork used Base64 to encode C2 traffic."}, {"score": 1, "techniqueID": "T1022", "comment": "Patchwork encrypted the collected files' path with AES and then encoded them with base64."}, {"score": 1, "techniqueID": "T1005", "comment": "Patchwork collected and exfiltrated files from the infected system."}, {"score": 1, "techniqueID": "T1074", "comment": "Patchwork copied all targeted files to a directory called index that was eventually uploaded to the C&amp;C server."}, {"score": 1, "techniqueID": "T1073", "comment": "A Patchwork .dll that contains BADNEWS is loaded and executed using DLL side-loading."}, {"score": 1, "techniqueID": "T1189", "comment": "Patchwork has used watering holes to deliver files with exploits to initial victims."}, {"score": 1, "techniqueID": "T1173", "comment": "Patchwork leveraged the DDE protocol to deliver their malware."}, {"score": 1, "techniqueID": "T1203", "comment": "Patchwork uses malicious documents to deliver remote execution exploits as part of. The group has previously exploited CVE-2017-8570, CVE-2012-1856, CVE-2014-4114, CVE-2017-0199, and CVE-2015-1641."}, {"score": 1, "techniqueID": "T1083", "comment": "A Patchwork payload has searched all fixed drives on the victim for files matching a specified list of extensions."}, {"score": 1, "techniqueID": "T1107", "comment": "Patchwork removed certain files and replaced them so they could not be retrieved."}, {"score": 1, "techniqueID": "T1066", "comment": "Patchwork apparently altered NDiskMonitor samples by adding four bytes of random letters in a likely attempt to change the file hashes."}, {"score": 1, "techniqueID": "T1036", "comment": "Patchwork installed its payload in the startup programs folder as \"Baidu Software Update.\" The group also adds its second stage payload to the startup programs as “Net Monitor.\""}, {"score": 1, "techniqueID": "T1112", "comment": "A Patchwork payload deletes Resiliency Registry keys created by Microsoft Office applications in an apparent effort to trick users into thinking there were no issues during application runs."}, {"score": 1, "techniqueID": "T1027", "comment": "Patchwork has obfuscated a script with Crypto Obfuscator."}, {"score": 1, "techniqueID": "T1086", "comment": "Patchwork used PowerSploit to download payloads, run a reverse shell, and execute malware on the victim's machine."}, {"score": 1, "techniqueID": "T1093", "comment": "A Patchwork payload uses process hollowing to hide the UAC bypass vulnerability exploitation inside svchost.exe."}, {"score": 1, "techniqueID": "T1060", "comment": "Patchwork has added the path of its second-stage malware to the startup folder to achieve persistence. One of its file stealers has also persisted by adding a Registry Run key."}, {"score": 1, "techniqueID": "T1076", "comment": "Patchwork attempted to use RDP to move laterally."}, {"score": 1, "techniqueID": "T1105", "comment": "Patchwork payloads download additional files from the C2 server."}, {"score": 1, "techniqueID": "T1053", "comment": "A Patchwork file stealer can run a TaskScheduler DLL to add persistence."}, {"score": 1, "techniqueID": "T1064", "comment": "Patchwork used Visual Basic Scripts (VBS), JavaScript code, batch files, and .SCT files on victim machines."}, {"score": 1, "techniqueID": "T1063", "comment": "Patchwork scanned the “Program Files” directories for a directory with the string “Total Security” (the installation path of the “360 Total Security” antivirus tool)."}, {"score": 1, "techniqueID": "T1045", "comment": "A Patchwork payload was packed with UPX."}, {"score": 1, "techniqueID": "T1193", "comment": "Patchwork has used spearphishing with an attachment to deliver files with exploits to initial victims."}, {"score": 1, "techniqueID": "T1192", "comment": "Patchwork has used spearphishing with links to deliver files with exploits to initial victims. The group has used embedded image tags (known as web bugs) with unique, per-recipient tracking links in their emails for the purpose of identifying which recipients opened messages."}, {"score": 1, "techniqueID": "T1082", "comment": "Patchwork collected the victim computer name, OS version, and architecture type and sent the information to its C2 server. Patchwork also enumerated all available drives on the victim's machine."}, {"score": 1, "techniqueID": "T1033", "comment": "Patchwork collected the victim username and whether it was running as admin, then sent the information to its C2 server."}, {"score": 1, "techniqueID": "T1204", "comment": "Patchwork embedded a malicious macro in a Word document and lured the victim to click on an icon to execute the malware."}, {"score": 1, "techniqueID": "T1102", "comment": "Patchwork hides base64-encoded and encrypted C2 server locations in comments on legitimate websites."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Patchwork", "color": "#66b1ff"}]}