{"description": "Enterprise techniques used by APT41, ATT&CK group G0096 v1.0", "name": "APT41 (G0096)", "domain": "mitre-enterprise", "version": "2.2", "techniques": [{"score": 1, "techniqueID": "T1015", "comment": "APT41 leveraged sticky keys to establish persistence. [1]"}, {"score": 1, "techniqueID": "T1067", "comment": "APT41 deployed Master Boot Record bootkits on Windows systems to hide their malware and maintain persistence on victim systems.[1]"}, {"score": 1, "techniqueID": "T1110", "comment": "APT41 performed password brute-force attacks on the local admin account.[1]"}, {"score": 1, "techniqueID": "T1146", "comment": "APT41 attempted to remove evidence of some of its activity by deleting Bash histories.[1]"}, {"score": 1, "techniqueID": "T1116", "comment": "APT41 leveraged code-signing certificates to sign malware when targeting both gaming and non-gaming organizations.[1]"}, {"score": 1, "techniqueID": "T1059", "comment": "APT41 used cmd.exe /c to execute commands on remote machines.[1]"}, {"score": 1, "techniqueID": "T1223", "comment": "APT41 used compiled HTML (.chm) files for targeting. [1]"}, {"score": 1, "techniqueID": "T1090", "comment": "APT41 used a tool called CLASSFON to covertly proxy network communications.[1]"}, {"score": 1, "techniqueID": "T1136", "comment": "APT41 created user accounts and adds them to the User and Admin groups. [1]"}, {"score": 1, "techniqueID": "T1003", "comment": "APT41 used the Windows Credential Editor to dump password hashes from memory and authenticate other user accounts.[1]"}, {"score": 1, "techniqueID": "T1002", "comment": "APT41 created a RAR archive of targeted files for exfiltration.[1]"}, {"score": 1, "techniqueID": "T1486", "comment": "APT41 used a ransomware called Encryptor RaaS to encrypt files on the targeted systems and provide a ransom note to the user.[1]"}, {"score": 1, "techniqueID": "T1073", "comment": "APT41 used legitimate executables to perform DLL side-loading of their malware. [1]"}, {"score": 1, "techniqueID": "T1483", "comment": "APT41 used DGA to change their C2 servers monthly.[1]"}, {"score": 1, "techniqueID": "T1203", "comment": "APT41 leveraged the follow exploits in their operations: CVE-2012-0158, CVE-2015-1641, CVE-2017-0199, CVE-2017-11882, and CVE-2019-3396. [1]"}, {"score": 1, "techniqueID": "T1133", "comment": "APT41 compromised an online billing/payment service using VPN access between a third-party service provider and the targeted payment service.[1]"}, {"score": 1, "techniqueID": "T1008", "comment": "APT41 used the Steam community page as a fallback mechanism for C2. [1]"}, {"score": 1, "techniqueID": "T1107", "comment": "APT41 deleted files from the system. [1]"}, {"score": 1, "techniqueID": "T1070", "comment": "APT41 attempted to remove evidence of some of its activity by clearing Windows security and system events.[1]"}, {"score": 1, "techniqueID": "T1056", "comment": "APT41 used a keylogger called GEARSHIFT on a target system.[1]"}, {"score": 1, "techniqueID": "T1036", "comment": "APT41 attempted to masquerade their files as popular anti-virus software.[1]"}, {"score": 1, "techniqueID": "T1031", "comment": "APT41 modified legitimate Windows services to install malware backdoors.[1]"}, {"score": 1, "techniqueID": "T1112", "comment": "APT41 used a malware variant called GOODLUCK to modify the registry in order to steal credentials.[1]"}, {"score": 1, "techniqueID": "T1046", "comment": "APT41 used a malware variant called WIDETONE to conduct port scans on the specified subnets.[1]"}, {"score": 1, "techniqueID": "T1135", "comment": "APT41 used the net share command as part of network reconnaissance.[1]"}, {"score": 1, "techniqueID": "T1086", "comment": "APT41 leveraged PowerShell to deploy malware families in victims’ environments.[1]"}, {"score": 1, "techniqueID": "T1055", "comment": "APT41 malware TIDYELF loaded the main WINTERLOVE component by injecting it into the iexplore.exe process.[1]"}, {"score": 1, "techniqueID": "T1060", "comment": "APT41 created and modified startup files for persistence. [1]"}, {"score": 1, "techniqueID": "T1076", "comment": "APT41 used RDP for lateral movement.[1]"}, {"score": 1, "techniqueID": "T1496", "comment": "APT41 deployed a Monero cryptocurrency mining tool in a victim’s environment.[1]"}, {"score": 1, "techniqueID": "T1014", "comment": "APT41 deployed rootkits on Linux systems.[1]"}, {"score": 1, "techniqueID": "T1053", "comment": "APT41 used a compromised account to create a scheduled task on a system.[1]"}, {"score": 1, "techniqueID": "T1193", "comment": "APT41 sent spearphishing emails with attachments such as compiled HTML (.chm) files to initially compromise their victims.[1]"}, {"score": 1, "techniqueID": "T1071", "comment": "APT41 used DNS for C2 communications. [1]"}, {"score": 1, "techniqueID": "T1195", "comment": "APT41 gained access to production environments where they could inject malicious code into legitimate, signed files and widely distribute them to end users.[1]"}, {"score": 1, "techniqueID": "T1016", "comment": "APT41 collected MAC addresses from victim machines. [1]"}, {"score": 1, "techniqueID": "T1049", "comment": "APT41 used the netstat command as part of network reconnaissance. The group has also used a malware variant, HIGHNOON, to enumerate active RDP sessions. [1]"}, {"score": 1, "techniqueID": "T1033", "comment": "APT41 used the WMIEXEC utility to execute whoami commands on remote machines.[1]"}, {"score": 1, "techniqueID": "T1078", "comment": "APT41 used compromised credentials to log on to other systems.[1]"}, {"score": 1, "techniqueID": "T1102", "comment": "APT41 used legitimate websites for C2 through dead drop resolvers (DDR), including GitHub, Pastebin, and Microsoft TechNet.[1]"}, {"score": 1, "techniqueID": "T1047", "comment": "APT41 used WMI in several ways, including for execution of commands via WMIEXEC as well as for persistence via PowerSploit.[1]"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by APT41", "color": "#66b1ff"}]}