[
{
"id": 91,
"title": "Assets",
"path": "/assets/index.html",
"content": " Assets Assets represent the devices and systems commonly found within Industrial Control System environments. Each asset object includes a mapping of technique relationships that represent the adversary actions that may target the device based on its capability and function. Often, these devices have different names or sector specific terms as you look across the industry. To track these differences more accurately, we use the “Related Assets” field which associates these terms based on similar functions, architectural location, and exposure to similar adversary techniques. Each related asset includes a name, optional sector identifier, and a description to provide nuance to the asset page definition. Although originally represented under the platform field in ATT&CK, Assets are distinctly separate from platforms. Platforms generally describe the operating system or application (i.e., Microsoft Windows) while Assets represent the device which includes considerations for hardware, software, architecture, and intended function. Assets may leverage platforms to describe a device’s commonly observed operating system. Assets: 14 ID Name Domain Description A0008 Application Server ICS Application servers are used across many different sectors to host various diverse software applications necessary to supporting the ICS. Example functions can include data analytics and reporting, alarm management, and the management/coordination of different control servers. The application server typically runs on a modern server operating system (e.g., MS Windows Server). A0007 Control Server ICS Control servers are typically a software platform that runs on a modern server operating system (e.g., MS Windows Server). The server typically uses one or more automation protocols (e.g., Modbus, DNP3) to communicate with the various low-level control devices such as Remote Terminal Units (RTUs) and Programmable Logic Controllers (PLCs). The control server also usually provides an interface/network service to connect with an HMI. A0009 Data Gateway ICS Data Gateway is a device that supports the communication and exchange of data between different systems, networks, or protocols within the ICS. Different types of data gateways are used to perform various functions, including: Protocol Translation: Enable communication to devices that support different or incompatible protocols by translating information from one protocol to another. Media Converter: Convert data across different Layer 1 and 2 network protocols / mediums, for example, converting from Serial to Ethernet. Data Aggregation: Collect and combine data from different devices into one consistent format and protocol interface. Data gateways are often critical to the forwarding/transmission of critical control or monitoring data within the ICS. Further, these devices often have remote various network services that are used to communicate across different zones or networks. These assets may focus on a single function listed below or combinations of these functions to best fit the industry use-case. A0006 Data Historian ICS Data historians, or historian, are systems used to collect and store data, including telemetry, events, alerts, and alarms about the operational process and supporting devices. The historian typically utilizes a database to store this data, and commonly provide tools and interfaces to support the analysis of the data. Data historians are often used to support various engineering or business analysis functions and therefore commonly needs access from the corporate network. Data historians often work in a hierarchical paradigm where lower/site level historians collect and store data which is then aggregated into a site/plant level historian. Therefore, data historians often have remote services that can be accessed externally from the ICS network. A0013 Field I/O ICS Field I/O are devices that communicate with a controller or data aggregator to either send input data or receive output data. Input data may include readings about a given environment/device state from sensors, while output data may include data sent back to actuators for them to either undertake actions or change parameter values. These devices are frequently embedded devices running on lightweight embedded operating systems or RTOSes. A0002 Human-Machine Interface (HMI) ICS Human-Machine Interfaces (HMIs) are systems used by an operator to monitor the real-time status of an operational process and to perform necessary control functions, including the adjustment of device parameters. An HMI can take various forms, including a dedicated screen or control panel integrated with a specific device/controller, or a customizable software GUI application running on a standard operating system (e.g., MS Windows) that interfaces with a control/SCADA server. The HMI is critical to ensuring operators have sufficient visibility and control over the operational process. A0005 Intelligent Electronic Device (IED) ICS An Intelligent Electronic Device (IED) is a type of specialized field device that is designed to perform specific operational functions, frequently for protection, monitoring, or control within the electric sector. IEDs are typically used to both acquire telemetry and execute tailored control algorithms/actions based on customizable parameters/settings. An IED is usually implemented as a dedicated embedded device and supports various network automation protocols to communicate with RTUs and Control Servers. A0012 Jump Host ICS Jump hosts are devices used to support remote management sessions into ICS networks or devices. The system is used to access the ICS environment securely from external networks, such as the corporate network. The user must first remote into the jump host before they can access ICS devices. The jump host may be a customized Windows server using common remote access protocols (e.g., RDP) or a dedicated access management device. The jump host typically performs various security functions to ensure the authenticity of remote sessions, including authentication, enforcing access controls/permissions, and auditing all access attempts. A0003 Programmable Logic Controller (PLC) ICS A Programmable Logic Controller (PLC) is an embedded programmable control device. PLCs typically utilize a modular architecture with separate modules used to support its processing capabilities, communication mediums, and I/O interfaces. PLCs allow for the deployment of customized programs/logic to control or monitor an operational process. This logic is defined using industry specific programming languages, such as IEC 61131 , which define the set of tasks and program organizational units (POUs) included in the device’s programs. PLCs also typically have distinct operating modes (e.g., Remote, Run, Program, Stop) which are used to determine when the device can be programmed or whether it should execute the custom logic. A0004 Remote Terminal Unit (RTU) ICS A Remote Terminal Unit (RTU) is a device that typically resides between field devices (e.g., PLCs, IEDs) and control/SCADA servers and supports various communication interfacing and data aggregation functions. RTUs are typically responsible for forwarding commands from the control server and the collection of telemetry, events, and alerts from the field devices. An RTU can be implemented as a dedicated embedded device, as software platform that runs on a hardened/ruggedized computer, or using a custom application program on a PLC. A0014 Routers ICS A computer that is a gateway between two networks at OSI layer 3 and that relays and directs data packets through that inter-network. The most common form of router operates on IP packets. A0010 Safety Controller ICS Safety controllers are typically a type of field device used to perform the safety critical function. Safety controllers often support the deployment of custom programs/logic, similar to a PLC, but can also be tailored for sector specific functions/applications. The safety controllers typically utilize redundant hardware and processors to ensure they operate reliably if a component fails. A0011 Virtual Private Network (VPN) Server ICS A VPN server is a device that is used to establish a secure network tunnel between itself and other remote VPN devices, including field VPNs. VPN servers can be used to establish a secure connection with a single remote device, or to securely bridge all traffic between two separate networks together by encapsulating all data between those networks. VPN servers typically support remote network services that are used by field VPNs to initiate the establishment of the secure VPN tunnel between the field device and server. A0001 Workstation ICS Workstations are devices used by human operators or engineers to perform various configuration, programming, maintenance, diagnostic, or operational tasks. Workstations typically utilize standard desktop or laptop hardware and operating systems (e.g., MS Windows), but run dedicated control system applications or diagnostic/management software to support interfacing with the control servers or field devices. Some workstations have a fixed location within the network architecture, while others are transient devices that are directly connected to various field devices to support local management activities. "
},
{
"id": 92,
"title": "Routers, Asset A0014",
"path": "/assets/A0014/index.html",
"content": " Routers A computer that is a gateway between two networks at OSI layer 3 and that relays and directs data packets through that inter-network. The most common form of router operates on IP packets.[1] ID: A0014 ⓘ Platforms: Embedded Sectors: General Version: 1.0 Created: 29 September 2023 Last Modified: 16 October 2023 Version Permalink Live Version Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0816 Device Restart/Shutdown ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0822 External Remote Services ICS T0874 Hooking References Internet Engineering Task Force. (2007, August). Internet Security Glossary, Version 2. Retrieved September 29, 2023. "
},
{
"id": 93,
"title": "Control Server, Asset A0007",
"path": "/assets/A0007/index.html",
"content": " Control Server Control servers are typically a software platform that runs on a modern server operating system (e.g., MS Windows Server). The server typically uses one or more automation protocols (e.g., Modbus, DNP3) to communicate with the various low-level control devices such as Remote Terminal Units (RTUs) and Programmable Logic Controllers (PLCs). The control server also usually provides an interface/network service to connect with an HMI. ID: A0007 ⓘ Platforms: Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Supervisory Control And Data Acquisition (SCADA) Server Electric, General, Water and Wastewater A SCADA server is used to perform monitoring and control across a distributed environment. It typically has an associated HMI to provide information to a human operator and heavily depends on the human operator to initiate control actions. Master Terminal Unit (MTU) General A controller that also acts as a server that hosts the control software that communicates with lower-level control devices, such as remote terminal units (RTUs) and programmable logic controllers (PLCs), over an ICS network [1] Supervisory controller General A controller that also acts as a server that hosts the control software that communicates with lower-level control devices, such as remote terminal units (RTUs) and programmable logic controllers (PLCs), over an ICS network [1] Distribution/Energy Management System (DMS/EMS) Electric A DMS and EMS are electric sector specific devices that are commonly used to manage distribution and transmission-level electrical grids. These platforms typically integrate a SCADA server and HMI with domain-specific data analysis applications, such as state-estimation and contingency analysis (EMS), or voltage-var control or fault restoration (DMS). Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0802 Automated Collection ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0806 Brute Force I/O ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0811 Data from Information Repositories ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0867 Lateral Tool Transfer ICS T0849 Masquerading ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0853 Scripting ICS T0881 Service Stop ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0855 Unauthorized Command Message ICS T0859 Valid Accounts References Keith Stouffer. (2015, May). Guide to Industrial Control Systems (ICS) Security. Retrieved March 28, 2018. "
},
{
"id": 94,
"title": "Data Gateway, Asset A0009",
"path": "/assets/A0009/index.html",
"content": " Data Gateway Data Gateway is a device that supports the communication and exchange of data between different systems, networks, or protocols within the ICS. Different types of data gateways are used to perform various functions, including: Protocol Translation: Enable communication to devices that support different or incompatible protocols by translating information from one protocol to another. Media Converter: Convert data across different Layer 1 and 2 network protocols / mediums, for example, converting from Serial to Ethernet. Data Aggregation: Collect and combine data from different devices into one consistent format and protocol interface. Data gateways are often critical to the forwarding/transmission of critical control or monitoring data within the ICS. Further, these devices often have remote various network services that are used to communicate across different zones or networks. These assets may focus on a single function listed below or combinations of these functions to best fit the industry use-case. ID: A0009 ⓘ Platforms: Embedded, Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Data Acquisition Server (DAS) General A Data Acquisition Server (DAS) a system or software platform that is used to collect, aggregate, and store data/telemetry from field devices using various SCADA/Automation protocols. Serial to Ethernet Gateway Electric, General A Serial to Ethernet gateway is a device that is used to connect field devices that only support serial-based communication (e.g., RS-232) with more modern Ethernet-based networks. Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0822 External Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0849 Masquerading ICS T0838 Modify Alarm Settings ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0853 Scripting ICS T0881 Service Stop ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0859 Valid Accounts "
},
{
"id": 95,
"title": "Jump Host, Asset A0012",
"path": "/assets/A0012/index.html",
"content": " Jump Host Jump hosts are devices used to support remote management sessions into ICS networks or devices. The system is used to access the ICS environment securely from external networks, such as the corporate network. The user must first remote into the jump host before they can access ICS devices. The jump host may be a customized Windows server using common remote access protocols (e.g., RDP) or a dedicated access management device. The jump host typically performs various security functions to ensure the authenticity of remote sessions, including authentication, enforcing access controls/permissions, and auditing all access attempts. ID: A0012 ⓘ Platforms: Embedded, Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Intermediate System Electric A Cyber Asset or collection of Cyber Assets performing access control to restrict Interactive Remote Access to only authorized users.[1] Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0805 Block Serial COM ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0822 External Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0867 Lateral Tool Transfer ICS T0849 Masquerading ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0851 Rootkit ICS T0852 Screen Capture ICS T0853 Scripting ICS T0881 Service Stop ICS T0865 Spearphishing Attachment ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0863 User Execution ICS T0859 Valid Accounts References North American Electric Reliability Corporation 2021, June 28 Glossary of Terms Used in NERC Reliability Standards Retrieved. 2021/10/11 "
},
{
"id": 96,
"title": "Data Historian, Asset A0006",
"path": "/assets/A0006/index.html",
"content": " Data Historian Data historians, or historian, are systems used to collect and store data, including telemetry, events, alerts, and alarms about the operational process and supporting devices. The historian typically utilizes a database to store this data, and commonly provide tools and interfaces to support the analysis of the data. Data historians are often used to support various engineering or business analysis functions and therefore commonly needs access from the corporate network. Data historians often work in a hierarchical paradigm where lower/site level historians collect and store data which is then aggregated into a site/plant level historian. Therefore, data historians often have remote services that can be accessed externally from the ICS network. ID: A0006 ⓘ Platforms: Embedded, Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0802 Automated Collection ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0811 Data from Information Repositories ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0822 External Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0849 Masquerading ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0853 Scripting ICS T0881 Service Stop ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0859 Valid Accounts "
},
{
"id": 97,
"title": "Application Server, Asset A0008",
"path": "/assets/A0008/index.html",
"content": " Application Server Application servers are used across many different sectors to host various diverse software applications necessary to supporting the ICS. Example functions can include data analytics and reporting, alarm management, and the management/coordination of different control servers. The application server typically runs on a modern server operating system (e.g., MS Windows Server). ID: A0008 ⓘ Platforms: Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0816 Device Restart/Shutdown ICS T0819 Exploit Public-Facing Application ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0822 External Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0883 Internet Accessible Device ICS T0867 Lateral Tool Transfer ICS T0849 Masquerading ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0851 Rootkit ICS T0853 Scripting ICS T0881 Service Stop ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0859 Valid Accounts "
},
{
"id": 98,
"title": "Human-Machine Interface (HMI), Asset A0002",
"path": "/assets/A0002/index.html",
"content": " Human-Machine Interface (HMI) Human-Machine Interfaces (HMIs) are systems used by an operator to monitor the real-time status of an operational process and to perform necessary control functions, including the adjustment of device parameters. An HMI can take various forms, including a dedicated screen or control panel integrated with a specific device/controller, or a customizable software GUI application running on a standard operating system (e.g., MS Windows) that interfaces with a control/SCADA server. The HMI is critical to ensuring operators have sufficient visibility and control over the operational process. ID: A0002 ⓘ Platforms: Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Operator Workstation (OWS) General An Operator Workstation (OWS) or Console is a system or device used by an operator to interface with a control system, including to access/visualizes key information or parameters about the operational process and initiate control actions. This typically consists of specialized OWS software installed on a Workstation platform. [1] Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0806 Brute Force I/O ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0849 Masquerading ICS T0838 Modify Alarm Settings ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0852 Screen Capture ICS T0853 Scripting ICS T0881 Service Stop ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0855 Unauthorized Command Message ICS T0863 User Execution ICS T0859 Valid Accounts References IEC 2019, February Security for industrial automation and control systems - Part 4-2: Technical security requirements for IACS components Retrieved. 2020/09/25 "
},
{
"id": 99,
"title": "Programmable Logic Controller (PLC), Asset A0003",
"path": "/assets/A0003/index.html",
"content": " Programmable Logic Controller (PLC) A Programmable Logic Controller (PLC) is an embedded programmable control device. PLCs typically utilize a modular architecture with separate modules used to support its processing capabilities, communication mediums, and I/O interfaces. PLCs allow for the deployment of customized programs/logic to control or monitor an operational process. This logic is defined using industry specific programming languages, such as IEC 61131 [1], which define the set of tasks and program organizational units (POUs) included in the device’s programs. PLCs also typically have distinct operating modes (e.g., Remote, Run, Program, Stop) which are used to determine when the device can be programmed or whether it should execute the custom logic. ID: A0003 ⓘ Platforms: Embedded Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Process Automation Controller (PAC) General Process Automation Controllers (PAC) share much of the same functionality as a PLC. PACs may include advanced features for process control, motion control, drive control, and vision applications. PACs may include additional features such as options to program in traditional programming languages such as C and C++ in addition to 61131 programming languages in order to support these more advanced controls. Field Device / Controller Programmable Logic Controller (PLC) may be referred to as Field Controllers or Field Devices as a general function name. Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0802 Automated Collection ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0806 Brute Force I/O ICS T0858 Change Operating Mode ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0868 Detect Operating Mode ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0874 Hooking ICS T0877 I/O Image ICS T0872 Indicator Removal on Host ICS T0835 Manipulate I/O Image ICS T0838 Modify Alarm Settings ICS T0821 Modify Controller Tasking ICS T0836 Modify Parameter ICS T0889 Modify Program ICS T0839 Module Firmware ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0843 Program Download ICS T0845 Program Upload ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0855 Unauthorized Command Message ICS T0859 Valid Accounts References IEC 2013, February 20 IEC 61131-3:2013 Programmable controllers - Part 3: Programming languages Retrieved. 2019/10/22 "
},
{
"id": 100,
"title": "Workstation, Asset A0001",
"path": "/assets/A0001/index.html",
"content": " Workstation Workstations are devices used by human operators or engineers to perform various configuration, programming, maintenance, diagnostic, or operational tasks. Workstations typically utilize standard desktop or laptop hardware and operating systems (e.g., MS Windows), but run dedicated control system applications or diagnostic/management software to support interfacing with the control servers or field devices. Some workstations have a fixed location within the network architecture, while others are transient devices that are directly connected to various field devices to support local management activities. ID: A0001 ⓘ Platforms: Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 28 September 2023 Version Permalink Live Version Related Assets Name Sectors Description Transient Cyber Asset (TCA) Electric A Transient Cyber Asset (TCA)[1] is a mobile workstation that is used to support management functions across multiple different networks, rather than being dedicated to any specific device/network. The TCA is often used to directly manage ICS environments that do not have any dedicated support for external remote access. Therefore, the TCA provides a mechanism for connectivity and file transfer to many networks/devices, even if they are segmented or \"air gapped\" from other networks. Engineering Workstation (EWS) General An Engineering Workstation (EWS) is used to perform various maintenance, configuration, or diagnostics functions for a control system. The EWS will likely require dedicated application software to interface with various devices (e.g., RTUs, PLCs), and may be used to transfer data or files between the control system devices and other networks. Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0805 Block Serial COM ICS T0807 Command-Line Interface ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0816 Device Restart/Shutdown ICS T0817 Drive-by Compromise ICS T0871 Execution through API ICS T0819 Exploit Public-Facing Application ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0823 Graphical User Interface ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0883 Internet Accessible Device ICS T0867 Lateral Tool Transfer ICS T0849 Masquerading ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0873 Project File Infection ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0851 Rootkit ICS T0852 Screen Capture ICS T0853 Scripting ICS T0881 Service Stop ICS T0865 Spearphishing Attachment ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0864 Transient Cyber Asset ICS T0863 User Execution ICS T0859 Valid Accounts ICS T0860 Wireless Compromise ICS T0887 Wireless Sniffing References North American Electric Reliability Corporation 2021, June 28 Glossary of Terms Used in NERC Reliability Standards Retrieved. 2021/10/11 "
},
{
"id": 101,
"title": "Virtual Private Network (VPN) Server, Asset A0011",
"path": "/assets/A0011/index.html",
"content": " Virtual Private Network (VPN) Server A VPN server is a device that is used to establish a secure network tunnel between itself and other remote VPN devices, including field VPNs. VPN servers can be used to establish a secure connection with a single remote device, or to securely bridge all traffic between two separate networks together by encapsulating all data between those networks. VPN servers typically support remote network services that are used by field VPNs to initiate the establishment of the secure VPN tunnel between the field device and server. ID: A0011 ⓘ Platforms: Embedded, Linux, Windows Sectors: General Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Virtual Private Network (VPN) terminator General A VPN terminator is a device performs the role of either a VPN client or server to support the establishment of VPN connection. [1] Field VPN General Field VPN are typically deployed at remote outstations and are used to create secure connections to VPN servers within data/control center environments. Techniques Domain ID Name ICS T0830 Adversary-in-the-Middle ICS T0805 Block Serial COM ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0816 Device Restart/Shutdown ICS T0819 Exploit Public-Facing Application ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0822 External Remote Services ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0883 Internet Accessible Device ICS T0867 Lateral Tool Transfer ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0886 Remote Services ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0851 Rootkit ICS T0881 Service Stop ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0859 Valid Accounts References IEC 2019, February Security for industrial automation and control systems - Part 4-2: Technical security requirements for IACS components Retrieved. 2020/09/25 "
},
{
"id": 102,
"title": "Remote Terminal Unit (RTU), Asset A0004",
"path": "/assets/A0004/index.html",
"content": " Remote Terminal Unit (RTU) A Remote Terminal Unit (RTU) is a device that typically resides between field devices (e.g., PLCs, IEDs) and control/SCADA servers and supports various communication interfacing and data aggregation functions. RTUs are typically responsible for forwarding commands from the control server and the collection of telemetry, events, and alerts from the field devices. An RTU can be implemented as a dedicated embedded device, as software platform that runs on a hardened/ruggedized computer, or using a custom application program on a PLC. ID: A0004 ⓘ Platforms: Embedded, Linux, Windows Sectors: Electric, General, Water and Wastewater Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0806 Brute Force I/O ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0866 Exploitation of Remote Services ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0838 Modify Alarm Settings ICS T0836 Modify Parameter ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0881 Service Stop ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0855 Unauthorized Command Message ICS T0859 Valid Accounts "
},
{
"id": 103,
"title": "Field I/O, Asset A0013",
"path": "/assets/A0013/index.html",
"content": " Field I/O Field I/O are devices that communicate with a controller or data aggregator to either send input data or receive output data. Input data may include readings about a given environment/device state from sensors, while output data may include data sent back to actuators for them to either undertake actions or change parameter values.[1] These devices are frequently embedded devices running on lightweight embedded operating systems or RTOSes. ID: A0013 ⓘ Platforms: Embedded Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Smart Sensors General A device that procures a voltage or current output that is representative of some physical property being measured (e.g., speed, temperature, flow). [1] Smart sensors take this functionality and add on on-device processing and network communication. Variable Frequency Drive (VFD) General A type of drive that controls the speed, but not the precise position, of a non-servo, AC motor by varying the frequency of the electricity going to that motor. VFDs are typically used for applications where speed and power are important, but precise positioning is not. [1] VFDs can be network connected. Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0891 Hardcoded Credentials ICS T0867 Lateral Tool Transfer ICS T0801 Monitor Process State ICS T0834 Native API ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0851 Rootkit ICS T0862 Supply Chain Compromise ICS T0859 Valid Accounts ICS T0860 Wireless Compromise ICS T0887 Wireless Sniffing References Keith Stouffer. (2015, May). Guide to Industrial Control Systems (ICS) Security. Retrieved March 28, 2018. "
},
{
"id": 104,
"title": "Intelligent Electronic Device (IED), Asset A0005",
"path": "/assets/A0005/index.html",
"content": " Intelligent Electronic Device (IED) An Intelligent Electronic Device (IED) is a type of specialized field device that is designed to perform specific operational functions, frequently for protection, monitoring, or control within the electric sector. IEDs are typically used to both acquire telemetry and execute tailored control algorithms/actions based on customizable parameters/settings. An IED is usually implemented as a dedicated embedded device and supports various network automation protocols to communicate with RTUs and Control Servers. ID: A0005 ⓘ Platforms: Embedded Sectors: Electric Version: 1.0 Created: 28 September 2023 Last Modified: 04 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Protection Relay Electric A protection relay is a type of IED used within the electric sector to monitor for faults or problematic operating conditions on power lines, busses, or transformers. While traditionally protection relays were electromechanical or electromagnetic devices, modern relays utilize microprocessors, embedded operating system, and SCADA communications. Field Device / Controller IEDs may be referred to as Field Controllers or Field Devices as a general function name. Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0806 Brute Force I/O ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0874 Hooking ICS T0872 Indicator Removal on Host ICS T0838 Modify Alarm Settings ICS T0836 Modify Parameter ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0881 Service Stop ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0855 Unauthorized Command Message ICS T0859 Valid Accounts "
},
{
"id": 105,
"title": "Safety Controller, Asset A0010",
"path": "/assets/A0010/index.html",
"content": " Safety Controller Safety controllers are typically a type of field device used to perform the safety critical function. Safety controllers often support the deployment of custom programs/logic, similar to a PLC, but can also be tailored for sector specific functions/applications. The safety controllers typically utilize redundant hardware and processors to ensure they operate reliably if a component fails. ID: A0010 ⓘ Platforms: Embedded Version: 1.0 Created: 28 September 2023 Last Modified: 16 October 2023 Version Permalink Live Version Related Assets Name Sectors Description Safety Instrumented System (SIS) controller SIS controllers are used to \"take the process to a safe state when predetermined conditions are violated\" [1] through the reading of sensor data and interaction with digital/physical control surfaces. These devices are oftentimes located on programmable embedded devices running specialized RTOS or other embedded operating systems. Emergency Shutdown Systems (ESD) controller Emergency Shutdown System controllers are used to read sensor values and interact with control surfaces to return the system \"to a safe static condition so that any remedial action can be taken\". [2] Burner Management Systems (BMS) controller Burner Management System controllers are used to interact with sensors and control surfaces to maintain safe operating conditions for the burner. These can include safely starting-up and managing the main flame, controlling and monitoring the burning conditions, and safely initiating planned or unplanned shutdown sequences. Techniques Domain ID Name ICS T0800 Activate Firmware Update Mode ICS T0830 Adversary-in-the-Middle ICS T0878 Alarm Suppression ICS T0803 Block Command Message ICS T0804 Block Reporting Message ICS T0805 Block Serial COM ICS T0806 Brute Force I/O ICS T0858 Change Operating Mode ICS T0885 Commonly Used Port ICS T0884 Connection Proxy ICS T0809 Data Destruction ICS T0812 Default Credentials ICS T0814 Denial of Service ICS T0868 Detect Operating Mode ICS T0816 Device Restart/Shutdown ICS T0871 Execution through API ICS T0820 Exploitation for Evasion ICS T0890 Exploitation for Privilege Escalation ICS T0866 Exploitation of Remote Services ICS T0874 Hooking ICS T0877 I/O Image ICS T0872 Indicator Removal on Host ICS T0835 Manipulate I/O Image ICS T0838 Modify Alarm Settings ICS T0821 Modify Controller Tasking ICS T0889 Modify Program ICS T0839 Module Firmware ICS T0801 Monitor Process State ICS T0834 Native API ICS T0840 Network Connection Enumeration ICS T0842 Network Sniffing ICS T0861 Point & Tag Identification ICS T0843 Program Download ICS T0845 Program Upload ICS T0846 Remote System Discovery ICS T0888 Remote System Information Discovery ICS T0847 Replication Through Removable Media ICS T0848 Rogue Master ICS T0851 Rootkit ICS T0881 Service Stop ICS T0856 Spoof Reporting Message ICS T0869 Standard Application Layer Protocol ICS T0862 Supply Chain Compromise ICS T0857 System Firmware ICS T0855 Unauthorized Command Message ICS T0859 Valid Accounts References Keith Stouffer. (2015, May). Guide to Industrial Control Systems (ICS) Security. Retrieved March 28, 2018. Society of International Gas Tanker & Terminal Operators Ltd. (2021). ESD Systems: Recommendations for Emergency Shutdown and Related Safety Systems (Second Edition). Retrieved September 28, 2023. "
}
]