{"description": "Enterprise techniques used by Magic Hound, ATT&CK group G0059 v1.0", "name": "Magic Hound (G0059)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "Magic Hound has used the command-line interface."}, {"score": 1, "techniqueID": "T1043", "comment": "Magic Hound malware has communicated with C2 servers over port 6667 (for IRC) and port 8080."}, {"score": 1, "techniqueID": "T1003", "comment": "Magic Hound stole domain credentials from Microsoft Active Directory Domain Controller and leveraged Mimikatz."}, {"score": 1, "techniqueID": "T1002", "comment": "Magic Hound has used RAR to stage and compress local folders."}, {"score": 1, "techniqueID": "T1114", "comment": "Magic Hound has collected .PST archives."}, {"score": 1, "techniqueID": "T1083", "comment": "Magic Hound malware can list a victim's logical drives and the type, as well the total/free space of the fixed devices. Other malware can list a directory's contents."}, {"score": 1, "techniqueID": "T1107", "comment": "Magic Hound has deleted and overwrote files to cover tracks."}, {"score": 1, "techniqueID": "T1056", "comment": "Magic Hound malware is capable of keylogging."}, {"score": 1, "techniqueID": "T1027", "comment": "Magic Hound malware has used base64-encoded commands and files, and has also encrypted embedded strings with AES."}, {"score": 1, "techniqueID": "T1086", "comment": "Magic Hound has used PowerShell for execution and privilege escalation."}, {"score": 1, "techniqueID": "T1057", "comment": "Magic Hound malware can list running processes."}, {"score": 1, "techniqueID": "T1060", "comment": "Magic Hound malware has used Registry Run keys to establish persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "Magic Hound has downloaded additional code and files from servers onto victims."}, {"score": 1, "techniqueID": "T1113", "comment": "Magic Hound malware can take a screenshot and upload the file to its C2 server."}, {"score": 1, "techniqueID": "T1064", "comment": "Magic Hound malware has used .vbs scripts for execution."}, {"score": 1, "techniqueID": "T1193", "comment": "Magic Hound sent malicious attachments to victims over email, including an Excel spreadsheet containing macros to download Pupy."}, {"score": 1, "techniqueID": "T1192", "comment": "Magic Hound sent shortened URL links over email to victims. The URLs linked to Word documents with malicious macros that execute PowerShells scripts to download Pupy."}, {"score": 1, "techniqueID": "T1194", "comment": "Magic Hound used various social media channels to spearphish victims."}, {"score": 1, "techniqueID": "T1071", "comment": "Magic Hound malware has used HTTP and IRC for C2."}, {"score": 1, "techniqueID": "T1082", "comment": "Magic Hound malware has used a PowerShell command to check the victim system architecture to determine if it is an x64 machine. Other malware has obtained the OS version, UUID, and computer/host name to send to the C2 server."}, {"score": 1, "techniqueID": "T1016", "comment": "Magic Hound malware gathers the victim's local IP address, MAC address, and external IP address."}, {"score": 1, "techniqueID": "T1033", "comment": "Magic Hound malware has obtained the victim username and sent it to the C2 server."}, {"score": 1, "techniqueID": "T1065", "comment": "Magic Hound malware has communicated with its C2 server over ports 4443 and 3543."}, {"score": 1, "techniqueID": "T1204", "comment": "Magic Hound has attempted to get users to execute malware via social media and spearphishing emails."}, {"score": 1, "techniqueID": "T1102", "comment": "Magic Hound malware can use a SOAP Web service to communicate with its C2 server."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Magic Hound", "color": "#66b1ff"}]}