{"description": "Enterprise techniques used by BACKSPACE, ATT&CK software S0031 v1.0", "name": "BACKSPACE (S0031)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "Adversaries can direct BACKSPACE to execute from the command-line on infected hosts, or have BACKSPACE create a reverse shell."}, {"score": 1, "techniqueID": "T1090", "comment": "The \"ZJ\" variant of BACKSPACE allows \"ZJ link\" infections with Internet access to relay traffic from \"ZJ listen\" to a command server."}, {"score": 1, "techniqueID": "T1001", "comment": "Newer variants of BACKSPACE will encode C2 communications with a custom system."}, {"score": 1, "techniqueID": "T1089", "comment": "The \"ZR\" variant of BACKSPACE will check to see if known host-based firewalls are installed on the infected systems. BACKSPACE will attempt to establish a C2 channel, then will examine open windows to identify a pop-up from the firewall software and will simulate a mouse-click to allow the connection to proceed."}, {"score": 1, "techniqueID": "T1041", "comment": "Adversaries can direct BACKSPACE to upload files to the C2 Server."}, {"score": 1, "techniqueID": "T1083", "comment": "BACKSPACE allows adversaries to search for files."}, {"score": 1, "techniqueID": "T1112", "comment": "BACKSPACE is capable of deleting Registry keys, sub-keys, and values on a victim system."}, {"score": 1, "techniqueID": "T1104", "comment": "BACKSPACE attempts to avoid detection by checking a first stage command and control server to determine if it should connect to the second stage server, which performs \"louder\" interactions with the malware."}, {"score": 1, "techniqueID": "T1057", "comment": "BACKSPACE may collect information about running processes."}, {"score": 1, "techniqueID": "T1012", "comment": "BACKSPACE is capable of enumerating and making modifications to an infected system's Registry."}, {"score": 1, "techniqueID": "T1060", "comment": "BACKSPACE achieves persistence by creating a shortcut to itself in the CSIDL_STARTUP directory."}, {"score": 1, "techniqueID": "T1023", "comment": "BACKSPACE achieves persistence by creating a shortcut to itself in the CSIDL_STARTUP directory."}, {"score": 1, "techniqueID": "T1071", "comment": "BACKSPACE uses HTTP as a transport to communicate with its command server."}, {"score": 1, "techniqueID": "T1082", "comment": "During its initial execution, BACKSPACE extracts operating system information from the infected host."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by BACKSPACE", "color": "#66b1ff"}]}