{"description": "Enterprise techniques used by Dragonfly 2.0, ATT&CK group G0074 v1.1", "name": "Dragonfly 2.0 (G0074)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Dragonfly 2.0 used batch scripts to enumerate users in the victim environment."}, {"score": 1, "techniqueID": "T1098", "comment": "Dragonfly 2.0 added newly created accounts to the administrators group to maintain elevated access."}, {"score": 1, "techniqueID": "T1110", "comment": "Dragonfly 2.0 dropped and executed tools used for password cracking, including Hydra."}, {"score": 1, "techniqueID": "T1059", "comment": "Dragonfly 2.0 used command line for execution."}, {"score": 1, "techniqueID": "T1043", "comment": "Dragonfly 2.0 used SMB over ports 445 or 139 for C2. The group also established encrypted connections over port 443."}, {"score": 1, "techniqueID": "T1136", "comment": "Dragonfly 2.0 created accounts on victims, including administrator accounts, some of which appeared to be tailored to each individual staging target."}, {"score": 1, "techniqueID": "T1003", "comment": "Dragonfly 2.0 dropped and executed SecretsDump and CrackMapExec, tools that can dump password hashes."}, {"score": 1, "techniqueID": "T1002", "comment": "Dragonfly 2.0 compressed data into .zip files prior to exfiltrating it."}, {"score": 1, "techniqueID": "T1005", "comment": "Dragonfly 2.0 collected data from local victim systems."}, {"score": 1, "techniqueID": "T1074", "comment": "Dragonfly 2.0 created a directory named \"out\" in the user's %AppData% folder and copied files to it."}, {"score": 1, "techniqueID": "T1089", "comment": "Dragonfly 2.0 has disabled host-based firewalls. The group has also globally opened port 3389."}, {"score": 1, "techniqueID": "T1189", "comment": "Dragonfly 2.0 compromised legitimate organizations' websites to create watering holes to compromise victims."}, {"score": 1, "techniqueID": "T1114", "comment": "Dragonfly 2.0 accessed email accounts using Outlook Web Access."}, {"score": 1, "techniqueID": "T1133", "comment": "Dragonfly 2.0 used VPNs and Outlook Web Access (OWA) to maintain access to victim networks."}, {"score": 1, "techniqueID": "T1083", "comment": "Dragonfly 2.0 used a batch script to gather folder and file names from victim hosts."}, {"score": 1, "techniqueID": "T1107", "comment": "Dragonfly 2.0 deleted many of its files used during operations as part of cleanup, including removing applications and deleting screenshots."}, {"score": 1, "techniqueID": "T1187", "comment": "Dragonfly 2.0 has gathered hashed user credentials over SMB using spearphishing attachments with external resource links and by modifying .LNK file icon resources to collect credentials from virtualized systems."}, {"score": 1, "techniqueID": "T1070", "comment": "Dragonfly 2.0 cleared Windows event logs and other logs produced by tools they used, including system, security, terminal services, remote services, and audit logs. The actors also deleted specific Registry keys."}, {"score": 1, "techniqueID": "T1036", "comment": "Dragonfly 2.0 created accounts disguised as legitimate backup and service accounts as well as an email administration account."}, {"score": 1, "techniqueID": "T1112", "comment": "Dragonfly 2.0 modified the Registry to perform multiple techniques through the use of Reg."}, {"score": 1, "techniqueID": "T1135", "comment": "Dragonfly 2.0 identified and browsed file servers in the victim network, sometimes , viewing files pertaining to ICS or Supervisory Control and Data Acquisition (SCADA) systems."}, {"score": 1, "techniqueID": "T1069", "comment": "Dragonfly 2.0 used batch scripts to enumerate administrators in the environment."}, {"score": 1, "techniqueID": "T1086", "comment": "Dragonfly 2.0 used PowerShell scripts for execution."}, {"score": 1, "techniqueID": "T1012", "comment": "Dragonfly 2.0 queried the Registry to identify victim information."}, {"score": 1, "techniqueID": "T1060", "comment": "Dragonfly 2.0 added the registry value ntdll to the Registry Run key to establish persistence."}, {"score": 1, "techniqueID": "T1076", "comment": "Dragonfly 2.0 moved laterally via RDP."}, {"score": 1, "techniqueID": "T1105", "comment": "Dragonfly 2.0 copied and installed tools for operations once in the victim environment."}, {"score": 1, "techniqueID": "T1018", "comment": "Dragonfly 2.0 likely obtained a list of hosts in the victim environment."}, {"score": 1, "techniqueID": "T1053", "comment": "Dragonfly 2.0 used scheduled tasks to automatically log out of created accounts every 8 hours as well as to execute malicious files."}, {"score": 1, "techniqueID": "T1113", "comment": "Dragonfly 2.0 has performed screen captures of victims, including by using a tool, scr.exe (which matched the hash of ScreenUtil)."}, {"score": 1, "techniqueID": "T1064", "comment": "Dragonfly 2.0 used various types of scripting to perform operations, including Python and batch scripts. The group was observed installing Python 2.7 on a victim."}, {"score": 1, "techniqueID": "T1023", "comment": "Dragonfly 2.0 manipulated .lnk files to gather user credentials in conjunction with Forced Authentication."}, {"score": 1, "techniqueID": "T1193", "comment": "Dragonfly 2.0 used spearphishing with Microsoft Office attachments to target victims."}, {"score": 1, "techniqueID": "T1192", "comment": "Dragonfly 2.0 used spearphishing with PDF attachments containing malicious links that redirected to credential harvesting websites."}, {"score": 1, "techniqueID": "T1071", "comment": "Dragonfly 2.0 used SMB for C2."}, {"score": 1, "techniqueID": "T1016", "comment": "Dragonfly 2.0 used batch scripts to enumerate network information, including information about trusts, zones, and the domain."}, {"score": 1, "techniqueID": "T1033", "comment": "Dragonfly 2.0 used the command query user on victim hosts."}, {"score": 1, "techniqueID": "T1221", "comment": "Dragonfly 2.0 has injected SMB URLs into malicious Word spearphishing attachments to initiate Forced Authentication."}, {"score": 1, "techniqueID": "T1204", "comment": "Dragonfly 2.0 has used various forms of spearphishing in attempts to get users to open links or attachments."}, {"score": 1, "techniqueID": "T1078", "comment": "Dragonfly 2.0 compromised user credentials and used valid accounts for operations."}, {"score": 1, "techniqueID": "T1100", "comment": "Dragonfly 2.0 commonly created Web shells on victims' publicly accessible email and web servers, which they used to maintain access to a victim network and download additional malicious files."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Dragonfly 2.0", "color": "#66b1ff"}]}