{"description": "Enterprise techniques used by APT37, ATT&CK group G0067 v1.2", "name": "APT37 (G0067)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1123", "comment": "APT37 has used an audio capturing utility known as SOUNDWAVE that captures microphone input."}, {"score": 1, "techniqueID": "T1088", "comment": "APT37 has a function in the initial dropper to bypass Windows UAC in order to execute the next payload with higher privileges."}, {"score": 1, "techniqueID": "T1116", "comment": "APT37 has signed its malware with an invalid digital certificates listed as “Tencent Technology (Shenzhen) Company Limited.”"}, {"score": 1, "techniqueID": "T1059", "comment": "APT37 has used the command-line interface."}, {"score": 1, "techniqueID": "T1043", "comment": "APT37 has used port 8080 for C2."}, {"score": 1, "techniqueID": "T1003", "comment": "APT37 has used a credential stealer known as ZUMKONG that can harvest usernames and passwords stored in browsers."}, {"score": 1, "techniqueID": "T1094", "comment": "APT37 credential stealer ZUMKONG emails credentials from the victim using HTTP POST requests."}, {"score": 1, "techniqueID": "T1005", "comment": "APT37 has collected data from victims' local systems."}, {"score": 1, "techniqueID": "T1487", "comment": "APT37 has access to destructive malware that is capable of overwriting a machine's Master Boot Record (MBR)."}, {"score": 1, "techniqueID": "T1189", "comment": "APT37 has used strategic web compromises, particularly of South Korean websites, to distribute malware. The group has also used torrent file-sharing sites to more indiscriminately disseminate malware to victims. As part of their compromises, the group has used a Javascript based profiler called RICECURRY to profile a victim's web browser and deliver malicious code accordingly."}, {"score": 1, "techniqueID": "T1173", "comment": "APT37 has used Windows DDE for execution of commands and a malicious VBS."}, {"score": 1, "techniqueID": "T1106", "comment": "APT37 leverages the Windows API calls: VirtualAlloc(), WriteProcessMemory(), and CreateRemoteThread() for process injection."}, {"score": 1, "techniqueID": "T1203", "comment": "APT37 has used Flash Player (CVE-2016-4117, CVE-2018-4878) and Word (CVE-2017-0199) exploits for execution."}, {"score": 1, "techniqueID": "T1027", "comment": "APT37 sends images to users that are embedded with shellcode. The group also obfuscates strings and payloads, including through the use of steganography."}, {"score": 1, "techniqueID": "T1120", "comment": "APT37 has a Bluetooth device harvester, which uses Windows Bluetooth APIs to find information on connected Bluetooth devices."}, {"score": 1, "techniqueID": "T1057", "comment": "APT37's Freenki malware lists running processes using the Microsoft Windows API."}, {"score": 1, "techniqueID": "T1055", "comment": "APT37 injects its malware variant, ROKRAT, into the cmd.exe process."}, {"score": 1, "techniqueID": "T1060", "comment": "APT37's has added persistence via the Registry key HKCU\\Software\\Microsoft\\CurrentVersion\\Run\\."}, {"score": 1, "techniqueID": "T1105", "comment": "APT37 has downloaded second stage malware from compromised websites."}, {"score": 1, "techniqueID": "T1064", "comment": "APT37 executes shellcode and a script to decode Base64 strings."}, {"score": 1, "techniqueID": "T1193", "comment": "APT37 delivers malware using spearphishing emails with malicious HWP attachments."}, {"score": 1, "techniqueID": "T1071", "comment": "APT37 uses HTTPS to conceal C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "APT37 collects the computer name, the BIOS model, and execution path."}, {"score": 1, "techniqueID": "T1033", "comment": "APT37 identifies the victim username."}, {"score": 1, "techniqueID": "T1204", "comment": "APT37 has sent spearphishing attachments attempting to get a user to open them."}, {"score": 1, "techniqueID": "T1102", "comment": "APT37 leverages social networking sites and cloud platforms (AOL, Twitter, Yandex, Mediafire, pCloud, Dropbox, and Box) for C2."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by APT37", "color": "#66b1ff"}]}