{"description": "Enterprise techniques used by Zebrocy, ATT&CK software S0251 v2.0", "name": "Zebrocy (S0251)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "Zebrocy scans the system and automatically collects files with the following extensions: .doc, .docx, ,.xls, .xlsx, .pdf, .pptx, .rar, .zip, .jpg, .jpeg, .bmp, .tiff, .kum, .tlg, .sbx, .cr, .hse, .hsf, and .lhz."}, {"score": 1, "techniqueID": "T1059", "comment": "Zebrocy uses cmd.exe to execute commands on the system."}, {"score": 1, "techniqueID": "T1094", "comment": "Zebrocy uses raw sockets to communicate with its C2 server."}, {"score": 1, "techniqueID": "T1132", "comment": "Zebrocy has used URL/Percent Encoding on data exfiltrated via HTTP POST requests."}, {"score": 1, "techniqueID": "T1022", "comment": "Zebrocy uses an encryption method similar to RC4 as well as AES to encrypt data before exfiltration."}, {"score": 1, "techniqueID": "T1074", "comment": "Zebrocy stores all collected information in a single file before exfiltration."}, {"score": 1, "techniqueID": "T1140", "comment": "Zebrocy decodes its secondary payload and writes it to the victim’s machine. Zebrocy also uses AES and XOR to decrypt strings and payloads."}, {"score": 1, "techniqueID": "T1041", "comment": "Zebrocy has exfiltrated data to the designated C2 server using HTTP POST requests."}, {"score": 1, "techniqueID": "T1083", "comment": "Zebrocy searches for files that are 60mb and less and contain the following extensions: .doc, .docx, .xls, .xlsx, .ppt, .pptx, .exe, .zip, and .rar. Zebrocy also runs the echo %APPDATA% command to list the contents of the directory. Zebrocy can obtain the current execution path as well as perform drive enumeration."}, {"score": 1, "techniqueID": "T1107", "comment": "Zebrocy has a command to delete files and directories."}, {"score": 1, "techniqueID": "T1179", "comment": "Zebrocy installs an application-defined Windows hook to get notified when a network drive has been attached, so it can then use the hook to call its RecordToFile file stealing method."}, {"score": 1, "techniqueID": "T1037", "comment": "Zebrocy performs persistence via adding a Registry key with a logon script."}, {"score": 1, "techniqueID": "T1135", "comment": "Zebrocy identifies network drives when they are added to victim systems."}, {"score": 1, "techniqueID": "T1120", "comment": "Zebrocy enumerates information about connected storage devices."}, {"score": 1, "techniqueID": "T1057", "comment": "Zebrocy uses the tasklist and wmic process get Capture, ExecutablePath commands to gather the processes running on the system."}, {"score": 1, "techniqueID": "T1012", "comment": "Zebrocy executes the reg query command to obtain information in the Registry."}, {"score": 1, "techniqueID": "T1060", "comment": "Zebrocy creates an entry in a Registry Run key for the malware to execute on startup."}, {"score": 1, "techniqueID": "T1105", "comment": "Zebrocy obtains additional code to execute on the victim's machine, including the downloading of a secondary payload."}, {"score": 1, "techniqueID": "T1113", "comment": "A variant of Zebrocy captures screenshots of the victim’s machine in JPEG and BMP format."}, {"score": 1, "techniqueID": "T1045", "comment": "Zebrocy's Delphi variant was packed with UPX."}, {"score": 1, "techniqueID": "T1071", "comment": "Zebrocy uses HTTP, SMTP, and POP3 for C2."}, {"score": 1, "techniqueID": "T1032", "comment": "Zebrocy uses SSL and AES ECB for encrypting C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "Zebrocy collects the OS version, computer name and serial number for the storage volume C:. Zebrocy also runs the systeminfo command to gather system information."}, {"score": 1, "techniqueID": "T1016", "comment": "Zebrocy runs the ipconfig /all command."}, {"score": 1, "techniqueID": "T1049", "comment": "Zebrocy uses netstat -aon to gather network connection information."}, {"score": 1, "techniqueID": "T1033", "comment": "Zebrocy gets the username from the system."}, {"score": 1, "techniqueID": "T1124", "comment": "Zebrocy gathers the current time zone and date information from the system."}, {"score": 1, "techniqueID": "T1065", "comment": "Zebrocy uses port 465 for C2."}, {"score": 1, "techniqueID": "T1047", "comment": "One variant of Zebrocy uses WMI queries to gather information."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Zebrocy", "color": "#66b1ff"}]}