{"description": "Enterprise techniques used by Epic, ATT&CK software S0091 v1.2", "name": "Epic (S0091)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Epic gathers a list of all user accounts, privilege classes, and time of last logon."}, {"score": 1, "techniqueID": "T1116", "comment": "Turla has used valid digital certificates from Sysprint AG to sign its Epic dropper."}, {"score": 1, "techniqueID": "T1002", "comment": "Epic compresses the collected data with bzip2 before sending it to the C2 server."}, {"score": 1, "techniqueID": "T1022", "comment": "Epic encrypts collected data using a public key framework before sending it over the C2 channel. Some variants encrypt the collected data with AES and encode it with base64 before transmitting it to the C2 server."}, {"score": 1, "techniqueID": "T1181", "comment": "Epic has overwritten the function pointer in the extra window memory of Explorer's Shell_TrayWnd in order to execute malicious code in the context of the explorer.exe process."}, {"score": 1, "techniqueID": "T1083", "comment": "Epic recursively searches for all .doc files on the system and collects a directory listing of the Desktop, %TEMP%, and %WINDOWS%\\Temp directories."}, {"score": 1, "techniqueID": "T1107", "comment": "Epic has a command to delete a file from the machine."}, {"score": 1, "techniqueID": "T1027", "comment": "Epic heavily obfuscates its code to make analysis more difficult."}, {"score": 1, "techniqueID": "T1069", "comment": "Epic gathers information on local group names."}, {"score": 1, "techniqueID": "T1057", "comment": "Epic uses the tasklist /v command to obtain a list of processes."}, {"score": 1, "techniqueID": "T1012", "comment": "Epic uses the rem reg query command to obtain values from Registry keys."}, {"score": 1, "techniqueID": "T1018", "comment": "Epic uses the net view command on the victim’s machine."}, {"score": 1, "techniqueID": "T1063", "comment": "Epic searches for anti-malware services running on the victim’s machine and terminates itself if it finds them."}, {"score": 1, "techniqueID": "T1071", "comment": "Epic uses HTTP and HTTPS for C2 communications."}, {"score": 1, "techniqueID": "T1032", "comment": "Epic encrypts commands from the C2 server using a hardcoded key."}, {"score": 1, "techniqueID": "T1082", "comment": "Epic collects the OS version, hardware information, computer name, available system memory status, disk space information, and system and user language settings."}, {"score": 1, "techniqueID": "T1016", "comment": "Epic uses the nbtstat -n and nbtstat -s commands on the victim’s machine."}, {"score": 1, "techniqueID": "T1049", "comment": "Epic uses the net use, net session, and netstat commands to gather information on network connections."}, {"score": 1, "techniqueID": "T1033", "comment": "Epic collects the user name from the victim’s machine."}, {"score": 1, "techniqueID": "T1007", "comment": "Epic uses the tasklist /svc command to list the services on the system."}, {"score": 1, "techniqueID": "T1124", "comment": "Epic uses the net time command  to get the system time from the machine and collect the current date and time zone information."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Epic", "color": "#66b1ff"}]}