{"description": "Mobile techniques used by Stealth Mango, ATT&CK software S0328 v1.1", "name": "Stealth Mango (S0328)", "domain": "mitre-mobile", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1435", "comment": "Stealth Mango uploads calendar events and reminders."}, {"score": 1, "techniqueID": "T1433", "comment": "Stealth Mango uploads call logs."}, {"score": 1, "techniqueID": "T1432", "comment": "Stealth Mango uploads contact lists for various third-party applications such as Yahoo, AIM, GoogleTalk, Skype, QQ, and others."}, {"score": 1, "techniqueID": "T1409", "comment": "Stealth Mango exfiltrated data, including sensitive letters/documents, stored photos, and stored audio files."}, {"score": 1, "techniqueID": "T1438", "comment": "Stealth Mango uses commands received from text messages for C2."}, {"score": 1, "techniqueID": "T1418", "comment": "Stealth Mango uploads information about installed packages."}, {"score": 1, "techniqueID": "T1412", "comment": "Stealth Mango uploads SMS logs and deletes incoming messages from specified numbers, including those that contain particular strings."}, {"score": 1, "techniqueID": "T1456", "comment": "Stealth Mango is delivered via a a watering hole website that mimics the third-party Android app store APKMonk. In at least one case, the watering hole URL was distributed through Facebook Messenger."}, {"score": 1, "techniqueID": "T1430", "comment": "Stealth Mango can perform GPS location tracking as well as capturing coordinates as when an SMS message or call is received."}, {"score": 1, "techniqueID": "T1429", "comment": "Stealth Mango can record from the camera or microphone as well as take photos from the front and back cameras."}, {"score": 1, "techniqueID": "T1474", "comment": "Stealth Mango in at least one case may have been installed using physical access to the device by a repair shop."}, {"score": 1, "techniqueID": "T1422", "comment": "Stealth Mango uploads information about changes in SIM card or phone numbers on the device."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Stealth Mango", "color": "#66b1ff"}]}