{"description": "Enterprise techniques used by BlackEnergy, ATT&CK software S0089 v1.1", "name": "BlackEnergy (S0089)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1088", "comment": "BlackEnergy attempts to bypass default User Access Control (UAC) settings by exploiting a backward-compatibility setting found in Windows 7 and later."}, {"score": 1, "techniqueID": "T1081", "comment": "BlackEnergy has used a plug-in to gather credentials stored in files on the host by various software programs, including The Bat! email client, Outlook, and Windows Credential Store."}, {"score": 1, "techniqueID": "T1485", "comment": "BlackEnergy 2 contains a \"Destroy\" plug-in that destroys data stored on victim hard drives by overwriting file contents."}, {"score": 1, "techniqueID": "T1008", "comment": "BlackEnergy has the capability to communicate over a backup channel via plus.google.com."}, {"score": 1, "techniqueID": "T1083", "comment": "BlackEnergy gathers a list of installed apps from the uninstall program Registry. It also gathers registered mail, browser, and instant messaging clients from the Registry. BlackEnergy has searched for given file types."}, {"score": 1, "techniqueID": "T1044", "comment": "One variant of BlackEnergy locates existing driver services that have been disabled and drops its driver component into one of those service's paths, replacing the legitimate executable. The malware then sets the hijacked service to start automatically to establish persistence."}, {"score": 1, "techniqueID": "T1070", "comment": "The BlackEnergy component KillDisk is capable of deleting Windows Event Logs."}, {"score": 1, "techniqueID": "T1056", "comment": "BlackEnergy has run a keylogger plug-in on a victim."}, {"score": 1, "techniqueID": "T1046", "comment": "BlackEnergy has conducted port scans on a host."}, {"score": 1, "techniqueID": "T1050", "comment": "One variant of BlackEnergy creates a new service using either a hard-coded or randomly generated name."}, {"score": 1, "techniqueID": "T1120", "comment": "BlackEnergy can gather very specific information about attached USB devices, to include device instance ID and drive geometry."}, {"score": 1, "techniqueID": "T1057", "comment": "BlackEnergy has gathered a process list by using Tasklist.exe."}, {"score": 1, "techniqueID": "T1055", "comment": "BlackEnergy injects its DLL component into svchost.exe."}, {"score": 1, "techniqueID": "T1060", "comment": "The BlackEnergy 3 variant drops its main DLL component and then creates a .lnk shortcut to that file in the startup folder."}, {"score": 1, "techniqueID": "T1113", "comment": "BlackEnergy is capable of taking screenshots."}, {"score": 1, "techniqueID": "T1023", "comment": "The BlackEnergy 3 variant drops its main DLL component and then creates a .lnk shortcut to that file in the startup folder."}, {"score": 1, "techniqueID": "T1071", "comment": "BlackEnergy communicates with its C2 server over HTTP."}, {"score": 1, "techniqueID": "T1082", "comment": "BlackEnergy has used Systeminfo to gather the OS version, as well as information on the system configuration, BIOS, the motherboard, and the processor."}, {"score": 1, "techniqueID": "T1016", "comment": "BlackEnergy has gathered information about network IP configurations using ipconfig.exe and about routing tables using route.exe."}, {"score": 1, "techniqueID": "T1049", "comment": "BlackEnergy has gathered information about local network connections using netstat."}, {"score": 1, "techniqueID": "T1077", "comment": "BlackEnergy has run a plug-in on a victim to spread through the local network by using PsExec and accessing admin shares."}, {"score": 1, "techniqueID": "T1047", "comment": "A BlackEnergy 2 plug-in uses WMI to gather victim host details."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by BlackEnergy", "color": "#66b1ff"}]}