{"description": "Enterprise techniques used by Night Dragon, ATT&CK group G0014 v1.1", "name": "Night Dragon (G0014)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1043", "comment": "Night Dragon has used ports 25 and 80 for C2 communications."}, {"score": 1, "techniqueID": "T1003", "comment": "Night Dragon has dumped account hashes with Carbanak and cracked them with Cain &amp; Abel."}, {"score": 1, "techniqueID": "T1074", "comment": "Night Dragon has copied files to company web servers and subsequently downloaded them."}, {"score": 1, "techniqueID": "T1089", "comment": "Night Dragon has disabled anti-virus and anti-spyware tools in some instances on the victim’s machines. The actors have also disabled proxy settings to allow direct communication from victims to the Internet.["}, {"score": 1, "techniqueID": "T1190", "comment": "Night Dragon has performed SQL injection attacks of extranet web servers to gain access."}, {"score": 1, "techniqueID": "T1133", "comment": "Night Dragon has used compromised VPN accounts to gain access to victim systems."}, {"score": 1, "techniqueID": "T1027", "comment": "A Night Dragon DLL included an XOR-encoded section."}, {"score": 1, "techniqueID": "T1075", "comment": "Night Dragon used pass-the-hash tools to gain usernames and passwords."}, {"score": 1, "techniqueID": "T1219", "comment": "Night Dragon has used several remote administration tools as persistent infiltration channels."}, {"score": 1, "techniqueID": "T1045", "comment": "Night Dragon is known to use software packing in its tools."}, {"score": 1, "techniqueID": "T1192", "comment": "Night Dragon sent spearphishing emails containing links to compromised websites where malware was downloaded."}, {"score": 1, "techniqueID": "T1071", "comment": "Night Dragon has used HTTP for C2."}, {"score": 1, "techniqueID": "T1204", "comment": "Night Dragon enticed users to click on links in spearphishing emails to download malware."}, {"score": 1, "techniqueID": "T1078", "comment": "Night Dragon has used compromised VPN accounts to gain access to victim systems."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Night Dragon", "color": "#66b1ff"}]}