{"description": "Mobile techniques used by Pegasus for Android, ATT&CK software S0316 v1.1", "name": "Pegasus for Android (S0316)", "domain": "mitre-mobile", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1435", "comment": "Pegasus for Android accesses calendar entries."}, {"score": 1, "techniqueID": "T1433", "comment": "Pegasus for Android accesses call logs."}, {"score": 1, "techniqueID": "T1432", "comment": "Pegasus for Android accesses contact list information."}, {"score": 1, "techniqueID": "T1409", "comment": "Pegasus for Android accesses sensitive data in files, such as messages stored by the WhatsApp, Facebook, and Twitter applications. It also has the ability to access arbitrary filenames and retrieve directory listings."}, {"score": 1, "techniqueID": "T1438", "comment": "Pegasus for Android uses SMS for command and control."}, {"score": 1, "techniqueID": "T1402", "comment": "Pegasus for Android listens for the BOOT_COMPLETED broadcast intent in order to maintain persistence and activate its functionality at device boot time."}, {"score": 1, "techniqueID": "T1418", "comment": "Pegasus for Android accesses the list of installed applications."}, {"score": 1, "techniqueID": "T1475", "comment": "Pegasus for Android attempts to detect whether it is running in an emulator rather than a real device."}, {"score": 1, "techniqueID": "T1404", "comment": "Pegasus for Android attempts to exploit well-known Android OS vulnerabilities to escalate privileges."}, {"score": 1, "techniqueID": "T1429", "comment": "Pegasus for Android has the ability to record audio and take pictures using the device camera."}, {"score": 1, "techniqueID": "T1400", "comment": "Pegasus for Android attempts to modify the device's system partition."}, {"score": 1, "techniqueID": "T1422", "comment": "Pegasus for Android checks if the device is on Wi-Fi, a cellular network, and is roaming."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Pegasus for Android", "color": "#66b1ff"}]}