{"description": "Enterprise techniques used by InvisiMole, ATT&CK software S0260 v1.0", "name": "InvisiMole (S0260)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "InvisiMole has a command to list account information on the victim’s machine."}, {"score": 1, "techniqueID": "T1123", "comment": "InvisiMole can record sound using input audio devices."}, {"score": 1, "techniqueID": "T1119", "comment": "Each time a new drive is inserted, InvisiMole generates a list of all files on the drive and stores it in an encrypted file."}, {"score": 1, "techniqueID": "T1088", "comment": "InvisiMole can bypass UAC and create an elevated COM object to escalate privileges."}, {"score": 1, "techniqueID": "T1059", "comment": "InvisiMole can launch a remote shell to execute commands."}, {"score": 1, "techniqueID": "T1043", "comment": "InvisiMole uses port 80 for C2."}, {"score": 1, "techniqueID": "T1090", "comment": "InvisiMole can function as a proxy to create a serve that relays communication between the client and C&amp;C server."}, {"score": 1, "techniqueID": "T1094", "comment": "InvisiMole communicates with its C2 servers through a TCP socket."}, {"score": 1, "techniqueID": "T1024", "comment": "InvisiMole uses variations of a simple XOR encryption routine for C&amp;C communications."}, {"score": 1, "techniqueID": "T1002", "comment": "InvisiMole uses WinRAR to compress data that is intended to be exfiltrated."}, {"score": 1, "techniqueID": "T1022", "comment": "InvisiMole uses a variation of the XOR cipher to encrypt files before exfiltration."}, {"score": 1, "techniqueID": "T1074", "comment": "InvisiMole determines a working directory where it stores all the gathered data about the compromised machine."}, {"score": 1, "techniqueID": "T1140", "comment": "InvisiMole can decrypt, unpack and load a DLL from its resources."}, {"score": 1, "techniqueID": "T1089", "comment": "InvisiMole has a command to disable routing and the Firewall on the victim’s machine."}, {"score": 1, "techniqueID": "T1038", "comment": "InvisiMole can be launched by using DLL search order hijacking in which the wrapper DLL is placed in the same folder as explorer.exe and loaded during startup into the Windows Explorer process instead of the legitimate library."}, {"score": 1, "techniqueID": "T1083", "comment": "InvisiMole can lists information about files in a directory."}, {"score": 1, "techniqueID": "T1107", "comment": "InvisiMole has a command to delete a file and deletes files after they have been successfully uploaded to C2 servers."}, {"score": 1, "techniqueID": "T1036", "comment": "InvisiMole saves one of its files as mpr.dll in the Windows folder, masquerading as a legitimate library file."}, {"score": 1, "techniqueID": "T1112", "comment": "InvisiMole has a command to create, set, copy, or delete a specified Registry key or value."}, {"score": 1, "techniqueID": "T1135", "comment": "InvisiMole can gather network share information."}, {"score": 1, "techniqueID": "T1027", "comment": "InvisiMole avoids analysis by encrypting all strings, internal files, configuration data."}, {"score": 1, "techniqueID": "T1057", "comment": "InvisiMole obtains a list of running processes."}, {"score": 1, "techniqueID": "T1012", "comment": "InvisiMole can enumerate Registry values, keys, and data."}, {"score": 1, "techniqueID": "T1105", "comment": "InvisiMole can upload files to the victim's machine for operations."}, {"score": 1, "techniqueID": "T1113", "comment": "InvisiMole can capture screenshots of not only the entire screen, but of each separate window open, in case they are overlapping."}, {"score": 1, "techniqueID": "T1071", "comment": "InvisiMole uses HTTP for C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "InvisiMole can gather information on the mapped drives, OS version, computer name, and memory size."}, {"score": 1, "techniqueID": "T1016", "comment": "InvisiMole gathers informatin on the IP forwarding table, MAC address, and network SSID."}, {"score": 1, "techniqueID": "T1033", "comment": "InvisiMole lists local users and session information."}, {"score": 1, "techniqueID": "T1007", "comment": "InvisiMole can obtain running services on the victim."}, {"score": 1, "techniqueID": "T1124", "comment": "InvisiMole gathers the local system time from the victim’s machine."}, {"score": 1, "techniqueID": "T1099", "comment": "InvisiMole samples were timestomped by the authors by setting the PE timestamps to all zero values. InvisiMole also has a built-in command to modify file times."}, {"score": 1, "techniqueID": "T1125", "comment": "InvisiMole can remotely activate the victim’s webcam to capture content."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by InvisiMole", "color": "#66b1ff"}]}