{"description": "Enterprise techniques used by NETEAGLE, ATT&CK software S0034 v1.0", "name": "NETEAGLE (S0034)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "NETEAGLE allows adversaries to execute shell commands on the infected host."}, {"score": 1, "techniqueID": "T1094", "comment": "If NETEAGLE does not detect a proxy configured on the infected machine, it will send beacons via UDP/6000. Also, after retrieving a C2 IP address and Port Number, NETEAGLE will initiate a TCP connection to this socket. The ensuing connection is a plaintext C2 channel in which commands are specified by DWORDs."}, {"score": 1, "techniqueID": "T1041", "comment": "NETEAGLE is capable of reading files over the C2 channel."}, {"score": 1, "techniqueID": "T1008", "comment": "NETEAGLE will attempt to detect if the infected host is configured to a proxy. If so, NETEAGLE will send beacons via an HTTP POST request; otherwise it will send beacons via UDP/6000."}, {"score": 1, "techniqueID": "T1083", "comment": "NETEAGLE allows adversaries to enumerate and modify the infected host's file system. It supports searching for directories, creating directories, listing directory contents, reading and writing to files, retrieving file attributes, and retrieving volume information."}, {"score": 1, "techniqueID": "T1057", "comment": "NETEAGLE can send process listings over the C2 channel."}, {"score": 1, "techniqueID": "T1060", "comment": "The \"SCOUT\" variant of NETEAGLE achieves persistence by adding itself to the HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run Registry key."}, {"score": 1, "techniqueID": "T1071", "comment": "NETEAGLE will attempt to detect if the infected host is configured to a proxy. If so, NETEAGLE will send beacons via an HTTP POST request; otherwise it will send beacons via UDP/6000. NETEAGLE will also use HTTP to download resources that contain an IP address and Port Number pair to connect to for further C2. Adversaries can also use NETEAGLE to establish an RDP connection with a controller over TCP/7519."}, {"score": 1, "techniqueID": "T1032", "comment": "NETEAGLE will decrypt resources it downloads with HTTP requests by using RC4 with the key \"ScoutEagle.\""}, {"score": 1, "techniqueID": "T1095", "comment": "If NETEAGLE does not detect a proxy configured on the infected machine, it will send beacons via UDP/6000. Also, after retrieving a C2 IP address and Port Number, NETEAGLE will initiate a TCP connection to this socket. The ensuing connection is a plaintext C2 channel in which commands are specified by DWORDs."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by NETEAGLE", "color": "#66b1ff"}]}