{"description": "Enterprise techniques used by PoshC2, ATT&CK software S0378 v1.0", "name": "PoshC2 (S0378)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "PoshC2 contains a number of modules, such as Invoke-RunAs and Invoke-TokenManipulation, for manipulating tokens."}, {"score": 1, "techniqueID": "T1087", "comment": "PoshC2 can enumerate local and domain user account information."}, {"score": 1, "techniqueID": "T1119", "comment": "PoshC2 contains a module for recursively parsing through files and directories to gather valid credit card numbers."}, {"score": 1, "techniqueID": "T1110", "comment": "PoshC2 has modules for brute forcing local administrator and AD user accounts."}, {"score": 1, "techniqueID": "T1088", "comment": "PoshC2 can utilize multiple methods to bypass UAC."}, {"score": 1, "techniqueID": "T1090", "comment": "PoshC2 contains modules that allow for use of proxies in command and control."}, {"score": 1, "techniqueID": "T1003", "comment": "PoshC2 contains an implementation of Mimikatz to gather credentials from memory."}, {"score": 1, "techniqueID": "T1081", "comment": "PoshC2 contains modules for searching for passwords in local and remote files."}, {"score": 1, "techniqueID": "T1002", "comment": "PoshC2 contains a module for compressing data using ZIP."}, {"score": 1, "techniqueID": "T1482", "comment": "PoshC2 has modules for enumerating domain trusts."}, {"score": 1, "techniqueID": "T1068", "comment": "PoshC2 contains modules for local privilege escalation exploits such as CVE-2016-9192 and CVE-2016-0099."}, {"score": 1, "techniqueID": "T1210", "comment": "PoshC2 contains a module for exploiting SMB via EternalBlue."}, {"score": 1, "techniqueID": "T1083", "comment": "PoshC2 can enumerate files on the local file system and includes a module for enumerating recently accessed files."}, {"score": 1, "techniqueID": "T1056", "comment": "PoshC2 has modules for keystroke logging and capturing credentials from spoofed Outlook authentication messages."}, {"score": 1, "techniqueID": "T1171", "comment": "PoshC2 can use Inveigh to conduct name service poisoning for credential theft and associated relay attacks."}, {"score": 1, "techniqueID": "T1046", "comment": "PoshC2 can perform port scans from an infected host."}, {"score": 1, "techniqueID": "T1040", "comment": "PoshC2 contains a module for taking packet captures on compromised hosts."}, {"score": 1, "techniqueID": "T1075", "comment": "PoshC2 has a number of modules that leverage pass the hash for lateral movement."}, {"score": 1, "techniqueID": "T1201", "comment": "PoshC2 can use Get-PassPol to enumerate the domain password policy."}, {"score": 1, "techniqueID": "T1069", "comment": "PoshC2 contains modules, such as Get-LocAdm for enumerating permission groups."}, {"score": 1, "techniqueID": "T1055", "comment": "PoshC2 contains multiple modules for injecting into processes, such as Invoke-PSInject."}, {"score": 1, "techniqueID": "T1035", "comment": "PoshC2 contains an implementation of PsExec for remote execution."}, {"score": 1, "techniqueID": "T1071", "comment": "PoshC2 can use protocols like HTTP/HTTPS for command and control traffic."}, {"score": 1, "techniqueID": "T1082", "comment": "PoshC2 contains modules, such as Get-ComputerInfo, for enumerating common system information."}, {"score": 1, "techniqueID": "T1016", "comment": "PoshC2 can enumerate network adapter information."}, {"score": 1, "techniqueID": "T1049", "comment": "PoshC2 contains an implementation of netstat to enumerate TCP and UDP connections."}, {"score": 1, "techniqueID": "T1007", "comment": "PoshC2 can enumerate service and service permission information."}, {"score": 1, "techniqueID": "T1047", "comment": "PoshC2 has a number of modules that use WMI to execute tasks."}, {"score": 1, "techniqueID": "T1084", "comment": "PoshC2 has the ability to persist on a system using WMI events."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by PoshC2", "color": "#66b1ff"}]}