{"description": "Enterprise techniques used by Ursnif , ATT&CK software S0386 v1.0", "name": "Ursnif  (S0386)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1090", "comment": "Ursnif  has used a peer-to-peer (P2P) network for C2."}, {"score": 1, "techniqueID": "T1094", "comment": "Ursnif  has used a custom packet format over TCP and UDP for a peer-to-peer (P2P) network for C2."}, {"score": 1, "techniqueID": "T1132", "comment": "Ursnif  has used encoded data in HTTP URLs for C2.   "}, {"score": 1, "techniqueID": "T1005", "comment": "Ursnif  has collected files from victim machines, including certificates and cookies."}, {"score": 1, "techniqueID": "T1074", "comment": "Ursnif  has used tmp files to stage gathered information."}, {"score": 1, "techniqueID": "T1140", "comment": "Ursnif  has used crypto key information stored in the Registry to decrypt Tor clients dropped to disk."}, {"score": 1, "techniqueID": "T1175", "comment": "Ursnif  droppers have used COM objects to execute the malware's full executable payload."}, {"score": 1, "techniqueID": "T1483", "comment": "Ursnif  has used a DGA to generate domain names for C2."}, {"score": 1, "techniqueID": "T1106", "comment": "Ursnif  has used CreateProcessW to create child processes."}, {"score": 1, "techniqueID": "T1107", "comment": "Ursnif  has deleted data staged in tmp files after exfiltration."}, {"score": 1, "techniqueID": "T1179", "comment": "Ursnif  has hooked APIs to perform a wide variety of information theft, such as monitoring traffic from browsers."}, {"score": 1, "techniqueID": "T1185", "comment": "Ursnif  has injected HTML codes into banking sites to steal sensitive online banking information (ex: usernames and passwords)."}, {"score": 1, "techniqueID": "T1036", "comment": "Ursnif  has used strings from legitimate system files and existing folders for its file, folder, and Registry entry names."}, {"score": 1, "techniqueID": "T1112", "comment": "Ursnif  has used Registry modifications as part of its installation routine."}, {"score": 1, "techniqueID": "T1188", "comment": "Ursnif  has used Tor for C2."}, {"score": 1, "techniqueID": "T1050", "comment": "Ursnif  has registered itself as a system service in the Registry for automatic execution at system startup."}, {"score": 1, "techniqueID": "T1027", "comment": "Ursnif  has used an XOR-based algorithm to encrypt Tor clients dropped to disk.  Ursnif  droppers have also been delivered as password-protected zip files that execute base64 encoded PowerShell commands."}, {"score": 1, "techniqueID": "T1086", "comment": "Ursnif  droppers have used PowerShell in download cradles to download and execute the malware's full executable payload."}, {"score": 1, "techniqueID": "T1057", "comment": "Ursnif  has gathered information about running processes."}, {"score": 1, "techniqueID": "T1093", "comment": "Ursnif  has used process hollowing to inject into child processes."}, {"score": 1, "techniqueID": "T1055", "comment": "Ursnif  has injected code into target processes via thread local storage callbacks."}, {"score": 1, "techniqueID": "T1012", "comment": "Ursnif  has used Reg to query the Registry for installed programs."}, {"score": 1, "techniqueID": "T1060", "comment": "Ursnif  has used Registry Run keys to establish automatic execution at system startup."}, {"score": 1, "techniqueID": "T1105", "comment": "Ursnif  has dropped payload and configuration files to disk. Ursnif  has also been used to download and execute additional payloads."}, {"score": 1, "techniqueID": "T1091", "comment": "Ursnif  has copied itself to and infected removable drives for propagation."}, {"score": 1, "techniqueID": "T1113", "comment": "Ursnif  has used hooked APIs to take screenshots."}, {"score": 1, "techniqueID": "T1064", "comment": "Ursnif  droppers have used VBA macros and PowerShell to download and execute the malware's full executable payload."}, {"score": 1, "techniqueID": "T1071", "comment": "Ursnif  has used HTTPS for C2 as well as HTTP POSTs to exfil gathered information."}, {"score": 1, "techniqueID": "T1082", "comment": "Ursnif  has used Systeminfo to gather system information."}, {"score": 1, "techniqueID": "T1007", "comment": "Ursnif  has gathered information about running services."}, {"score": 1, "techniqueID": "T1080", "comment": "Ursnif  has copied itself to and infected files in network drives for propagation."}, {"score": 1, "techniqueID": "T1497", "comment": "Ursnif  has used a 30 minute delay after execution to evade sandbox monitoring tools."}, {"score": 1, "techniqueID": "T1047", "comment": "Ursnif  droppers have used WMI classes to execute PowerShell commands."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Ursnif ", "color": "#66b1ff"}]}