{"description": "Enterprise techniques used by Prikormka, ATT&CK software S0113 v1.1", "name": "Prikormka (S0113)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1003", "comment": "A module in Prikormka collects passwords stored in applications installed on the victim."}, {"score": 1, "techniqueID": "T1002", "comment": "After collecting documents from removable media, Prikormka compresses the collected files."}, {"score": 1, "techniqueID": "T1132", "comment": "Prikormka encodes C2 traffic with Base64."}, {"score": 1, "techniqueID": "T1022", "comment": "After collecting files and logs from the victim, Prikormka encrypts some collected data with Blowfish."}, {"score": 1, "techniqueID": "T1025", "comment": "Prikormka contains a module that collects documents with certain extensions from removable media or fixed drives connected via USB."}, {"score": 1, "techniqueID": "T1074", "comment": "Prikormka creates a directory, %USERPROFILE%\\AppData\\Local\\SKC\\, which is used to store collected log files."}, {"score": 1, "techniqueID": "T1038", "comment": "Prikormka uses DLL search order hijacking for persistence by saving itself as ntshrui.dll to the Windows directory so it will load before the legitimate ntshrui.dll saved in the System32 subdirectory."}, {"score": 1, "techniqueID": "T1083", "comment": "A module in Prikormka collects information about the paths, size, and creation time of files with specific file extensions, but not the actual content of the file."}, {"score": 1, "techniqueID": "T1070", "comment": "After encrypting log files, the log encryption module in Prikormka deletes the original, unencrypted files from the host."}, {"score": 1, "techniqueID": "T1056", "comment": "Prikormka contains a keylogger module that collects keystrokes and the titles of foreground windows."}, {"score": 1, "techniqueID": "T1027", "comment": "Some resources in Prikormka are encrypted with a simple XOR operation or encoded with Base64."}, {"score": 1, "techniqueID": "T1120", "comment": "A module in Prikormka collects information on available printers and disk drives."}, {"score": 1, "techniqueID": "T1060", "comment": "Prikormka adds itself to a Registry Run key with the name guidVGA or guidVSA."}, {"score": 1, "techniqueID": "T1085", "comment": "Prikormka uses rundll32.exe to load its DLL."}, {"score": 1, "techniqueID": "T1113", "comment": "Prikormka contains a module that captures screenshots of the victim's desktop."}, {"score": 1, "techniqueID": "T1063", "comment": "A module in Prikormka collects information from the victim about installed anti-virus software."}, {"score": 1, "techniqueID": "T1032", "comment": "Prikormka encrypts some C2 traffic with the Blowfish cipher."}, {"score": 1, "techniqueID": "T1082", "comment": "A module in Prikormka collects information from the victim about Windows OS version, computer name, battery info, and physical memory."}, {"score": 1, "techniqueID": "T1016", "comment": "A module in Prikormka collects information from the victim about its IP addresses and MAC addresses."}, {"score": 1, "techniqueID": "T1033", "comment": "A module in Prikormka collects information from the victim about the current user name."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Prikormka", "color": "#66b1ff"}]}