{"description": "Enterprise techniques used by RogueRobin, ATT&CK software S0270 v2.0", "name": "RogueRobin (S0270)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "RogueRobin uses a command prompt to run a PowerShell script from Excel."}, {"score": 1, "techniqueID": "T1094", "comment": "RogueRobin uses a custom DNS tunneling protocol for C2."}, {"score": 1, "techniqueID": "T1001", "comment": "RogueRobin base64 encodes strings that are sent to the C2 over its DNS tunnel."}, {"score": 1, "techniqueID": "T1140", "comment": "RogueRobin decodes an embedded executable using base64 and decompresses it."}, {"score": 1, "techniqueID": "T1027", "comment": "The PowerShell script with the RogueRobin payload was obfuscated using the COMPRESS technique in Invoke-Obfuscation."}, {"score": 1, "techniqueID": "T1086", "comment": "RogueRobin uses PowerShell for execution."}, {"score": 1, "techniqueID": "T1057", "comment": "RogueRobin checks the running processes for evidence it may be running in a sandbox environment. It specifically enumerates processes for Wireshark and Sysinternals."}, {"score": 1, "techniqueID": "T1060", "comment": "RogueRobin created a shortcut in the Windows startup folder to launch a PowerShell script each time the user logs in to establish persistence."}, {"score": 1, "techniqueID": "T1117", "comment": "RogueRobin uses regsvr32.exe to run a .sct file for execution."}, {"score": 1, "techniqueID": "T1105", "comment": "RogueRobin can save a new file to the system from the C2 server."}, {"score": 1, "techniqueID": "T1113", "comment": "RogueRobin has a command named $screenshot that may be responsible for taking screenshots of the victim machine."}, {"score": 1, "techniqueID": "T1064", "comment": "To assist in establishing persistence, RogueRobin creates %APPDATA%\\OneDrive.bat and saves the following string to it:powershell.exe -WindowStyle Hidden -exec bypass -File “%APPDATA%\\OneDrive.ps1”. RogueRobin also uses Windows Script Components."}, {"score": 1, "techniqueID": "T1063", "comment": "RogueRobin enumerates running processes to search for Wireshark and Windows Sysinternals suite."}, {"score": 1, "techniqueID": "T1023", "comment": "RogueRobin establishes persistence by creating a shortcut (.LNK file) in the Windows startup folder to run a script each time the user logs in."}, {"score": 1, "techniqueID": "T1082", "comment": "RogueRobin gathers BIOS versions and manufacturers, the number of CPU cores, the total physical memory, and the computer name."}, {"score": 1, "techniqueID": "T1016", "comment": "RogueRobin gathers the IP address and domain from the victim’s machine."}, {"score": 1, "techniqueID": "T1033", "comment": "RogueRobin collects the victim’s username and whether that user is an admin."}, {"score": 1, "techniqueID": "T1497", "comment": "RogueRobin uses WMI to check BIOS version for VBOX, bochs, qemu, virtualbox, and vm to check for evidence that the script might be executing within an analysis environment."}, {"score": 1, "techniqueID": "T1102", "comment": "RogueRobin has used Google Drive as a Command and Control channel."}, {"score": 1, "techniqueID": "T1047", "comment": "RogueRobin uses various WMI queries to check if the sample is running in a sandbox."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by RogueRobin", "color": "#66b1ff"}]}