{"description": "Enterprise techniques used by Threat Group-3390, ATT&CK group G0027 v1.1", "name": "Threat Group-3390 (G0027)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Threat Group-3390 has used net user to conduct internal discovery of systems."}, {"score": 1, "techniqueID": "T1119", "comment": "Threat Group-3390 ran a command to compile an archive of file types of interest from the victim user's directories."}, {"score": 1, "techniqueID": "T1088", "comment": "A Threat Group-3390 tool can use a public UAC bypass method to elevate privileges."}, {"score": 1, "techniqueID": "T1059", "comment": "Threat Group-3390 has used command-line interfaces for execution."}, {"score": 1, "techniqueID": "T1043", "comment": "C2 traffic for most Threat Group-3390 tools occurs over Port Numbers 53, 80, and 443."}, {"score": 1, "techniqueID": "T1003", "comment": "Threat Group-3390 actors have used gsecdump and a modified version of Mimikatz called Wrapikatz to dump credentials. They have also dumped credentials from domain controllers."}, {"score": 1, "techniqueID": "T1002", "comment": "Threat Group-3390 has used RAR to compress, encrypt, and password-protect files prior to exfiltration."}, {"score": 1, "techniqueID": "T1022", "comment": "Threat Group-3390 has used RAR to compress, encrypt, and password-protect files prior to exfiltration."}, {"score": 1, "techniqueID": "T1005", "comment": "Threat Group-3390 ran a command to compile an archive of file types of interest from the victim user's directories."}, {"score": 1, "techniqueID": "T1074", "comment": "Threat Group-3390 has staged encrypted archives for exfiltration on Internet-facing servers that had previously been compromised with China Chopper."}, {"score": 1, "techniqueID": "T1030", "comment": "Threat Group-3390 actors have split RAR files for exfiltration into parts."}, {"score": 1, "techniqueID": "T1140", "comment": "During execution, Threat Group-3390 malware deobfuscates and decompresses code that was encoded with Metasploit’s shikata_ga_nai encoder as well as compressed with LZNT1 compression."}, {"score": 1, "techniqueID": "T1089", "comment": "Threat Group-3390 has used appcmd.exe to disable logging on a victim server."}, {"score": 1, "techniqueID": "T1038", "comment": "Threat Group-3390 has performed DLL search order hijacking to execute their payload."}, {"score": 1, "techniqueID": "T1073", "comment": "Threat Group-3390 has used DLL side-loading, including by using legitimate Kaspersky antivirus variants in which the DLL acts as a stub loader that loads and executes the shell code."}, {"score": 1, "techniqueID": "T1189", "comment": "Threat Group-3390 has extensively used strategic web compromises to target victims."}, {"score": 1, "techniqueID": "T1203", "comment": "Threat Group-3390 has exploited the Microsoft SharePoint vulnerability CVE-2019-0604."}, {"score": 1, "techniqueID": "T1068", "comment": "Threat Group-3390 has used CVE-2014-6324 to escalate privileges."}, {"score": 1, "techniqueID": "T1210", "comment": "Threat Group-3390 has exploited MS17-101 to move laterally to other systems on the network.    "}, {"score": 1, "techniqueID": "T1133", "comment": "Threat Group-3390 actors look for and use VPN profiles during an operation to access the network using external VPN services."}, {"score": 1, "techniqueID": "T1107", "comment": "Threat Group-3390 has deleted existing logs and exfiltrated file archives from a victim."}, {"score": 1, "techniqueID": "T1056", "comment": "Threat Group-3390 actors installed a credential logger on Microsoft Exchange servers. Threat Group-3390 also leveraged the reconnaissance framework, ScanBox, to capture keystrokes."}, {"score": 1, "techniqueID": "T1112", "comment": "A Threat Group-3390 tool can create a new Registry key under HKEY_CURRENT_USER\\Software\\Classes\\."}, {"score": 1, "techniqueID": "T1046", "comment": "Threat Group-3390 actors use the Hunter tool to conduct network service discovery for vulnerable systems."}, {"score": 1, "techniqueID": "T1126", "comment": "Threat Group-3390 has detached network shares after exfiltrating files, likely to evade detection."}, {"score": 1, "techniqueID": "T1050", "comment": "A Threat Group-3390 tool can create a new service, naming it after the config information, to gain persistence."}, {"score": 1, "techniqueID": "T1027", "comment": "A Threat Group-3390 tool can encrypt payloads using XOR. Threat Group-3390 malware is also obfuscated using Metasploit’s shikata_ga_nai encoder as well as compressed with LZNT1 compression."}, {"score": 1, "techniqueID": "T1086", "comment": "Threat Group-3390 has used PowerShell for execution."}, {"score": 1, "techniqueID": "T1055", "comment": "A Threat Group-3390 tool can spawn svchost.exe and inject the payload into that process."}, {"score": 1, "techniqueID": "T1012", "comment": "A Threat Group-3390 tool can read and decrypt stored Registry values."}, {"score": 1, "techniqueID": "T1108", "comment": "Threat Group-3390 has deployed backup web shells and obtained OWA account credentials during intrusions that it subsequently used to attempt to regain access when evicted from a victim network."}, {"score": 1, "techniqueID": "T1060", "comment": "A Threat Group-3390 tool can add the binary’s path to the Registry key Software\\Microsoft\\Windows\\CurrentVersion\\Run to add persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "After re-establishing access to a victim network, Threat Group-3390 actors download tools including gsecdump and WCE that are staged temporarily on websites that were previously compromised but never used."}, {"score": 1, "techniqueID": "T1018", "comment": "Threat Group-3390 has used the net view command."}, {"score": 1, "techniqueID": "T1053", "comment": "Threat Group-3390 actors use at to schedule tasks to run self-extracting RAR archives, which install HTTPBrowser or PlugX on other victims on a network."}, {"score": 1, "techniqueID": "T1071", "comment": "Threat Group-3390 malware has used HTTP for C2."}, {"score": 1, "techniqueID": "T1016", "comment": "Threat Group-3390 actors use nbtscan to discover vulnerable systems."}, {"score": 1, "techniqueID": "T1049", "comment": "Threat Group-3390 has used net use to conduct internal discovery of systems. The group has also used quser.exe to identify existing RDP sessions on a victim."}, {"score": 1, "techniqueID": "T1078", "comment": "Threat Group-3390 actors obtain legitimate credentials using a variety of methods and use them to further lateral movement on victim networks."}, {"score": 1, "techniqueID": "T1100", "comment": "Threat Group-3390 has used a variety of Web shells."}, {"score": 1, "techniqueID": "T1047", "comment": "A Threat Group-3390 tool can use WMI to execute a binary."}, {"score": 1, "techniqueID": "T1028", "comment": "Threat Group-3390 has used WinRM to enable remote execution."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Threat Group-3390", "color": "#66b1ff"}]}