{"description": "Enterprise techniques used by Pupy, ATT&CK software S0192 v1.1", "name": "Pupy (S0192)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "Pupy can obtain a list of SIDs and provide the option for selecting process tokens to impersonate."}, {"score": 1, "techniqueID": "T1087", "comment": "Pupy uses PowerView and Pywerview to perform discovery commands such as net user, net group, net local group, etc."}, {"score": 1, "techniqueID": "T1123", "comment": "Pupy can record sound with the microphone."}, {"score": 1, "techniqueID": "T1088", "comment": "Pupy can bypass Windows UAC through either DLL hijacking, eventvwr, or appPaths."}, {"score": 1, "techniqueID": "T1136", "comment": "Pupy can user PowerView to perform “net user” commands and create local system and domain accounts."}, {"score": 1, "techniqueID": "T1003", "comment": "Pupy executes Mimikatz using PowerShell and can also perform pass-the-ticket and use Lazagne for harvesting credentials."}, {"score": 1, "techniqueID": "T1002", "comment": "Pupy can compress data with Zip before sending it over C2."}, {"score": 1, "techniqueID": "T1114", "comment": "Pupy can interact with a victim’s Outlook session and look through folders and emails."}, {"score": 1, "techniqueID": "T1041", "comment": "Pupy can send screenshots files, keylogger data, files, and recorded audio back to the C2 server."}, {"score": 1, "techniqueID": "T1083", "comment": "Pupy can walk through directories and recursively search for strings in files."}, {"score": 1, "techniqueID": "T1070", "comment": "Pupy has a module to clear event logs with PowerShell."}, {"score": 1, "techniqueID": "T1056", "comment": "Pupy uses a keylogger to capture keystrokes it then sends back to the server after it is stopped."}, {"score": 1, "techniqueID": "T1171", "comment": "Pupy can sniff plaintext network credentials and use NBNS Spoofing to poison name services."}, {"score": 1, "techniqueID": "T1079", "comment": "Pupy can use Obfs3, a pluggable transport, to add another layer of encryption and obfuscate TLS."}, {"score": 1, "techniqueID": "T1046", "comment": "Pupy has a built-in module for port scanning."}, {"score": 1, "techniqueID": "T1135", "comment": "Pupy can list local and remote shared drives and folders over SMB."}, {"score": 1, "techniqueID": "T1086", "comment": "Pupy has a module for loading and executing PowerShell scripts."}, {"score": 1, "techniqueID": "T1057", "comment": "Pupy can list the running processes and get the process ID and parent process’s ID."}, {"score": 1, "techniqueID": "T1055", "comment": "Pupy can migrate into another process using reflective DLL injection."}, {"score": 1, "techniqueID": "T1060", "comment": "Pupy adds itself to the startup folder or adds itself to the Registry key SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run for persistence."}, {"score": 1, "techniqueID": "T1076", "comment": "Pupy can enable/disable RDP connection and can start a remote desktop session using a browser web socket client."}, {"score": 1, "techniqueID": "T1105", "comment": "Pupy can upload and download to/from a victim machine."}, {"score": 1, "techniqueID": "T1113", "comment": "Pupy can drop a mouse-logger that will take small screenshots around at each click and then send back to the server."}, {"score": 1, "techniqueID": "T1064", "comment": "Pupy can use an add on feature when creating payloads that allows you to create custom Python scripts (“scriptlets”) to perform tasks offline (without requiring a session) such as sandbox detection, adding persistence, etc."}, {"score": 1, "techniqueID": "T1035", "comment": "Pupy uses PsExec to execute a payload or commands on a remote host."}, {"score": 1, "techniqueID": "T1071", "comment": "Pupy can communicate over HTTP for C2."}, {"score": 1, "techniqueID": "T1032", "comment": "Pupy's default encryption for its C2 communication channel is SSL, but it also has transport options for RSA and AES."}, {"score": 1, "techniqueID": "T1082", "comment": "Pupy can grab a system’s information including the OS version, architecture, etc."}, {"score": 1, "techniqueID": "T1016", "comment": "Pupy has built in commands to identify a host’s IP address and find out other network configuration settings by viewing connected sessions."}, {"score": 1, "techniqueID": "T1049", "comment": "Pupy has a built-in utility command for netstat, can do net session through PowerView, and has an interactive shell which can be used to discover additional information."}, {"score": 1, "techniqueID": "T1033", "comment": "Pupy can enumerate local information for Linux hosts and find currently logged on users for Windows hosts."}, {"score": 1, "techniqueID": "T1501", "comment": "Pupy can be used to establish persistence using a systemd service."}, {"score": 1, "techniqueID": "T1125", "comment": "Pupy can access a connected webcam and capture pictures."}, {"score": 1, "techniqueID": "T1497", "comment": "Pupy has a module to check if its running on a virtual machine."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Pupy", "color": "#66b1ff"}]}