{"description": "Enterprise techniques used by XAgentOSX, ATT&CK software S0161 v1.2", "name": "XAgentOSX (S0161)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1106", "comment": "XAgentOSX contains the execFile function to execute a specified file on the system using the NSTask:launch method."}, {"score": 1, "techniqueID": "T1083", "comment": "XAgentOSX contains the readFiles function to return a detailed listing (sometimes recursive) of a specified directory."}, {"score": 1, "techniqueID": "T1107", "comment": "XAgentOSX contains the deletFileFromPath function to delete a specified file using the NSFileManager:removeFileAtPath method."}, {"score": 1, "techniqueID": "T1056", "comment": "XAgentOSX contains keylogging functionality that will monitor for active application windows and write them to the log, it can handle special characters, and it will buffer by default 50 characters before sending them out over the C2 infrastructure."}, {"score": 1, "techniqueID": "T1120", "comment": "XAgentOSX contains the showBackupIosFolder function to check for IOS device backups by running ls -la ~/Library/Application\\ Support/MobileSync/Backup/."}, {"score": 1, "techniqueID": "T1057", "comment": "XAgentOSX contains the getProcessList function to run ps aux to get running processes."}, {"score": 1, "techniqueID": "T1113", "comment": "XAgentOSX contains the takeScreenShot (along with startTakeScreenShot and stopTakeScreenShot) functions to take screenshots using the CGGetActiveDisplayList, CGDisplayCreateImage, and NSImage:initWithCGImage methods."}, {"score": 1, "techniqueID": "T1071", "comment": "XAgentOSX contains the ftpUpload function to use the FTPManager:uploadFile method to upload files from the target system."}, {"score": 1, "techniqueID": "T1082", "comment": "XAgentOSX contains the getInstalledAPP function to run ls -la /Applications to gather what applications are installed."}, {"score": 1, "techniqueID": "T1033", "comment": "XAgentOSX contains the getInfoOSX function to return the OS X version as well as the current user."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by XAgentOSX", "color": "#66b1ff"}]}