{"description": "Enterprise techniques used by BADNEWS, ATT&CK software S0128 v1.0", "name": "BADNEWS (S0128)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "BADNEWS monitors USB devices and copies files with certain extensions to\na predefined directory."}, {"score": 1, "techniqueID": "T1116", "comment": "BADNEWS is sometimes signed with an invalid Authenticode certificate in an apparent effort to make it look more legitimate."}, {"score": 1, "techniqueID": "T1059", "comment": "BADNEWS is capable of executing commands via cmd.exe."}, {"score": 1, "techniqueID": "T1024", "comment": "BADNEWS encrypts C2 data with a ROR by 3 and an XOR by 0x23."}, {"score": 1, "techniqueID": "T1132", "comment": "BADNEWS encodes C2 traffic with base64."}, {"score": 1, "techniqueID": "T1005", "comment": "When it first starts, BADNEWS crawls the victim's local drives and collects documents with the following extensions: .doc, .docx, .pdf, .ppt, .pptx, and .txt."}, {"score": 1, "techniqueID": "T1039", "comment": "When it first starts, BADNEWS crawls the victim's mapped drives and collects documents with the following extensions: .doc, .docx, .pdf, .ppt, .pptx, and .txt."}, {"score": 1, "techniqueID": "T1025", "comment": "BADNEWS copies files with certain extensions from USB devices to\na predefined directory."}, {"score": 1, "techniqueID": "T1001", "comment": "After encrypting C2 data, BADNEWS converts it into a hexadecimal representation and then encodes it into base64."}, {"score": 1, "techniqueID": "T1074", "comment": "BADNEWS copies documents under 15MB found on the victim system to is the user's %temp%\\SMB\\ folder. It also copies files from USB devices to a predefined directory."}, {"score": 1, "techniqueID": "T1073", "comment": "BADNEWS typically loads its DLL file into a legitimate signed Java or VMware executable."}, {"score": 1, "techniqueID": "T1106", "comment": "BADNEWS has a command to download an .exe and execute it via CreateProcess API. It can also run with ShellExecute."}, {"score": 1, "techniqueID": "T1083", "comment": "BADNEWS identifies files with certain extensions from USB devices, then copies them to a predefined directory."}, {"score": 1, "techniqueID": "T1056", "comment": "When it first starts, BADNEWS spawns a new thread to log keystrokes."}, {"score": 1, "techniqueID": "T1036", "comment": "BADNEWS attempts to hide its payloads using legitimate filenames."}, {"score": 1, "techniqueID": "T1120", "comment": "BADNEWS checks for new hard drives on the victim, such as USB devices, by listening for the WM_DEVICECHANGE window message."}, {"score": 1, "techniqueID": "T1093", "comment": "BADNEWS has a command to download an .exe and use process hollowing to inject it into a new process."}, {"score": 1, "techniqueID": "T1060", "comment": "BADNEWS installs a registry Run key to establish persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "BADNEWS is capable of downloading additional files through C2 channels, including a new version of itself."}, {"score": 1, "techniqueID": "T1053", "comment": "BADNEWS creates a scheduled task to establish by executing a malicious payload every subsequent minute."}, {"score": 1, "techniqueID": "T1113", "comment": "BADNEWS has a command to take a screenshot and send it to the C2 server."}, {"score": 1, "techniqueID": "T1071", "comment": "BADNEWS establishes a backdoor over HTTP."}, {"score": 1, "techniqueID": "T1102", "comment": "BADNEWS can use multiple C2 channels, including RSS feeds, Github, forums, and blogs. BADNEWS also collects C2 information via a dead drop resolver."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by BADNEWS", "color": "#66b1ff"}]}