{"description": "Enterprise techniques used by LightNeuron, ATT&CK software S0395 v1.0", "name": "LightNeuron (S0395)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "LightNeuron can be configured to automatically collect files under a specified directory."}, {"score": 1, "techniqueID": "T1020", "comment": "LightNeuron can be configured to automatically exfiltrate files under a specified directory."}, {"score": 1, "techniqueID": "T1059", "comment": "LightNeuron is capable of executing commands via cmd.exe."}, {"score": 1, "techniqueID": "T1022", "comment": "LightNeuron contains a function to encrypt and store emails that it collects."}, {"score": 1, "techniqueID": "T1005", "comment": "LightNeuron can collect files from a local system."}, {"score": 1, "techniqueID": "T1001", "comment": "LightNeuron is controlled via commands that are embedded into PDFs and JPGs using steganographic methods."}, {"score": 1, "techniqueID": "T1074", "comment": "LightNeuron can store email data in files and directories specified in its configuration, such as C:\\Windows\\ServiceProfiles\\NetworkService\\appdata\\Local\\Temp\\."}, {"score": 1, "techniqueID": "T1140", "comment": "LightNeuron has used AES and XOR to decrypt configuration files and commands."}, {"score": 1, "techniqueID": "T1114", "comment": "LightNeuron collects emails matching rules specified in its configuration."}, {"score": 1, "techniqueID": "T1106", "comment": "LightNeuron is capable of starting a process using CreateProcess."}, {"score": 1, "techniqueID": "T1041", "comment": "LightNeuron exfiltrates data over its email C2 channel."}, {"score": 1, "techniqueID": "T1107", "comment": "LightNeuron has a function to delete files."}, {"score": 1, "techniqueID": "T1036", "comment": "LightNeuron has used filenames associated with Exchange and Outlook for binary and configuration files, such as winmail.dat."}, {"score": 1, "techniqueID": "T1027", "comment": "LightNeuron encrypts its configuration files with AES-256."}, {"score": 1, "techniqueID": "T1105", "comment": "LightNeuron has the ability to download and execute additional files."}, {"score": 1, "techniqueID": "T1029", "comment": "LightNeuron can be configured to exfiltrate data during nighttime or working hours."}, {"score": 1, "techniqueID": "T1071", "comment": "LightNeuron uses SMTP for C2."}, {"score": 1, "techniqueID": "T1032", "comment": "LightNeuron uses AES to encrypt C2 traffic."}, {"score": 1, "techniqueID": "T1082", "comment": "LightNeuron gathers the victim computer name using the Win32 API call GetComputerName."}, {"score": 1, "techniqueID": "T1016", "comment": "LightNeuron gathers information about network adapters using the Win32 API call GetAdaptersInfo."}, {"score": 1, "techniqueID": "T1493", "comment": "LightNeuron is capable of modifying email content, headers, and attachments during transit."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by LightNeuron", "color": "#66b1ff"}]}