{"description": "Mobile techniques used by Bread, ATT&CK software S0432 v1.0", "name": "Bread (S0432)", "domain": "mitre-mobile", "version": "3.0", "techniques": [{"score": 1, "techniqueID": "T1412", "showSubtechniques": false, "comment": "Bread can access SMS messages in order to complete carrier billing fraud.[1]"}, {"score": 1, "techniqueID": "T1448", "showSubtechniques": false, "comment": "Bread can perform SMS fraud on older versions of the malware, and toll fraud on newer versions.[1]"}, {"score": 1, "techniqueID": "T1475", "showSubtechniques": false, "comment": "Bread has been distributed through the Play Store. Some versions started off as clean to build a userbase and developer reputation. These versions were then updated to introduce malicious code.[1] "}, {"score": 1, "techniqueID": "T1407", "showSubtechniques": false, "comment": "Bread has utilized JavaScript within WebViews that loaded a URL hosted on a Bread-controlled server which provided functions to run. Bread downloads billing fraud execution steps at runtime.[1]"}, {"score": 1, "techniqueID": "T1452", "showSubtechniques": false, "comment": "Bread had many fake reviews and ratings on the Play Store.[1] "}, {"score": 1, "techniqueID": "T1575", "showSubtechniques": false, "comment": "Bread has used native code in an attempt to disguise malicious functionality.[1]"}, {"score": 1, "techniqueID": "T1406", "showSubtechniques": false, "comment": "Bread uses various tricks to obfuscate its strings including standard and custom encryption, programmatically building strings at runtime, and splitting unencrypted strings with repeated delimiters to break up keywords. Bread has also abused Java and JavaScript features to obfuscate code. Bread payloads have used several commercially available packers as well as hiding code in native libraries and encrypted JAR files in the data section of an ELF file.[1]"}, {"score": 1, "techniqueID": "T1437", "showSubtechniques": false, "comment": "Bread communicates with the C2 server using HTTP requests.[1]"}, {"score": 1, "techniqueID": "T1422", "showSubtechniques": false, "comment": "Bread collects the device’s IMEI, carrier, mobile country code, and mobile network code.[1]"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Bread", "color": "#66b1ff"}]}