{"description": "Mobile techniques used by Gustuff, ATT&CK software S0406 v1.0", "name": "Gustuff (S0406)", "domain": "mitre-mobile", "version": "2.2", "techniques": [{"score": 1, "techniqueID": "T1432", "comment": "Gustuff can collect the contact list. [1]"}, {"score": 1, "techniqueID": "T1438", "comment": "Gustuff can use SMS for command and control from a defined admin phone number. [1]"}, {"score": 1, "techniqueID": "T1418", "comment": "Gustuff checks for antivirus software contained in a predefined list.[1]"}, {"score": 1, "techniqueID": "T1412", "comment": "Gustuff can intercept two-factor authentication codes transmitted via SMS. [1]"}, {"score": 1, "techniqueID": "T1533", "comment": "Gustuff can capture files and photos from the compromised device. [1]"}, {"score": 1, "techniqueID": "T1476", "comment": "Gustuff was distributed via SMS phishing messages to numbers exfiltrated from compromised devices’ contact lists. The phishing SMS messages are sent from the compromised device to the target device.[1]"}, {"score": 1, "techniqueID": "T1417", "comment": "Gustuff abuses accessibility features to intercept all interactions between a user and the device.[1]"}, {"score": 1, "techniqueID": "T1516", "comment": "Gustuff injects the global action GLOBAL_ACTION_BACK to mimic pressing the back button to close the application if a call to an open antivirus application is detected.[1]"}, {"score": 1, "techniqueID": "T1411", "comment": "Gustuff uses WebView overlays to prompt the user for their device unlock code, as well as banking and cryptocurrency application credentials. Gustuff can also send push notifications pretending to be from a bank, triggering a phishing overlay.[1][2]"}, {"score": 1, "techniqueID": "T1406", "comment": "Gustuff code is both obfuscated and packed with an FTT packer. Command information is obfuscated using a custom base85-based encoding.[1]"}, {"score": 1, "techniqueID": "T1437", "comment": "Gustuff communicates with the command and control server using HTTP requests.[1]"}, {"score": 1, "techniqueID": "T1508", "comment": "Gustuff hides its icon after installation. [2]"}, {"score": 1, "techniqueID": "T1426", "comment": "Gustuff gathers information about the device, including the default SMS application, if SafetyNet is enabled, the battery level, the operating system version, and if the malware has elevated permissions.[1]"}, {"score": 1, "techniqueID": "T1422", "comment": "Gustuff gathers the device IMEI to send to the command and control server.[1]"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Gustuff", "color": "#66b1ff"}]}