{"description": "Enterprise techniques used by APT3, ATT&CK group G0022 v1.1", "name": "APT3 (G0022)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1015", "comment": "APT3 replaces the Sticky Keys binary C:\\Windows\\System32\\sethc.exe for persistence."}, {"score": 1, "techniqueID": "T1087", "comment": "APT3 has used a tool that can obtain info about local and global group users, power users, and administrators."}, {"score": 1, "techniqueID": "T1098", "comment": "APT3 has been known to add created accounts to local admin groups to maintain elevated access."}, {"score": 1, "techniqueID": "T1110", "comment": "APT3 has been known to brute force password hashes to be able to leverage plain text credentials."}, {"score": 1, "techniqueID": "T1059", "comment": "An APT3 downloader uses the Windows command \"cmd.exe\" /C whoami. The group also uses a tool to execute commands on remote computers."}, {"score": 1, "techniqueID": "T1043", "comment": "APT3 uses commonly used ports (like HTTPS/443) for command and control."}, {"score": 1, "techniqueID": "T1090", "comment": "An APT3 downloader establishes SOCKS5 connections for its initial C2."}, {"score": 1, "techniqueID": "T1136", "comment": "APT3 has been known to create or enable accounts, such as support_388945a0."}, {"score": 1, "techniqueID": "T1003", "comment": "APT3 has used a tool to dump credentials by injecting itself into lsass.exe and triggering with the argument \"dig.\" The group has also used a tools to dump passwords from browsers."}, {"score": 1, "techniqueID": "T1081", "comment": "APT3 has a tool that can locate credentials in files on the file system such as those from Firefox or Chrome."}, {"score": 1, "techniqueID": "T1002", "comment": "APT3 has used tools to compress data before exfilling it."}, {"score": 1, "techniqueID": "T1005", "comment": "APT3 will identify Microsoft Office documents on the victim's computer."}, {"score": 1, "techniqueID": "T1074", "comment": "APT3 has been known to stage files for exfiltration in a single location."}, {"score": 1, "techniqueID": "T1073", "comment": "APT3 has been known to side load DLLs with a valid version of Chrome with one of their tools."}, {"score": 1, "techniqueID": "T1041", "comment": "APT3 has a tool that exfiltrates data over the C2 channel."}, {"score": 1, "techniqueID": "T1083", "comment": "APT3 has a tool that looks for files and directories on the local file system."}, {"score": 1, "techniqueID": "T1107", "comment": "APT3 has a tool that can delete files."}, {"score": 1, "techniqueID": "T1061", "comment": "APT3 has interacted with compromised systems to browse and copy files through its graphical user interface in Remote Desktop Protocol sessions."}, {"score": 1, "techniqueID": "T1066", "comment": "APT3 has been known to remove indicators of compromise from tools."}, {"score": 1, "techniqueID": "T1056", "comment": "APT3 has used a keylogging tool that records keystrokes in encrypted files."}, {"score": 1, "techniqueID": "T1104", "comment": "An APT3 downloader first establishes a SOCKS5 connection to 192.157.198[.]103 using TCP port 1913; once the server response is verified, it then requests a connection to 192.184.60[.]229 on TCP port 81."}, {"score": 1, "techniqueID": "T1050", "comment": "APT3 has a tool that creates a new service for persistence."}, {"score": 1, "techniqueID": "T1027", "comment": "APT3 obfuscates files or information to help evade defensive measures."}, {"score": 1, "techniqueID": "T1069", "comment": "APT3 has a tool that can enumerate the permissions associated with Windows groups."}, {"score": 1, "techniqueID": "T1086", "comment": "APT3 has used PowerShell on victim systems to download and run payloads after exploitation."}, {"score": 1, "techniqueID": "T1057", "comment": "APT3 has a tool that can list out currently running processes."}, {"score": 1, "techniqueID": "T1108", "comment": "APT3 has been known to use multiple backdoors per campaign."}, {"score": 1, "techniqueID": "T1060", "comment": "APT3 places scripts in the startup folder for persistence."}, {"score": 1, "techniqueID": "T1076", "comment": "APT3 enables the Remote Desktop Protocol for persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "APT3 has a tool that can copy files to remote machines."}, {"score": 1, "techniqueID": "T1018", "comment": "APT3 has a tool that can detect the existence of remote systems."}, {"score": 1, "techniqueID": "T1085", "comment": "APT3 has a tool that can run DLLs."}, {"score": 1, "techniqueID": "T1053", "comment": "An APT3 downloader creates persistence by creating the following scheduled task: schtasks /create /tn \"mysc\" /tr C:\\Users\\Public\\test.exe /sc ONLOGON /ru \"System\"."}, {"score": 1, "techniqueID": "T1064", "comment": "APT3 has used PowerShell on victim systems to download and run payloads after exploitation."}, {"score": 1, "techniqueID": "T1045", "comment": "APT3 has been known to pack their tools."}, {"score": 1, "techniqueID": "T1095", "comment": "An APT3 downloader establishes SOCKS5 connections for its initial C2."}, {"score": 1, "techniqueID": "T1082", "comment": "APT3 has a tool that can obtain information about the local system."}, {"score": 1, "techniqueID": "T1016", "comment": "A keylogging tool used by APT3 gathers network information from the victim, including the MAC address, IP address, WINS, DHCP server, and gateway."}, {"score": 1, "techniqueID": "T1049", "comment": "APT3 has a tool that can enumerate current network connections."}, {"score": 1, "techniqueID": "T1033", "comment": "An APT3 downloader uses the Windows command \"cmd.exe\" /C whoami to verify that it is running with the elevated privileges of “System.”"}, {"score": 1, "techniqueID": "T1065", "comment": "An APT3 downloader establishes SOCKS5 connections to two separate IP addresses over TCP port 1913 and TCP port 81."}, {"score": 1, "techniqueID": "T1078", "comment": "APT3 leverages valid accounts after gaining credentials for use within the victim domain."}, {"score": 1, "techniqueID": "T1077", "comment": "APT3 will copy files over to Windows Admin Shares (like ADMIN$) as part of lateral movement."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by APT3", "color": "#66b1ff"}]}