{"description": "Enterprise techniques used by StoneDrill, ATT&CK software S0380 v1.0", "name": "StoneDrill (S0380)", "domain": "mitre-enterprise", "version": "2.2", "techniques": [{"score": 1, "techniqueID": "T1485", "comment": "StoneDrill has a disk wiper module that targets files other than those in the Windows directory.[2]"}, {"score": 1, "techniqueID": "T1488", "comment": "StoneDrill can wipe the accessible physical or logical drives of the infected machine.   [3]"}, {"score": 1, "techniqueID": "T1487", "comment": "StoneDrill can wipe the master boot record of an infected computer.[3]"}, {"score": 1, "techniqueID": "T1107", "comment": "StoneDrill has been observed deleting the temporary files once they fulfill their task.  [2]"}, {"score": 1, "techniqueID": "T1027", "comment": "StoneDrill has obfuscated its module with an alphabet-based table or XOR encryption.[2]"}, {"score": 1, "techniqueID": "T1055", "comment": "StoneDrill has relied on injecting its payload directly into the process memory of the victim's preferred browser.[2]"}, {"score": 1, "techniqueID": "T1012", "comment": "StoneDrill has looked in the registry to find the default browser path.[2]"}, {"score": 1, "techniqueID": "T1105", "comment": "StoneDrill has downloaded and dropped temporary files containing scripts; it additionally has a function to upload files from the victims machine.   [2]"}, {"score": 1, "techniqueID": "T1113", "comment": "StoneDrill can take screenshots. [2]"}, {"score": 1, "techniqueID": "T1064", "comment": "StoneDrill has several VBS scripts used throughout the malware's lifecycle.  [2]"}, {"score": 1, "techniqueID": "T1063", "comment": "StoneDrill can check for antivirus and antimalware programs. [2]"}, {"score": 1, "techniqueID": "T1082", "comment": "StoneDrill has the capability to discover the system OS, Windows version, architecture and environment.  [2]"}, {"score": 1, "techniqueID": "T1124", "comment": "StoneDrill can obtain the current date and time of the victim machine.   [2]"}, {"score": 1, "techniqueID": "T1497", "comment": "StoneDrill has used several anti-emulation techniques to prevent automated analysis by emulators or sandboxes.   [2]"}, {"score": 1, "techniqueID": "T1047", "comment": "StoneDrill has used the WMI command-line (WMIC) utility to run tasks.[2]"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by StoneDrill", "color": "#66b1ff"}]}