{"description": "Enterprise techniques used by BRONZE BUTLER, ATT&CK group G0060 v1.0", "name": "BRONZE BUTLER (G0060)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "BRONZE BUTLER has used net user /domain to identify account information."}, {"score": 1, "techniqueID": "T1009", "comment": "BRONZE BUTLER downloader code has included \"0\" characters at the end of the file to inflate the file size in a likely attempt to evade anti-virus detection."}, {"score": 1, "techniqueID": "T1088", "comment": "BRONZE BUTLER malware xxmm contains a UAC bypass tool for privilege escalation."}, {"score": 1, "techniqueID": "T1059", "comment": "BRONZE BUTLER uses the command-line interface."}, {"score": 1, "techniqueID": "T1003", "comment": "BRONZE BUTLER has used various tools to perform credential dumping."}, {"score": 1, "techniqueID": "T1024", "comment": "BRONZE BUTLER has used a tool called RarStar that encodes data with a custom XOR algorithm when posting it to a C2 server."}, {"score": 1, "techniqueID": "T1002", "comment": "BRONZE BUTLER has compressed data into password-protected RAR archives prior to exfiltration."}, {"score": 1, "techniqueID": "T1132", "comment": "Several BRONZE BUTLER tools encode data with base64 when posting it to a C2 server."}, {"score": 1, "techniqueID": "T1022", "comment": "BRONZE BUTLER has compressed and encrypted data into password-protected RAR archives prior to exfiltration."}, {"score": 1, "techniqueID": "T1005", "comment": "BRONZE BUTLER has exfiltrated files stolen from local systems."}, {"score": 1, "techniqueID": "T1039", "comment": "BRONZE BUTLER has exfiltrated files stolen from file shares."}, {"score": 1, "techniqueID": "T1140", "comment": "BRONZE BUTLER downloads encoded payloads and decodes them on the victim."}, {"score": 1, "techniqueID": "T1189", "comment": "BRONZE BUTLER compromised three Japanese websites using a Flash exploit to perform watering hole attacks."}, {"score": 1, "techniqueID": "T1203", "comment": "BRONZE BUTLER has exploited Microsoft Word vulnerability CVE-2014-4114 for execution."}, {"score": 1, "techniqueID": "T1083", "comment": "BRONZE BUTLER has collected a list of files from the victim and uploaded it to its C2 server, and then created a new list of specific files to steal."}, {"score": 1, "techniqueID": "T1107", "comment": "The BRONZE BUTLER uploader or malware the uploader uses command to delete the RAR archives after they have been exfiltrated."}, {"score": 1, "techniqueID": "T1036", "comment": "BRONZE BUTLER has given malware the same name as an existing file on the file share server to cause users to unwittingly launch and install the malware on additional systems."}, {"score": 1, "techniqueID": "T1097", "comment": "BRONZE BUTLER has created forged Kerberos Ticket Granting Ticket (TGT) and Ticket Granting Service (TGS) tickets to maintain administrative access."}, {"score": 1, "techniqueID": "T1086", "comment": "BRONZE BUTLER has used PowerShell for execution."}, {"score": 1, "techniqueID": "T1060", "comment": "BRONZE BUTLER has used a batch script that adds a Registry Run key to establish malware persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "BRONZE BUTLER has used various tools to download files, including DGet (a similar tool to wget)."}, {"score": 1, "techniqueID": "T1018", "comment": "BRONZE BUTLER typically use ping and Net to enumerate systems."}, {"score": 1, "techniqueID": "T1053", "comment": "BRONZE BUTLER has used at and schtasks to register a scheduled task to execute malware during lateral movement."}, {"score": 1, "techniqueID": "T1113", "comment": "BRONZE BUTLER has used a tool to capture screenshots."}, {"score": 1, "techniqueID": "T1064", "comment": "BRONZE BUTLER has used VBS, VBE, and batch scripts for execution."}, {"score": 1, "techniqueID": "T1193", "comment": "BRONZE BUTLER used spearphishing emails with malicious Microsoft Word attachments to infect victims."}, {"score": 1, "techniqueID": "T1071", "comment": "BRONZE BUTLER malware has used HTTP for C2."}, {"score": 1, "techniqueID": "T1032", "comment": "BRONZE BUTLER has used RC4 encryption (for Datper malware) and AES (for xxmm malware) to obfuscate HTTP traffic."}, {"score": 1, "techniqueID": "T1124", "comment": "BRONZE BUTLER has used net time to check the local time on a target system."}, {"score": 1, "techniqueID": "T1204", "comment": "BRONZE BUTLER has attempted to get users to launch malicious Microsoft Word attachments delivered via spearphishing emails."}, {"score": 1, "techniqueID": "T1102", "comment": "BRONZE BUTLER's MSGET downloader uses a dead drop resolver to access malicious payloads."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by BRONZE BUTLER", "color": "#66b1ff"}]}