{"description": "Enterprise techniques used by T9000, ATT&CK software S0098 v1.0", "name": "T9000 (S0098)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1103", "comment": "If a victim meets certain criteria, T9000 uses the AppInit_DLL functionality to achieve persistence by ensuring that every user mode process that is spawned will load its malicious DLL, ResN32.dll. It does this by creating the following Registry keys: HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs – %APPDATA%\\Intel\\ResN32.dll and HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\LoadAppInit_DLLs – 0x1."}, {"score": 1, "techniqueID": "T1123", "comment": "T9000 uses the Skype API to record audio and video calls. It writes encrypted data to %APPDATA%\\Intel\\Skype."}, {"score": 1, "techniqueID": "T1119", "comment": "T9000 searches removable storage devices for files with a pre-defined list of file extensions (e.g. * .doc, .ppt, .xls, .docx, .pptx, *.xlsx). Any matching files are encrypted and written to a local user directory."}, {"score": 1, "techniqueID": "T1022", "comment": "T9000 encrypts collected data using a single byte XOR key."}, {"score": 1, "techniqueID": "T1073", "comment": "During the T9000 installation process, it drops a copy of the legitimate Microsoft binary igfxtray.exe. The executable contains a side-loading weakness which is used to load a portion of the malware."}, {"score": 1, "techniqueID": "T1120", "comment": "T9000 searches through connected drives for removable storage devices."}, {"score": 1, "techniqueID": "T1113", "comment": "T9000 can take screenshots of the desktop and target application windows, saving them to user directories as one byte XOR encrypted .dat files."}, {"score": 1, "techniqueID": "T1063", "comment": "T9000 performs checks for various antivirus and security products during installation."}, {"score": 1, "techniqueID": "T1082", "comment": "T9000 gathers and beacons the operating system build number and CPU Architecture (32-bit/64-bit) during installation."}, {"score": 1, "techniqueID": "T1016", "comment": "T9000 gathers and beacons the MAC and IP addresses during installation."}, {"score": 1, "techniqueID": "T1033", "comment": "T9000 gathers and beacons the username of the logged in account during installation. It will also gather the username of running processes to determine if it is running as SYSTEM."}, {"score": 1, "techniqueID": "T1124", "comment": "T9000 gathers and beacons the system time during installation."}, {"score": 1, "techniqueID": "T1125", "comment": "T9000 uses the Skype API to record audio and video calls. It writes encrypted data to %APPDATA%\\Intel\\Skype."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by T9000", "color": "#66b1ff"}]}