[{
    "date": "March 2022",
    "title": "ATT&CKcon 3.0",
    "description": "",
    "banner_img": "/theme/images/ATTACKcon-3-Banner.png",
    "sponsors_img_list": [
        "/theme/images/attackcon3-sponsors/analyst1.png",
        "/theme/images/attackcon3-sponsors/attackiq.png",
        "/theme/images/attackcon3-sponsors/cyber-ranges.png",
        "/theme/images/attackcon3-sponsors/cyborg-security.png",
        "/theme/images/attackcon3-sponsors/kroll.png",
        "/theme/images/attackcon3-sponsors/microsoft.png",
        "/theme/images/attackcon3-sponsors/pentera.png",
        "/theme/images/attackcon3-sponsors/picus.png",
        "/theme/images/attackcon3-sponsors/trellix.jpeg",
        "/theme/images/attackcon3-sponsors/trend-micro.png"
    ],
    "presentations": [
        {
            "title": "Intelligence Failures of Lincolns Top Spies: What CTI Analysts Can Learn From the Civil War",
            "presenters": [
                {
                    "names": ["Selena Larson"],
                    "organization": "Proofpoint"
                }
            ],
            "description": "ATT&CKcon 3.0 Keynote. Read the accompanying <a href='https://medium.com/mitre-attack/intelligence-failures-of-lincolns-top-spies-what-cti-analysts-can-learn-from-the-civil-war-35be8d12884'>blog post</a> as well.",
            "video": "https://www.youtube.com/watch?v=07eaF2RVxK0&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=2",
            "slides": "https://www.slideshare.net/MITREATTACK/intelligence-failures-of-lincolns-top-spies-what-cti-analysts-can-learn-from-the-civil-war"
        },
        {
            "title": "State of the ATT&CK",
            "presenters": [
                {
                    "names": ["Adam Pennington"],
                    "organization": "MITRE ATT&CK"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=1JLZkNe085g&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=3",
            "slides": "https://www.slideshare.net/MITREATTACK/state-of-the-attck"
        },
        {
            "title": "Mapping to MITRE ATT&CK: Enhancing Operations Through the Tracking of Interactive Intrusion Campaigns.pdf",
            "presenters": [
                {
                    "names": ["Jason Wood, Justin Swisher"],
                    "organization": "CrowdStrike"
                }
            ],
            "description": "When it comes to understanding and tracking intrusion tradecraft, security teams must have the tools and processes that allow the mapping of hands-on adversary tradecraft. Doing this enables your team to both understand the adversaries and attacks you currently see and observe how these adversaries and attacks evolve over time. This session will explore how a threat hunting team uses MITRE ATT&CK to understand and categorize adversary activity. The team will demonstrate how threat hunters map ATT&CK TTPs by showcasing a recent interactive intrusion against a Linux endpoint and how the framework allowed for granular tracking of tradecraft and enhanced security operations. They will also take a look into the changes in the Linux activity they have observed over time, using the ATT&CK navigator to compare and contrast technique usage. This session will provide insights into how we use MITRE ATT&CK as a powerful resource to track intrusion tradecraft, identify adversary trends, and prepare for attacks of the future.",
            "video": "https://www.youtube.com/watch?v=uYJAoedpJkQ&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=4",
            "slides": "https://www.slideshare.net/MITREATTACK/mapping-to-mitre-attck-enhancing-operations-through-the-tracking-of-interactive-intrusion-campaignspdf"
        },
        {
            "title": "Knowledge for the masses: Storytelling with ATT&CK",
            "presenters": [
                {
                    "names": ["Ismael Valenzuela, Jose Luis Sanchez Martinez"],
                    "organization": "Trellix"
                }
            ],
            "description": "The Trellix team believes that creating and sharing compelling stories about cyber threats -with ATT&CK- is a powerful way for raising awareness and enabling actionability against cyber threats.In this talk the team will share their experiences leveraging ATT&CK to disseminate Threat knowledge to different audiences (Software Development teams, Managers, Threat detection engineers, Threat hunters, Cyber Threat Analysts, Support Engineers, upper management, etc.).They will show concrete examples and representations created with ATT&CK to describe the threats at different levels, including: 1) an Attack Path graph that shows the overall flow of the attack; 2) Tactic-specific TTP summary tables and graphs; 3) very detailed, step-by-step description of the attacker's behaviors. ",
            "video": "https://www.youtube.com/watch?v=eRHw-An9NuI&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=5",
            "slides": "https://www.slideshare.net/MITREATTACK/knowledge-for-the-masses-storytelling-with-attck"
        },
        {
            "title": "Tracking Noisy Behavior and Risk-Based Alerting with ATT&CK",
            "presenters": [
                {
                    "names": ["Haylee Mills"],
                    "organization": "Splunk"
                }
            ],
            "description": "Having ATT&CK to identify threats, prioritize data sources, and improve security posture has been a huge step forward for our industry, but how do we actualize those insights for better detection and alerting? By shifting to observations of behavior over one-to-one direct alerts, noisy datasets become valuable treasure troves with ATT&CK metadata. Additionally, we can begin to look at detection and threat hunting on behavior instead of users or systems. In this presentation, Haylee will discuss the shift in mindset and the nuts and bolts of detections that leverage this metadata in Splunk, but the concept can be applied with custom tools to any valuable security dataset.",
            "video": "https://www.youtube.com/watch?v=qqNUmfOW3gU&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=6",
            "slides": "https://www.slideshare.net/MITREATTACK/tracking-noisy-behavior-and-riskbased-alerting-with-attckpdf"
        },
        {
            "title": "ATT&CK Updates- Defensive ATT&CK",
            "presenters": [
                {
                    "names": ["Lex Crumpton"],
                    "organization": "MITRE ATT&CK"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=eBeIRYeq7SM&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=7",
            "slides": "https://www.slideshare.net/MITREATTACK/attck-updates-defensive-attck"
        },
        {
            "title": "Would you Rather Have Telemetry into 2 Attacks or 20? An Insight Into Highly Valued Data Sources",
            "presenters": [
                {
                    "names": ["Jonny Johnson, Olaf Hartong"],
                    "organization": "Red Canary and FalconForce"
                }
            ],
            "description": "As defenders, we often find ourselves wanting \"more\" data. But why? Will this new data provide a lot of value or is it for a very niche circumstance? How many attacks does it apply to? Are we leveraging previous data sources to their full capability? Within this talk, Olaf and Jonny will walk through different data sources they leverage more than most when analyzing data within environments, why they do, and what these data sources do and can provide in terms of value to a defender.",
            "video": "https://www.youtube.com/watch?v=ba2e9pWxboU&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=8",
            "slides": "https://www.slideshare.net/MITREATTACK/would-you-rather-have-telemetry-into-2-attacks-or-20-an-insight-into-highly-valued-data-sources"
        },
        {
            "title": "ATT&CK Metaverse - Exploring the Limitations of Applying ATT&CK",
            "presenters": [
                {
                    "names": ["Gert-Jan Bruggink"],
                    "organization": "Venation"
                }
            ],
            "description": "Since it's inception in 2015, the ATT&CK framework has achieved widespread adoption, with recent studies suggesting over 80 percent of companies using the framework for cyber security. Over the last seven years, a variety of use cases has been explored with different measures of success. In this presentation, Gert-Jan will explore applying the ATT&CK framework in scenario-based defense. When adopting a scenario approach, security teams collaborate to fuse their understanding of certain situations into scenarios. For example, addressing different hypotheses that can be explained to leadership and specialist teams alike. This approach requires more than \"just\" breaking down everything into tactics, techniques, and procedures. Some stakeholders might not understand that. For example, some might want to tell a good story about adversaries while others want to translate their understanding of intrusions into a sequential pattern. The objective of this talk is to explore how the granularity of the framework supports creation of scenarios, the limitations in the current approach to ATT&CK when building scenarios across different stakeholders, and addressing potential areas the \"language of ATT&CK\" can evolve towards over the next 5 years.",
            "video": "https://www.youtube.com/watch?v=-sP9wDXH3B4&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=9",
            "slides": "https://www.slideshare.net/MITREATTACK/attck-metaverse-exploring-the-limitations-of-applying-attck"
        },
        {
            "title": "It's just a jump to the left (of boom): Prioritizing detection implementation with intelligence and ATT&CK",
            "presenters": [
                {
                    "names": ["Lindsay Kaye, Scott Small"],
                    "organization": "Recorded Future"
                }
            ],
            "description": "Many organizations ask: \"Where do I start, and where do I go next\" when prioritizing implementation of behavior-based detections? We often hear \"use threat intelligence!\" but your goals must be qualified and quantified in order to properly prioritize the most relevant TTPs. A wealth of open-sourced, ATT&CK-mapped resources now exists, giving security teams greater access to both detections and red team tests they can implement, but intelligence (also aligned with ATT&CK), is essential to provide necessary context to ensure that detection efforts are focused effectively.<br>This session will discuss a new approach to the prioritization challenge, starting with an analysis of the current defensive landscape, as measured by ATT&CK coverage for more than a dozen detection repositories and technologies, and guidance on sourcing TTP intelligence. The team will then show how real-world defensive strategies can be strengthened by encompassing a full-spectrum view of threat detection, including the implementation of YARA, Sigma, and Snort in security appliances. Critically, alignment of both intelligence and defenses with ATT&CK enables defenders to move the focus of detection efforts to indications of malicious behavior before the final payload is deployed, where controls are most effective at preventing serious damage to the organization.",
            "video": "https://www.youtube.com/watch?v=pwl7L_Lh9_c&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=10",
            "slides": "https://www.slideshare.net/MITREATTACK/its-just-a-jump-to-the-left-of-boom-prioritizing-detection-implementation-with-intelligence-and-attck"
        },
        {
            "title": "ATT&CK Updates- Campaigns",
            "presenters": [
                {
                    "names": ["Matt Malone"],
                    "organization": "MITRE ATT&CK"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=yP0upd-65Yc&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=12",
            "slides": "https://www.slideshare.net/MITREATTACK/attck-updates-campaigns"
        },
        {
            "title": "Landing on Jupyter: The transformative power of data-driven storytelling for security operations",
            "presenters": [
                {
                    "names": ["Jose Barajas, Stephan Chenette"],
                    "organization": "AttackIQ"
                }
            ],
            "description": "Every cybersecurity leader wants visibility into the health of their security program. Yet teams suffer with disparate data streams - CTI teams and the SOC often use separate Excel spreadsheets, an anachronistic practice - and silos constrain their ability to operate effectively. Enter the Jupyter notebook, an open-source computational notebook that researchers use to combine code, computing output, text, and media into a single interface. In this talk, we share three stories of how organizations use Jupyter notebooks to align ATT&CK-based attack flows to the security program, generating data about detection and prevention failures, defensive gaps, and longitudinal performance. By using Jupyter notebooks in this way, teams can better leverage ATT&CK for security effectiveness. It becomes less of a bingo card and more of a strategic tool for understanding the health of the program against big tactics (I.e., lateral movement), defensive gaps (I.e., micro-segmentation), and the team's performance.",
            "video": "https://www.youtube.com/watch?v=pGBzbrLnYmM&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=13",
            "slides": "https://www.slideshare.net/MITREATTACK/landing-on-jupyter-the-transformative-power-of-datadriven-storytelling-for-security-operations"
        },
        {
            "title": "The ATT&CK Philharmonic",
            "presenters": [
                {
                    "names": ["Ivan Ninichuck, Andy Shepard"],
                    "organization": "Siemplify"
                }
            ],
            "description": "The MITRE ATT&CK framework has improved many areas within the infosec workflow. But many of these select areas are those that are relatively isolated from the tactical operations faced every day by lower or mid-tier analysts. When faced with alert fatigue and an ever-growing number of data sources, the impact of ATT&CK can become esoteric to non-existent. In this presentation experts from Siemplify propose the problem be looked at like an orchestra with its dozens of instrument types. Without a conductor to guide each section there would only be noise, but with the conductor leading, beautiful symphonies can now be played. The Siemplify team plan to show how a SOAR platform can be that conductor using the ATT&CK framework as its sheet music, and turn the constant noise into a threat intel driven security program.",
            "video": "https://www.youtube.com/watch?v=eim_AJvbbJg&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=14",
            "slides": "https://www.slideshare.net/MITREATTACK/the-attck-philharmonic"
        },
        {
            "title": "Automating the mundanity of technique IDs with ATT&CK Detections Collector",
            "presenters": [
                {
                    "names": ["Marcus LaFerrera, Ryan Kovar"],
                    "organization": "Splunk"
                }
            ],
            "description": "Since the release of MITRE ATT&CK, vendors and governmental bodies have begun mapping their security blogs, whitepapers, and threat intel reports to ATT&CK TTPs, which is incredible! Vendors have then begun mapping their detections to those mapped TTPs, which is even more awesome! What is not awesome is dissecting a piece of prose for all of the specific embedded ATT&CK technique IDs and then mapping them to your detections to determine coverage. Over the last year, the team at Splunk has spent more time doing this than they would like to admit, so they wrote a tool to do it for them and want to share it with the world.  Join the Splunk team as they tell the world about ATT&CK Detections Collector (ADC). ADC is an open-source python tool that will allow you to extract MITRE technique IDs from a third-party URLs and output them into a file. If you use Splunk, the team even maps them to their existing (previously mapped) detection corpus. They even added the ability to export them into a navigator json for fun, profit, or (at least) better visualization!",
            "video": "https://www.youtube.com/watch?v=MDl-Jqfc_kA&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=15",
            "slides": "https://www.slideshare.net/MITREATTACK/automating-the-mundanity-of-technique-ids-with-attck-detections-collector"
        },
        {
            "title": "The ATT&CK Latin American APT Playbook",
            "presenters": [
                {
                    "names": ["Santiago Pontiroli, Dmitry Bestuzhev"],
                    "organization": "Kaspersky"
                }
            ],
            "description": "Financially motivated cyber-attacks thrive in emerging Latin American markets. However, there's room for locally grown threat actors operating in the cyber espionage field as well. During the last decade, this includes but is not limited to Blind Eagle, Puppeteer, Machete, Poseidon, and others. We also saw foreign operations targeting specific assets in Latin America, still connected to certain regional sources.Since the threat actors' origin, culture, and language is often different, it's not uncommon for tactics, techniques, and procedures (TTPs) to present marked differences. As a result of our regional expertise and experience, we created MITRE's ATT&CK play-by-play mappings to help other analysts understand regional actors. If you are interested in threat intelligence and what's going on in Latin America, this presentation is for you. Our work is based only on real-world attackers and their operations, including those not publicly known, such as COVID-19 Machete's targeted campaign.",
            "video": "https://www.youtube.com/watch?v=-P2prH21_J8&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=19",
            "slides": "https://www.slideshare.net/MITREATTACK/the-attck-latin-american-apt-playbook"
        },
        {
            "title": "Mapping ATT&CK Techniques to ENGAGE Activities",
            "presenters": [
                {
                    "names": ["David Barroso"],
                    "organization": "CounterCraft"
                }
            ],
            "description": "When an adversary engages in a specific behavior, they are vulnerable to expose an unintended weakness. By looking at each ATT&CK technique, we can examine the weaknesses revealed and identify an engagement activity or activities to exploit this weakness.During the presentation we will see some real examples of how we can use different ATT&CK techniques in order to plan different adversary engagement activities.",
            "video": "https://www.youtube.com/watch?v=chzJb45UQrU&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=20",
            "slides": "https://www.slideshare.net/MITREATTACK/mapping-attck-techniques-to-engage-activities"
        },
        {
            "title": "When Insiders ATT&CK!",
            "presenters": [
                {
                    "names": ["Matt Snyder"],
                    "organization": "VMWare"
                }
            ],
            "description": "Insider threats are some of the most treacherous and every organization is susceptible: it's estimated that theft of Intellectual Property alone exceeds $600 billion a year. Armed with intimate knowledge of your organization and masked as legitimate business, often these attacks go unnoticed until it's too late and the damage is done. To make matters worse, threat actors are now trying to lure employees with the promise of large paydays to help carry out attacks. These advanced attacks require advanced solutions, and we are going to demonstrate how we are using the MITRE ATT&CK framework to proactively combat these threats. Armed with these tactics and techniques, we show you how to build intelligent detections to help secure even the toughest of environments.",
            "video": "https://www.youtube.com/watch?v=qJ3DrNAbtxg&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=21",
            "slides": "https://www.slideshare.net/MITREATTACK/when-insiders-attck"
        },
        {
            "title": "ATT&CK Updates- ATT&CK for ICS",
            "presenters": [
                {
                    "names": ["Otis Alexander"],
                    "organization": "MITRE ATT&CK"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=NDcDADDO4Sg&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=22",
            "slides": "https://www.slideshare.net/MITREATTACK/attck-updates-attck-for-ics"
        },
        {
            "title": "Exploring how Students Map Social Engineering Techniques to the ATT&CK Framework During a Real-Time Cybersecurity Exercise",
            "presenters": [
                {
                    "names": ["Aunshul Rege"],
                    "organization": "Katorah Williams"
                }
            ],
            "description": "Social engineering (SE) is a technique used by cybercriminals to psychologically manipulate individuals into disclosing sensitive information and providing unauthorized access. Penetration testers are tasked with simulating targeted attacks on a company's system to determine any weaknesses in their environment. The 2021 Summer SE Pen Test Competition allowed students to experience SE pen testing in a safe and ethical way. Student teams were \"hired\" to conduct a SE pen test on the CARE Lab (run by the authors) and their employees (the authors themselves)! Teams had to use OSINT, phishing, and vishing in real-time to target the lab, develop attack playbooks, and map the techniques to the ATT&CK framework. This talk shares the application of ATT&CK in cybersecurity education. Specifically, it (i) focuses on how students map their SE attack playbooks to the ATT&CK framework, (ii) compares/contrasts SE techniques across various student groups: 6 graduate teams, 9 undergraduate teams, and 1 high school team, and (iii) how ATT&CK can be used for SE.",
            "video": "https://www.youtube.com/watch?v=GP9beFFHnWU&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=24",
            "slides": "https://www.slideshare.net/MITREATTACK/exploring-how-students-map-social-engineering-techniques-to-the-attck-framework-during-a-realtime-cybersecurity-exercise"
        },
        {
            "title": "ATT&CKing the Red/Blue Divide",
            "presenters": [
                {
                    "names": ["Fred Frey, Jonathan Mulholland"],
                    "organization": "SnapAttack"
                }
            ],
            "description": "Atomic Red Team and Sigma are the largest open-source attack simulation and analytic projects. Many organizations utilize one or both internally for security controls validation or supplementing their detections and alerts.  Building on the work from these two great communities, we smashed (scientific-term) the attacks and analytics together and applied data science to analyze the results. We'll describe our methodology and testing framework, show the real-world MITRE ATT&CK coverage and gaps, discuss our algorithms for calculating analytic similarity, identifying log sources for a technique, and determining the best analytics to deploy that maximizes ATT&CK coverage. This project aims to: <br>- Bring a measurable testing rigor to community analytics to improve adoption <br>- Test every analytic against every attack, validating the true positive detection <br>- Understand the log sources required to detect specific attack techniques  <br>- Apply data science to identify analytic similarity (reduce community duplication) <br>- Identify gaps between the projects' analytics without attack simulations; attack simulations without detections; missing or incorrect MITRE ATT&CK labels, etc <br>- Automate the process so insights can stay up to date with new attack/analytic contributions over time  <br>- Share our analysis back to the community to improve these projects",
            "video": "https://www.youtube.com/watch?v=lxAQiq2XtEQ&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=25",
            "slides": "https://www.slideshare.net/MITREATTACK/attcking-the-redblue-divide"
        },
        {
            "title": "ATT&CK Updates- ATT&CK for mac/Linux",
            "presenters": [
                {
                    "names": ["Cat Self"],
                    "organization": "MITRE ATT&CK"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=5q7goQKBQLc&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=26",
            "slides": "https://www.slideshare.net/MITREATTACK/attck-updates-attck-for-maclinux"
        },
        {
            "title": "What is ATT&CK coverage, anyway? Breadth and depth analysis with Atomic Red Team",
            "presenters": [
                {
                    "names": ["Brian Donohue"],
                    "organization": "Red Canary"
                }
            ],
            "description": "This presentation will highlight the Atomic Red Team project's efforts to define and increase the test coverage of MITRE ATT&CK techniques. We'll describe the challenges we encountered in defining what \"coverage\" means in the context of an ATT&CK-based framework, and how to use that definition to improve an open source project that's used by a diverse audience of practitioners to satisfy an equally diverse array of needs. The audience will learn how the Atomic Red Team maintainers standardize and categorize atomic tests, perform gap analysis to achieve deep technique-level coverage and broad matrix-level coverage, and quickly fill those gaps with new tests.",
            "video": "https://www.youtube.com/watch?v=RRq8jqFY6ts&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=28",
            "slides": "https://www.slideshare.net/MITREATTACK/what-is-attck-coverage-anyway-breadth-and-depth-analysis-with-atomic-red-team"
        },
        {
            "title": "ATT&CKING Containers in The Cloud",
            "presenters": [
                {
                    "names": ["Jared Stroud"],
                    "organization": "Lacework"
                }
            ],
            "description": "Adversaries target common cloud misconfigurations in container-focused workflows for initial access. Whether this is Docker or Kubernetes environments, Lacework Labs has identified adversaries attempting to deploy malicious container images (T1610) , mine Cryptocurrency (T1496), and deploy C2 agents. Defenders new to the container space may be unaware of the built-in capabilities popular container runtime engines have that can help defend against rogue containers being deployed into their environment. Attendees will walk away with an understanding of what these attack patterns look like based on honeypot data Lacework has gathered over the past year, as well as techniques on how to defend their own container focused workloads.",
            "video": "https://www.youtube.com/watch?v=eu6Jo2OQLIo&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=29",
            "slides": "https://www.slideshare.net/MITREATTACK/attcking-contianers-in-the-cloud"
        },
        {
            "title": "Threat Modelling - It's not just for developers",
            "presenters": [
                {
                    "names": ["Tim Wadhwa-Brown"],
                    "organization": "Cisco"
                }
            ],
            "description": "The purpose of this session will be to look at how you can take public information about threat actors, vulnerabilities, and incidents and use them to build better defenses, utilizing ATT&CK along the way to align your security organization to the people and assets that matter.Stories are critical to how humans learn, so this session will leverage a story book approach to give the audience some ideas on approaches they could use. Tim will take the audience through 3 real world examples where he has leveraged ATT&CK to drive operational improvement. The premise of each story will be real, although some of the details will be apocryphal to protect the innocent.One story will focus on defending a network, one will look at adversary detection, while the final one will look at responding to an active attack and in each case, Tim will guide the audience to think about the kinds of data sources that ATT&CK tracks, that they might call upon to achieve a successful outcome.",
            "video": "https://www.youtube.com/watch?v=zBp5AUBS1gQ&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=30",
            "slides": "https://www.slideshare.net/MITREATTACK/threat-modelling-its-not-just-for-developerspdf"
        },
        {
            "title": "ATT&CK Updates- ATT&CK's Open Source",
            "presenters": [
                {
                    "names": ["Jared Ondricek"],
                    "organization": "MITRE ATT&CK"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=OdIPHKbrXOM&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=31",
            "slides": "https://www.slideshare.net/MITREATTACK/attck-updates-attcks-open-source"
        },
        {
            "title": "Projects to Impact- Operationalizing Work from the Center",
            "presenters": [
                {
                    "names": ["Ingrid Skoog"],
                    "organization": "MITRE Engenuity"
                }
            ],
            "description": "",
            "video": "https://www.youtube.com/watch?v=se2c3e4D-DE&list=PLkTApXQou_8Jo2B27kq62Md4bypcBqBAw&index=32",
            "slides": "https://www.slideshare.net/MITREATTACK/projects-to-impact-operationalizing-work-from-the-center"
        }
    ]
},{
    "date": "October 2020",
    "title": "ATT&CKcon Power Hour",
    "description": "Thank you to everyone who attended and spoke as ATT&CKcon went virtual in 2020. Broken into a series of four 1.5 hour virtual sessions, ATT&CKcon Power Hour talks have been viewed over 12,000 times. ATT&CKcon Power Hour brought us talks on areas of ATT&CK we haven't heard about before such as Cloud and Mobile as well as insights on how organizations are adapting to features such as sub-techniques. Please continue to watch and share these talks!",
    "banner_img": "/theme/images/ATTACKcon_power_hour.png",
    "presentations": [
        {
            "title": "Starting Over with Sub-Techniques: Lessons Learned Remapping Detection Analytics",
            "presenters": [{
                "names": ["Brian Donohue"],
                "organization": "Red Canary"
            }],
            "description": "<p>In early 2018, Red Canary adopted MITRE ATT&CK as the common language that they would use to categorize threats, measure detection coverage, and communicate about malicious behaviors. In the intervening years, they’ve relied on the framework to develop open source tools like Atomic Red Team and help security teams prioritize their defensive efforts with blogs and our annual Threat Detection Report. </p><p>In early 2020, MITRE announced that ATT&CK would be expanding its original taxonomy of tactics and techniques to include sub-techniques. In the months that followed MITRE's announcement, Red Canary’s research, intelligence, and detection engineering teams painstakingly remapped their library of thousands of behavioral analytics to sub-techniques. In doing so, they improved their correlational logic, experimented with the idea of conditional technique mapping, and, unfortunately, rendered the 2020 Threat Detection Report out-of-date. </p><p>In this talk from the MITRE ATT&CKcon Power Hour session on October 9, 2020, Brian discusses how refactoring for sub-techniques offered us the opportunity to apply all the lessons learned in more than two years of operationalizing ATT&CK. He also explores how Red Canary has remodeled its ATT&CK mapping to allow for added flexibility and human input and shows what happens when the Red Canary applied their new sub-technique mappings to the 2020 Threat Detection Report.</p>",
            "video": "https://www.youtube.com/watch?v=z2R0oc70lc8&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=19",
            "slides": "https://www.slideshare.net/attackcon2018/starting-over-with-subtechniques"
        },
        {
            "title": "Using MITRE PRE-ATT&CK and ATT&CK In Cybercrime Education and Research",
            "presenters": [{
                "names": ["Aunshul Rege", "Rachel Bleiman"],
                "organization": "Temple University"
            }],
            "description": "This presentation from the MITRE ATT&CKcon Power Hour session on October 9, 2020, explores the application of the MITRE ATT&CK and PRE-ATT&CK matrices in cybercrime education and research. Specifically, Rege and Bleiman demonstrate the mapping of the PRE-ATT&CK matrix to social engineering case studies as an experiential learning project in an upper-level cybercrime liberal arts course. It thus allows students to understand the alignment process of threat intelligence to the PRE-ATT&CK framework and also learn about its usefulness/limitations. The talk also discusses the mapping of the ATT&CK matrix, tactics, techniques, software, and groups for two cybercrime datasets created by collating publicly disclosed incidents: (i) critical infrastructure ransomware (CIRW) incidents, and (ii) social engineering (SE) incidents. For the CIRW dataset, 39% of the strains mapped onto the ATT&CK software. For the SE dataset, 49% of the groups and 65% of the techniques map on to the MITRE framework. This helps the researchers identify the framework's usefulness/limitations and also helps our datasets connect to richer information that may not otherwise be available in the publicly disclosed incidents.",
            "video": "https://www.youtube.com/watch?v=WJz6zXJ0ABs&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=20",
            "slides": "https://www.slideshare.net/attackcon2018/using-mitre-preattck-and-attck-in-cybercrime-education-and-research"
        },
        {
            "title": "Without Attacking: Transforming Adversary Emulations Into A Data Analysis Question",
            "presenters": [{
                "names": ["Matan Hart"],
                "organization": "Cymptom"
            }],
            "description": "Adversary emulation is commonly used to validate security controls and is considered one of the most popular use-cases for the ATT&CK framework. However, emulating adversary TTPs on production environments is often very limited in testing scope and frequency, and such practice may cause unwanted business disruption. In this talk from the MITRE ATT&CKcon Power Hour session on October 9, 2020, Hart presents a different approach to testing controls against ATT&CK. He demonstrates how it is possible to provide data-based methods to evaluate the exploitability of ATT&CK techniques by gathering information from the network, endpoint, and services; this unique approach does not emulate any sort of malicious action, thus reducing the potential of causing business disruption to the minimum. Hart also outlines a new open-source guideline based on ATT&CK mitigations, that security teams can use to assess their security posture non-intrusively and at scale.",
            "video": "https://www.youtube.com/watch?v=07YoerY050I&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=21",
            "slides": "https://www.slideshare.net/attackcon2018/transforming-adversary-emulation-into-a-data-analysis-question"
        },
        {
            "title": "Detecting ATT&CK's With Dynamic Thresholds Using Tukey’s Test and Azure Sentinel",
            "presenters": [{
                "names": ["Jair Santanna"],
                "organization": "Northwave"
            }],
            "description": "How do you detect abnormal activities based on frequency, for example, a suspicious number of sign-ins (leading to a brute force attack), suspicious amount of data transfer (leading to a data exfiltration), and malicious scanning or discovering activities? Usually, you would count the frequency of the activity and if this number exceeds a pre-defined threshold then you would consider it abnormal/attack. The problem here is the definition of this threshold (and the reduction of false positives and negatives). Some practitioners set this threshold to 5, others to 10, and in some situations, to 30 or even higher. The remaining question is how to obtain a statistically sounding threshold? In this talk from the MITRE ATT&CKcon Power Hour session on October 9, 2020, Jair Santanna answers this question by using a half-century-old statistical method to define such a dynamic threshold (John Tukey’s \"honestly significant difference\"-HSD). Northwave has implemented this method in a production environment over several ATT&CK techniques using the Security Information and Event Management (SIEM) from Microsoft, Azure Sentinel. Northwave’s scripts are publicly available. In this presentation, Santanna sheds light on dynamic thresholds for security monitoring and discuss how to move forward with this challenging old problem.",
            "video": "https://www.youtube.com/watch?v=elZ7RST51zs&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=22"
        },
        {
            "title": "Ta505 - A Study of High End Big Game Hunting In 2020",
            "presenters": [{
                "names": ["Brandon Levene"],
                "organization": "Google"
            }],
            "description": "Opportunistically targeted ransomware deployments, aka Big Game Hunting (BGH), have caused a distinct disruption in the mechanics of monetizing crimeware compromises. This strategy has become the “end game” for the majority of organized cybercrime organizations, and one effect of this shift is the increased emphasis on enterprise-level targets. In this talk from the MITRE ATT&CKCon Power Hour session on October 9, 2020,  Levene walks us through research about how a specific BGH threat actor pursues entry points, gains its foothold, pivots, and deploys payloads to maximize their financial gains with minimal effort - and infrastructure! You’ll walk away with an understanding of the latest BGH TTPs seen in enterprise environments, and how they map to the ATT&CK framework so you can build this research into your threat detection strategy and enhance your defenses.",
            "video": "https://www.youtube.com/watch?v=CNTAK54JxrI&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=23",
            "slides": "https://www.slideshare.net/attackcon2018/ta505-a-study-of-high-end-big-game-hunting-in-2020"
        },
        {
            "title": "What’s New with ATT&CK for Cloud?",
            "presenters": [{
                "names": ["Jen Burns"],
                "organization": "MITRE"
            }],
            "description": "Jen Burns is a Lead Cybersecurity Engineer at MITRE and the Lead for MITRE ATT&CK for Cloud. She’s also a red team developer and lead for ATT&CK Evaluations, using her skills in software engineering and adversary emulation. Previously, she was a tech lead at HubSpot on the Infrastructure Security team where she focused on red teaming and building detections in the cloud environment. This presentation is from the MITRE ATT&Ckcon Power Hour session held on October 9, 2020.",
            "video": "https://www.youtube.com/watch?v=a-xs5VqlcKI&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=24",
            "slides": "https://www.slideshare.net/attackcon2018/whats-new-with-attck-for-cloud"
        },
        {
            "title": "Mapping The Eventbot Mobile Banking Trojan With MITRE ATT&CK For Mobile",
            "presenters": [{
                "names": ["Allie Mellen"],
                "organization": "Cybereason"
            }],
            "description": "<p>In this presentation from the MITRE ATT&CKcon Power Hour session on November 12, Allie discusses how the Cybereason research team uses both MITRE ATT&CK and MITRE ATT&CK for Mobile to map and communicate new malware to the larger security community. Teams use the MITRE ATT&CK framework to share techniques, tactics, and procedures with their team and the community at large. This knowledge base has been incredibly beneficial for the development of specific threat models and methodologies in the private sector, in government, and in the cybersecurity product and service community. Many of these uses have centered around traditional endpoints like laptops and workstations. However, the MITRE ATT&CK team has also created a cutting-edge portion of their framework: MITRE ATT&CK for Mobile. </p><p>One of the most recent pieces of malware they have found is EventBot, a mobile banking trojan that targets Android devices and the financial services applications on them, including popular apps like Paypal Business, Revolut, Barclays, UniCredit, CapitalOne UK, HSBC UK, Santander UK, TransferWise, Coinbase, paysafecard, and many more. In this talk, learn about this specific attack, intended targets, a timeline of the attack, and the MITRE ATT&CK for Mobile mapping. Learn why the Cybereason team map to MITRE ATT&CK and MITRE ATT&CK for Mobile and what benefits it has given them and their interactions with the community.</p>",
            "video": "https://www.youtube.com/watch?v=70pR0Er2s5c&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=13",
            "slides": "https://www.slideshare.net/attackcon2018/mapping-the-eventbot-mobile-banking-trojan-with-mitre-attack-for-mobile"
        },
        {
            "title": "ATT&CKing The Cloud: Hopping Between The Matrices",
            "presenters": [{
                "names": ["Anthony Randazzo"],
                "organization": "Expel"
            }],
            "description": "The team at Expel has been migrating to the cloud for the last 10 years, but as usual, security has lagged behind. Which means we don't have a comprehensive detection and response framework for cloud like we do with the Enterprise ATT&CK matrix. Cloud has evolved into a complex beast as technologies and concepts - like Infrastructure As Code, Containers, Kubernetes and so forth - have emerged. These new attack surfaces have been added that introduce additional challenges to detection and response in our cloud environments. We don't know what we don't know about attack life cycles in the cloud. In this presentation from the MITRE ATT&CKcon Power Hour session on November 12, 2020, Anthony shares some interesting lessons learned so far when it comes to finding bad guys in the cloud.",
            "video": "https://www.youtube.com/watch?v=f1E6bquRxlA&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=14",
            "slides": "https://www.slideshare.net/attackcon2018/attacking-the-cloud-hopping-between-the-matrices"
        },
        {
            "title": "Building Detections For Cloud With KQL and ATT&CK",
            "presenters": [{
                "names": ["Nitya Garg"],
                "organization": "LinkedIn"
            }],
            "description": "Writing and deploying custom detections with high efficacy is one of the most important goals of any SIRT team. It involves multiple stages, starting from developing a detection hypothesis, to writing the detection query, and validating it against a simulated true positive scenario. With ever-changing threat landscape and hybrid cloud environments, the process can be intensive and overwhelming. In this presentation from the MITRE ATT&CKcon Power Hour session on November 12, 2020, Nitya talks about how we can leverage MITRE ATT&CK to not only simplify detection engineering but make it more efficient. The presentation will also include a demo on how to build a detection query, written in KQL(Kusto Query Languauge), for an ATT&CK technique from MITRE Cloud Matrix.",
            "video": "https://www.youtube.com/watch?v=dEORNlCS7xc&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=15"
        },
        {
            "title": "What’s a MITRE with Your Security?",
            "presenters": [{
                "names": ["Matt Snyder"],
                "organization": "VMWare"
            }],
            "description": "The market for Security products is flooded with vendors offering all sorts of solutions, and organizations are spending a record amount of money defending their environments. Nevertheless, an increasing number of breaches are reported each year, resulting in organizations spending millions of dollars to remediate them. The Security industry responds with more products, all offering to stop the next breach, and the cycle continues. In this presentation from the MITRE ATT&CKcon Power Hour session on November 12, 2020, Matt discusses what VMware is doing internally to address this fundamental flaw in the Security industry and how they are leveraging the MITRE ATT&CK framework to reshape how we think about security.",
            "video": "https://www.youtube.com/watch?v=lBVKLTbR12k&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=16",
            "slides": "https://www.slideshare.net/attackcon2018/whats-a-mitre-with-your-security"
        },
        {
            "title": "Putting the PRE into ATT&CK",
            "presenters": [{
                "names": ["Jamie Williams", "Mike Hartley"],
                "organization": "MITRE"
            }],
            "description": "In this presentation from the MITRE ATT&CKcon Power Hour session on November 12, 2020 Jamie Williams and Mike Hartley from MITRE discuss the process for merging PRE-ATT&CK and adding two new tactics to Enterprise ATT&CK - Reconnaissance and Resource Development.",
            "video": "https://www.youtube.com/watch?v=M_uG_hlmTcA&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=17",
            "slides": "https://www.slideshare.net/attackcon2018/putting-the-pre-into-attack"
        },
        {
            "title": "Helping Small Companies Leverage CTI with an Open Source Threat Mapping",
            "presenters": [{
                "names": ["Valentina Palacín"],
                "organization": "Senior Cyber Threat Intelligence Analyst"
            }],
            "description": "<p>No one can deny the tremendous impact that ATT&CK had on the cybersecurity industry, nor the usefulness of having a good Threat Library at your disposal. But the question Valentina gets asked over and over by people from small companies is always the same: “How could I leverage threat intelligence using ATT&CK with limited time and resources?” And so far, there hasn't been a good answer. That’s why she decided to come up with the Threat Mapping Catalogue (TMC), a tool that combines the power of the mappings already available in the ATT&CK website, TRAM and the ATT&CK Navigator, to better process, consume and incorporate new mappings while organizing them around different categories.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on December 11, 2020.</p>",
            "video": "https://www.youtube.com/watch?v=3R3cwP3yFK4&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=7",
            "slides": "https://www.slideshare.net/attackcon2018/helping-small-companies-leverage-cti-with-an-open-source-threat-mapping"
        },
        {
            "title": "From Theory to Practice: How My ATT&CK Perspectives Have Changed",
            "presenters": [{
                "names": ["Katie Nickels"],
                "organization": "Red Canary"
            }],
            "description": "<p>Good analysts (and good human beings) change their minds based on new information. In this presentation, Katie will share how her perspectives on ATT&CK have changed since moving from ATT&CK team member to ATT&CK end-user. She will discuss how her ideas about coverage, procedures, and detection creation have evolved and why those perspectives matter. Katie will also share practical examples from observed threats to help explain the nuances of her perspectives. Attendees should expect to leave this presentation with a better understanding of how to handle challenges they’re likely to face when navigating their own ATT&CK journey.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on December 11, 2020.</p>",
            "video": "https://www.youtube.com/watch?v=IWA0T-GpQDk&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=8",
            "slides": "https://www.slideshare.net/attackcon2018/from-theory-to-practice-how-my-attack-perspectives-have-changed"
        },
        {
            "title": "Sharpening Your Threat Hunting Program with ATT&CK Framework",
            "presenters": [{
                "names": ["Hieu Tran"],
                "organization": "FPT Cybersecurity Division"
            }],
            "description": "<p>No matter how sophisticated and thorough your security precautions may be, you cannot assume your security measures are impenetrable. This is why you need a threat hunting program in place. But how can we implement a proper threat hunting program and run it efficiently? In this talk, we will uncover how to sharpen your threat hunting strategy by leveraging ATT&CK. Ultimately, we’ll be demonstrating how effectively employing the hunting methodology in the real-world battlefield, fighting against well-known cyber espionage actors who strongly focus on Southeast Asian countries like Vietnam, the Philippines, Laos, and Cambodia.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on December 11, 2020.</p>",
            "video": "https://www.youtube.com/watch?v=9nUNuwiN52s&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=9",
            "slides": "https://www.slideshare.net/attackcon2018/sharpening-your-threathunting-program-with-attack-framework"
        },
        {
            "title": "Using ATT&CK To Create Cyber DBTs For Nuclear Power Plants",
            "presenters": [{
                "names": ["Jacob Benjamin"],
                "organization": "Dragos"
            }],
            "description": "<p>Design Basis Threat (DBT) is a concept introduced by the Nuclear Regulatory Commission (NRC). It is a profile of the type, composition, and capabilities of an adversary. DBT is the key input nuclear power plants use for the design of systems against acts of radiological sabotage and theft of special nuclear material. The NRC expects its licensees, nuclear power plants, to demonstrate that they can defend against the DBT. Currently, cyber is included in DBTs simply as a prescribed list of IT centric security controls. Using MITRE’s ATT&CK framework, Cyber DBTs can be created that are specific to the facility, its material, or adversary activities.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on December 11, 2020.</p>",
            "video": "https://www.youtube.com/watch?v=xbnSuKTMkKo&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=10",
            "slides": "https://www.slideshare.net/attackcon2018/using-attack-to-create-cyber-dbts-for-nuclear-power-plants"
        },
        {
            "title": "What’s New with ATT&CK for ICS?",
            "presenters": [{
                "names": ["Otis Alexander"],
                "organization": "MITRE"
            }],
            "description": "<p>Otis Alexander is a Principal Cyber Security Engineer at the MITRE Corporation and has worked in the areas of security engineering and research, analytic development, and adversary modeling and emulation. Otis is a co-creator of ATT&CK for ICS and has been leading the project since its inception. He also leads an effort to bring MITRE ATT&CK Evaluations to ICS security vendors providing anomaly and threat detection solutions. He advocates for network and host visibility in operational technology environments to increase the situational awareness of defenders.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on December 11, 2020.</p>",
            "video": "https://www.youtube.com/watch?v=_GZwY-9QyFk&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=11",
            "slides": "https://www.slideshare.net/attackcon2018/whats-new-with-attack-for-ics"
        },
        {
            "title": "Measure What Matters: How to Use ATT&CK to Do the Right Things in the Right Order",
            "presenters": [{
                "names": ["Daniel Wyleczuk-Stern"],
                "organization": "Snowflake"
            }],
            "description": "<p>Cyber security is inherently a function of risk management. Risk management is the identification, evaluation, and prioritization of risks followed by the effort to reduce those risks in a coordinated and economical manner (thanks wikipedia!). In this talk, Daniel will be going over some strategies for measuring and prioritizing your cyber risks using MITRE ATT&CK . He'll discuss some lessons learned in atomic testing of techniques vs attack chaining as well as what to measure and how to make decisions with that data.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on January 14, 2021.</p>",
            "video": "https://www.youtube.com/watch?v=XpuAnF5TLVA&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=2",
            "slides": "https://www.slideshare.net/attackcon2018/measure-what-matters-how-to-use-mitre-attack-to-do-the-right-things-in-the-right-order"
        },
        {
            "title": "ATT&CKers Think in Graphs",
            "presenters": [{
                "names": ["Valentine Mairet"],
                "organization": "McAfee"
            }],
            "description": "<p>The MITRE ATT&CK  framework is the industry standard to dissect cyberattacks into used techniques. At McAfee, all attack information is disseminated into different categories, including ATT&CK techniques. What results from this exercise is an extensive repository of techniques used in cyberattacks that goes back many years. Much can be learned from looking at historical attack data, but how can we piece all this information together to identify new relationships between threats and attacks? In her recent efforts, Valentine has embraced analyzing ATT&CK data in graphical representations. One lesson learned is that it is not just about merely mapping out attacks and techniques used into graphs, but the strength lies in applying different algorithms to answer specific questions. In this presentation, Valentine will showcase the results and techniques obtained from her research journey using graph and graph algorithms.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on January 14, 2021.</p>",
            "video": "https://www.youtube.com/watch?v=2MBcGMSBC-U&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=3",
            "slides": "https://www.slideshare.net/attackcon2018/attackers-think-in-graphs-building-graphs-for-threat-intelligence"
        },
        {
            "title": "ATT&CK-Onomics: Exploring the Economics Behind Techniques Used By Adversaries",
            "presenters": [{
                "names": ["Gert-Jan Bruggink"],
                "organization": "FalconForce"
            }],
            "description": "<p>Adversaries are humans as well. They have objectives, deadlines and resources for programming. </p><p>In a sense, very similar to corporations grounded in the economics of effort vs time vs results. Now understanding techniques is one thing, taking it a step further and understanding what the economic impact is of using certain techniques is another. Developing tools takes time. For example, developing a custom process injection module might take days or weeks to develop, where using an open source tool could prevent extensive development costs incurred. </p><p>This talk explores the economic considerations for defending against techniques used by adversaries. It explores fundamental considerations all referenced to MITRE’s ATT&CK  framework. The objective of this talk is to inspire defensive strategies designed to impact cost incurred by adversaries to perform compromises.</p><p>This talk is from the MITRE ATT&CKcon Power Hour session held on January 14, 2021.</p>",
            "video": "https://www.youtube.com/watch?v=gmqs10b97jw&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=4",
            "slides": "https://www.slideshare.net/attackcon2018/attackonomics-attacking-the-economics-behind-techniques-used-by-adversaries"
        },
        {
            "title": "State of the ATT&CK ",
            "presenters": [{
                "names": ["Adam Pennington"],
                "organization": "MITRE"
            }],
            "description": "In this presentation from the MITRE ATT&CKcon Power Hour held on January 14, 2021, MITRE ATT&CK lead Adam Pennington gives an update on the current and future state of the MITRE ATT&CK framework.",
            "video": "https://www.youtube.com/watch?v=USDHmKiLNJM&list=PLkTApXQou_8KKl3fOIPKD_9pNpmSe1TKu&index=5",
            "slides": "https://www.slideshare.net/attackcon2018/state-of-the-attack"
        }
    ]
}, {
    "date": "October 2019",
    "title": "ATT&CKcon 2.0",
    "banner_img": "/theme/images/attackcon2-banner.png",
    "sponsors_img_list": [
        "/theme/images/attackcon2-sponsors/ATTACKIQ.png",
        "/theme/images/attackcon2-sponsors/CISCO.png",
        "/theme/images/attackcon2-sponsors/CrowdstrikeLogo.png",
        "/theme/images/attackcon2-sponsors/Cybereason.png",
        "/theme/images/attackcon2-sponsors/Digital-Shadows.png",
        "/theme/images/attackcon2-sponsors/Endgame_Logo.png",
        "/theme/images/attackcon2-sponsors/McAfee.png",
        "/theme/images/attackcon2-sponsors/Microsoft.png",
        "/theme/images/attackcon2-sponsors/Praetorian-logo.png",
        "/theme/images/attackcon2-sponsors/Red_Canary.png",
        "/theme/images/attackcon2-sponsors/SafeBreachLogo.png",
        "/theme/images/attackcon2-sponsors/Syncurity-Logo.png",
        "/theme/images/attackcon2-sponsors/Sycthe-logo.png",
        "/theme/images/attackcon2-sponsors/TREND-Micro.png",
        "/theme/images/attackcon2-sponsors/Threat_Quotient.png",
        "/theme/images/attackcon2-sponsors/VMRAY.png",
        "/theme/images/attackcon2-sponsors/XMCyberv2.png"
    ],
    "presentations": [
        {
            "title": "Welcome",
            "presenters": [{
                "names": ["Katie Nickels"],
                "organization": "MITRE"
            }],
            "description": "ATT&CK Threat Intelligence Lead Katie Nickels welcomes attendees and introduces the members of the ATT&CK team.",
            "video": "https://youtu.be/Xkzv53j39ug?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk"
        },
        {
            "title": "The Friends We Made Along the Way, Keynote Address",
            "presenters": [{
                "names": ["Toni Gidwani"],
                "organization": "Google"
            }],
            "description": "In the keynote from ATT&CKcon 2.0, Toni Gidwani from Google’s Threat Analysis Group presents \"The Friends We Made Along the Way.\" The talk focuses on the purpose of intelligence, to create a decision advantage, and the partnerships that are necessary to achieve that purpose.",
            "video": "https://youtu.be/ba5jh8uhTBU?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-keynote-address-the-friends-we-made-along-the-way-toni-gidwani-google"
        }, {
            "title": "State of the ATT&CK",
            "presenters": [{
                "names": ["Blake Strom"],
                "organization": "MITRE"
            }],
            "description": "MITRE ATT&CK Lead Blake Strom updates the community on what’s new in ATT&CK since ATT&CKcon 2018 and some of what to expect in the coming year. This talk includes details on ATT&CK for Cloud, the new Impact Tactic, structured mitigations, and the upcoming shift to sub-techniques.",
            "video": "https://youtu.be/qAPC4NVJvrI?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-state-of-the-attck-blake-strom-mitre-193680470"
        }, {
            "title": "Using Threat Intelligence to Focus ATT&CK Activities",
            "presenters": [{
                "names": ["David Westin", "Andy Kettell"],
                "organization": "Nationwide"
            }],
            "description": "In October 2018, Nationwide began its MITRE ATT&CK journey. Nationwide looked at a number of different approaches to getting started, but it wasn’t until they prioritized efforts based on threat actors likely to target the finance/insurance industry that things started to click. Ultimately, Nationwide focused on 27 high concern threat actors targeting their industry, reducing the overall number of techniques from 240+ to 91. With this manageable chunk of techniques, Nationwide was able to test, analyze, and provide recommendations for improving its detection and mitigation capabilities. Nationwide is continuing to keep threat actor focus at the heart of its ATT&CK efforts, leading to prioritization of remediation actions, integration into penetration testing, and selection of security tools.",
            "video": "https://youtu.be/V--wxuSEMD0?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-using-threat-intelligence-to-focus-attck-activities-david-westin-and-andy-kettell-nationwide"
        }, {
            "title": "Prioritizing ATT&CK Informed Defenses the CIS Way",
            "presenters": [{
                "names": ["Philippe Langlois"],
                "organization": "Verizon DBIR"
            }, {
                "names": ["Joshua Franklin"],
                "organization": "Center for Internet Security"
            }],
            "description": "In a world of limited resources, organizations have to be strategic and meticulous in their planning and selection of security controls and the MITRE ATT&CK model has become an important piece for categorizing and understanding adversary techniques and contextualizing our own defenses. However, there still underlies a difficult question, where should organizations start and how should they prioritize their cybersecurity efforts? Join CIS as we explore our attempt to tackle this problem through the use of our community, content and real-world threat data collected as part of the Multi-State Information Sharing and Analysis Center (MS-ISAC). Participants should look forward to learning how to prioritize their security efforts and leverage the process for their own data and threats.",
            "video": "https://youtu.be/pHUnuNb6gGs?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-prioritizing-attck-informed-defenses-the-cis-way-philippe-langlois-verizon-and-joshua-franklin-cis"
        }, {
            "title": "Alertable Techniques for Linux using ATT&CK",
            "presenters": [{
                "names": ["Tony Lambert"],
                "organization": "Red Canary"
            }],
            "description": "Community members continually ask, should I have detection capabilities across every technique in ATT&CK? This question inevitably leads to the same conclusion that not every technique is alertable and not all of them provide the same value for immediate detection. In this session we’ll discuss the concept of alertable detections using Linux ATT&CK techniques as a case study. We’ll introduce decision criteria we’ve learned through experience to illustrate the challenges, and we’ll recommend specific techniques that work well with an alert-driven workflow.",
            "video": "https://youtu.be/7X6Pjtx4Y8M?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-alertable-techniques-for-linux-using-attck-tony-lambert-red-canary-193702628"
        }, {
            "title": "ATT&CK Updates – TRAM",
            "presenters": [{
                "names": ["Jackie Lasky", "Sarah Yoder"],
                "organization": "MITRE"
            }],
            "description": "Updates from the ATT&CK Team's very own Jackie Lasky and Sarah Yoder covering Threat Report ATT&CK Mapping (TRAM).",
            "video": "https://youtu.be/jVkMd9mAE-U?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-updates-tram-jackie-lasky-and-sarah-yoder-mitre-193677940"
        }, {
            "title": "Raiders of the MITRE Framework: How to Build Your Own Threat Library",
            "presenters": [{
                "names": ["Valentina Palacin", "Ruth Esmeralda Barbacil"],
                "organization": "Deloitte"
            }],
            "description": "It's the year 2019 and the internet has been around long enough to be filled with what seems to be \"ancient\" data. Digging through, classifying and analyzing everything sometimes makes you feel a lot like Indiana Jones searching for the right clues in a moving puzzle. But how could you move through the caves without getting buried under piles of data rubble? How might anyone revisit and study the data from the past to transform it into actionable information for the present? In this talk we are going to show you how a threat intel Indiana Jones analyst should tackle these issues in order to find the treasure of the Threat Library. We will show you how we used the MITRE ATT&CK Framework as our book of secrets for turning dusty old Internet artifacts into a library of actionable Threat Intelligence.",
            "video": "https://youtu.be/AsSAsBdkns0?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-raiders-of-the-mitre-framework-how-to-build-your-own-threat-library-valentina-palacin-and-ruth-esmerelda-barbacil-deloitte"
        }, {
            "title": "Climbing the ATT&CK Ladder: How a Threat Hunting Team Has Upgraded Its Use of ATT&CK",
            "presenters": [{
                "names": ["Karl Scheuerman", "Piotr Wojtyla"],
                "organization": "CrowdStrike"
            }],
            "description": "CrowdStrike’s OverWatch threat hunting team has continued to mature in its use of the ATT&CK framework to categorize and track targeted adversary behavior. This presentation will build on <a href='https://www.youtube.com/watch?v=Rg64nPqqs8s'>our talk from last year’s ATT&CKcon</a>, where we shared tactic/technique trends and unique examples observed in the wild. Since that time, we have taken a number of steps to enhance our usage of ATT&CK, including:</p><ul class='card-text'><li>Mapping of hunting leads to ATT&CK techniques</li><li>Based on that mapping, auto-tagging techniques used in any given intrusion observed in our data set</li><li>For that intrusion, automatically extracting process data to easily create tables of TTP details (“ATT&CK Sightings”)</li><li>Supplementing automated ATT&CK technique tagging by human analyst reviews</li><li>Leveraging MISP’s API to build ATT&CK heat maps with an array of filters on demand</li></ul><p class='card-text'>By using practices like those outlined above, we have been able to continue building what is likely the most comprehensive and detailed library of targeted intrusion data from the wild that is mapped to ATT&CK. As such, the presentation will also share significant trends and techniques from the intrusions we’ve analyzed over the past year.",
            "video": "https://youtu.be/hAsKp43AZmM?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk"
        }, {
            "title": "From Susceptible to ATT&CK: A Threat Hunting Story",
            "presenters": [{
                "names": ["Chris Thayer"],
                "organization": "Mastercard"
            }],
            "description": "The story of one man's crusade to convince the Senior Management of a fortune 500 company that security resources were needed beyond the perimeter, and the role ATT&CK played in those decisions. This talk documents the creation and persuasion required to create a successful threat hunting program at an enterprise level, and how the Mitre ATT&CK framework made this possible for one investigator, in his spare time, to prove the program's worth to senior management within 1 year of creation.",
            "video": "https://youtu.be/bWB6qWoFT_M?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-from-susceptible-to-attck-a-threat-hunting-story-chris-thayer-mastercard-193701967"
        }, {
            "title": "ATT&CK Updates – Sightings",
            "presenters": [{
                "names": ["John Wunder"],
                "organization": "MITRE"
            }],
            "description": "Updates from the ATT&CK Team's very own John Wunder covering ATT&CK Sightings.",
            "video": "https://youtu.be/OKx9f7QrFBQ?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-updates-sightings-john-wunder-mitre-193678381"
        }, {
            "title": "Zeek-based ATT&CK Metrics & Gap Analysis",
            "presenters": [{
                "names": ["Allan Thomson"],
                "organization": "LookingGlass Cyber Solutions"
            }],
            "description": "Today many organizations are using Bro (newly named Zeek) for network security monitor as it provides a powerful network analysis framework. This presentation will describe how to leverage Zeek to report on ATT&CK TTPs, raw events and other detectable activities. Key take-aways include how to report on sightings and occurrences of ATT&CK TTPs and events providing both metrics and gap analysis to inform security operations teams on where their defense may require improvement.",
            "video": "https://youtu.be/roO5ZMxYDRM?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-zeekbased-attck-metrics-and-gap-analysis-allan-thomson-looklingglass-cyber-solutions"
        }, {
            "title": "attckr: A Toolkit for Analysis & Visualization of ATT&CK Incident Data for Service Providers & Organizations",
            "presenters": [{
                "names": ["Bob Rudis"],
                "organization": "Rapid7"
            }],
            "description": "The ATT&CK framework provides a standardized way for organizations to record and share attacker techniques used at each stage in attacker campaigns. Having and sharing this discrete, normalized attacker behavior is great, but these normalized bundles of incident events can also be used to identify areas of improvement in both incident response teams as well as by vendors who provide tools/solutions to triage and manage incidents.</p><p class='card-text'>This talk will introduce {attckr}: an R package and application that provides programmatic, command-line, and interactive tools to analyze and visualize incident ATT&CK metrics. Attendees will see real-life (i.e. using real, anonymized incident data) examples of how to look across an ATT&CK incident corpus to identify trends (or outliers), support the development of ATT&CK incident baseline metrics, and develop reports and visualizations to assist in communicating operational performance, threat event frequency & type distributions for risk analysis, and identification of strengths and weaknesses in detection capability.",
            "video": "https://www.youtube.com/watch?v=iayII8CCGUI&list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&index=18&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attckr-a-toolkit-for-analysis-and-visualization-of-attck-incident-data-for-service-providers-and-organizations-bob-rudis-rapid7"
        }, {
            "title": "MITRE ATT&CK Assessment from a Data Perspective",
            "presenters": [{
                "names": ["Olaf Hartong"],
                "organization": "Deloitte"
            }],
            "description": "MITRE ATT&CK has quickly become the industry standard for referencing techniques. All though the framework is a great and valuable asset it is still lacking actionable detail on may levels to most people. I've bridged that gap by building a relatively simple assessment toolkit to visualize your potential coverage from the data already present in your environment, your mitigative measures and your detection content. The toolkit will help you focus your efforts based on your data and your goal.",
            "video": "https://youtu.be/vTvUrY7jE5k?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-coverage-assessment-from-a-data-perspective-olaf-hartong-deloitte-193702186"
        }, {
            "title": "Threat-Informed Defense: Where do we go from here?",
            "presenters": [{
                "names": ["Richard Struse"],
                "organization": "MITRE"
            }],
            "description": "Richard Struse explores the concept of a threat-informed defense and talks about ways of moving the cyber security community forward.",
            "video": "https://youtu.be/IKogtrsN214?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-threat-informed-defense-where-do-we-go-from-here-richard-struse-mitre"
        }, {
            "title": "AMITT: ATT&CK-based Standards for Misinformation Threat Sharing",
            "presenters": [{
                "names": ["Sara-Jayne Terp", "John Gray"],
                "organization": "Credibility Coalition MisinfoSec Working Group"
            }],
            "description": "State actors, private influence operators and grassroots groups are exploiting the openness and reach of the Internet to manipulate populations at a distance. They are extending a decades-long struggle for “hearts and minds” via propaganda, influence operations and information warfare, often in the form of coordinated incidents that are part of longer-timescale narrative-based campaigns.</p><p class='card-text'>The Credibility Coalition is an interdisciplinary community committed to addressing the proliferation and amplification of misinformation online, through transparent and collaborative research. Its MisinfoSec working group develops information security-based standards to promote a more formal and rigorous treatment of 1) detecting misinformation-based attacks and 2) devising methods to protect against misinformation-based attacks. Specifically, we have adapted and extended frameworks used to describe information security incidents, for use in ISACs, ISAOs and other groups sharing misinformation threats and responses.</p><p class='card-text'>In this talk, we discuss misinformation and why stage-based frameworks like ATT&CK are appropriate for it. We describe the AMITT (Adversarial Misinformation and Influence Tactics and Techniques) misinformation response framework and its roots in and deliberate compatibility with ATT&CK, its creation, relationships with other models, its components (including ways, means, and ends to achieve influence goals) and potential uses.",
            "video": "https://youtu.be/vIxqd0Qt_D8?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-amitt-attckbased-standards-for-misinformation-threat-sharing-sara-terp-and-john-gray-credibility-coalition-193687162"
        }, {
            "title": "Flashback with ATT&CK: Exploring Malware History with ATT&CK (2003-2018)",
            "presenters": [{
                "names": ["Kris Oosthoek"],
                "organization": "Delft University of Technology"
            }],
            "description": "Attackers keep innovating their TTPs to circumvent established defenses, so gaining insight into attacker innovation is fundamental. Our Twitter feeds are saturated with helpful reports daily, but how does this relate to trends and developments within the threat ecosystem as a whole? Take a step back, relax and get an ATT&CK-based overview of 15 years TTP evolution to inform your defense.</p><p class='card-text'>This presentation will discuss ATT&CK techniques found in 950+ unique Windows malware families as part of an academic research project. With the malware harvested from an unbiased and reputable source, a representative view on 15 years of evolution in the malware field is ensured. For each ATT&CK tactic, the talk provides insight into trends and shifts in real-world adversary behavior. It will also highlight how a malware analysis automation pipeline can introduce biases into your CTI and based on that, best practices on how ATT&CK can be used to ensure CTI accuracy. This entertaining presentation provides practical takeaways that inform and help prioritize your threat defense.",
            "video": "https://youtu.be/v5CoPkeVQCI?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-flashback-with-attck-exploring-malware-history-with-attck-20032018-kris-oosthoek-delft-university"
        }, {
            "title": "Tell Tall Tales With ATT&CK!",
            "presenters": [{
                "names": ["James Lerud"],
                "organization": "Titania Solutions Group"
            }],
            "description": "Once upon a time there was a security expert with all kinds of ATT&CK data. There were Atomic tests, breach simulations, and metrics abound! Our hero knew he could mold the data to illustrate a story of triumph. He would deliver magnificent slides and graphs with color and shape that, even the dull c-suite would know he was great. This presentation will teach the audience how to torture ATT&CK data until it confesses. Manipulation of ordinal scales, dirty data, playing into biases, nothing is off limits if it makes us look good. Follow the advice here and you will be ready to tell tall tales with ATT&CK… or for the true hearted tell boring realistic stories.",
            "video": "https://youtu.be/XVGXfFcUvYc?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-tell-tall-tales-with-attck-james-lerud-titania-solutions-group-193686781"
        }, {
            "title": "ATT&CK Updates – ICS",
            "presenters": [{
                "names": ["Otis Alexander"],
                "organization": "MITRE"
            }],
            "description": "Updates from the ATT&CK Team's very own Otis Alexander covering ATT&CK for ICS.",
            "video": "https://youtu.be/a9-p4tMsp14?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-updates-ics-otis-alexander-mitre-193601017"
        }, {
            "title": "Ready to ATT&CK? Bring Your Own Data (BYOD) and Validate Your Data Analytics!",
            "presenters": [{
                "names": ["Roberto Rodriguez"],
                "organization": "Cybersecurity Specialist"
            }, {
                "names": ["Jose Luis Rodriguez"],
                "organization": "Student"
            }],
            "description": "\"How do we collect the right data for the detection of specific adversarial techniques?\" That is a very important and common question for organizations planning on leveraging ATT&CK for their defensive strategy. One approach might be reading the data sources metadata available per each technique in the ATT&CK framework. That is a good first step, and it is already helping organizations to integrate the framework with their current security controls. However, as you go deeper into the specific recommended data sources per technique, it is very important to understand that not every technique variation requires the same data sources. In addition, there needs to be a way to validate if what we are collecting aligns with the data analytics being created. In this talk, we will share our current experiences contributing to the \"Data Sources\" section of ATT&CK framework and the Cyber Analytics Repository (CAR) project. We will show how to use pre-captured datasets from our open source project named Mordor to expedite simulation of adversarial techniques and validation of data analytics. In addition, we will show how we leverage Jupyter Notebooks to develop and test data analytics from projects like CAR to finish the validation process and provide recommendations.",
            "video": "https://youtu.be/eM0c_Gil-38?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-ready-to-attck-bring-your-own-data-byod-and-validate-your-data-analytics-roberto-rodriguez-aws-and-jose-rodriguez-nvcc"
        }, {
            "title": "Prioritizing Data Sources for Minimum Viable Detection",
            "presenters": [{
                "names": ["Keith McCammon"],
                "organization": "Red Canary"
            }],
            "description": "MITRE ATT&CK<sup>&reg;</sup> is more than a glossary of security terminology that offers us a common language to communicate about threats. While each technique includes a description, it also includes a list of the requisite data sources necessary to observe an adversary leveraging that technique—transforming ATT&CK from a nebulous collection of definitions into a practical tool for improving detection coverage. However, in the same way that you can’t simply build alerts for every technique, you can’t gain access to every data source. How do you effectively prioritize data sources so that you are getting the best returns on your visibility investments?",
            "video": "https://youtu.be/dnHdxlwqgME?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-prioritizing-data-sources-for-minimum-viable-detection-keith-mccammon-red-canary-193703088"
        }, {
            "title": "ATT&CK Updates – Controls Mapping",
            "presenters": [{
                "names": ["Mike Long"],
                "organization": "MITRE"
            }],
            "description": "Updates from the ATT&CK Team's very own Mike Long covering controls mapping.",
            "video": "https://youtu.be/mdGWojl0Ay8?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-updates-controls-mapping-mike-long-mitre"
        }, {
            "title": "The World’s Most Dangerous ATT&CKers",
            "presenters": [{
                "names": ["Robert Lipovský"],
                "organization": "ESET"
            }],
            "description": "As a research-oriented cybersecurity company that regularly discloses detailed analyses of cyberattacks to clients and/or the public, the introduction of MITRE ATT&CK as a common language to describe adversary techniques and tactics was certainly welcome.</p><p class='card-text'>We’ll begin our presentation by introducing exactly how and why we started using ATT&CK, providing examples of mappings in our research publications, as well as the role it plays in enhancing our EDR solutions. We’ll also describe our experience with contributing to the ATT&CK knowledge base.</p><p class='card-text'>The main part of the talk will be example-driven. Having played a key role in analyzing some of the most significant cyberattacks in history, we’ll go over the most interesting tactics, techniques, and procedures (TTPs) of the adversaries, mapping them to ATT&CK.</p><p class='card-text'>Specifically, we’ll analyze the TTPs of Sednit (a.k.a. APT28), the group reportedly responsible for the Democratic National Committee hack that affected the US 2016 elections, and Telebots (a.k.a. Sandworm), the group behind the first malware-driven electricity blackouts (BlackEnergy and Industroyer) and, the most damaging cyberattack ever (NotPetya).</p><p class='card-text'>Finally, we’ll conclude with our analysis of the current threat landscape and trends, and highlight how we anticipate it will shape ATT&CK going forward.",
            "video": "https://youtu.be/z47g13s2xVA?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-the-worlds-most-dangerous-attckers-robert-lipovsky-eset-193701776"
        }, {
            "title": "Lessons in Purple Teaming with ATT&CK",
            "presenters": [{
                "names": ["Daniel Wyleczuk-Stern"],
                "organization": "Praetorian"
            }, {
                "names": ["Matt Southworth"],
                "organization": "Priceline, Booking Holdings"
            }],
            "description": "For the past year, Praetorian and Priceline have been working together to conduct a series of Purple Team exercises to improve Priceline’s Detection and Response. These exercises utilized tactics, techniques, and procedures (TTPs) from the MITRE ATT&CK framework to baseline Priceline’s telemetry and analysis capabilities. Praetorian leveraged their recently released Metasploit Framework fork to rapidly automate basic TTPs before working cooperatively with Priceline for more advanced tests.</p><p class='card-text'>Priceline then did the heavy lift of ingesting that data, prioritizing shortcomings, and making strategic and tactical decisions to improve their security program. Through the use of ATT&CK, they were able to trace specific lines of effort back to various TTPs. This traceability helped provide support for various decisions as well as facilitated with prioritization. ATT&CK also provided a common taxonomy when working with vendors when gaps in detection were identified. Finally, ATT&CK helped Priceline track improvements through later rounds of testing to help measure the effectiveness of various improvements.",
            "video": "https://youtu.be/LydtAdCL114?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-lessons-in-purple-team-testing-with-mitre-attck-daniel-wyleczukstern-praetorian-and-matt-southworth-priceline"
        }, {
            "title": "ATT&CK Updates – CAR and Analytics",
            "presenters": [{
                "names": ["Ivan Kirillov"],
                "organization": "MITRE"
            }],
            "description": "Updates from the ATT&CK Team's very own Ivan Kirillov covering CAR and analytics.",
            "video": "https://youtu.be/t6joWR3mqDk?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-mitre-updates-cyber-analytics-repository-car-ivan-kirillov-mitre"
        }, {
            "title": "Lightning Talk: A Love Song for Heat Maps",
            "presenters": [{
                "names": ["Brian Donohue"],
                "organization": "Red Canary"
            }],
            "description": "How do you decide where to allocate your security resources and budget? Maybe you've got seasoned security professionals making decisions based on experience and intuition, maybe your decisions are driven by insurance or compliance requirements, or maybe they're completely arbitrary. Whatever the case, we can all associate ATT&CK techniques and data sources with the events we prevent, detect, or respond to. This talk will explore how security professionals can turn their internal security data into community intelligence that enumerates the threats that occur most often, enabling us all to establish data-based priorities that guide the way we spend our money and time—whether we’re buying, developing, or selling security tools.",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=59"
        }, {
            "title": "Lightning Talk: Operationalize ATT&CK with Boring Dashboards",
            "presenters": [{
                "names": ["Dan Cole"],
                "organization": "ThreatConnect Inc"
            }],
            "description": "Vendors often showcase dashboards with 3D rotating globes, animated bar graphs, and enough colors to fill a Crayola 64 pack. In this talk, I'll show how a simple dashboard of dull, boring, non-flashy, inanimate DATATABLES can be used (along with ATT&CK and a decent intel requirements process) to help analysts stay focused.",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=366"
        }, {
            "title": "Lightning Talk: MITRE ATT&CK Maturity Model Mappings from In the Field Observations",
            "presenters": [{
                "names": ["Stephan Chenette"],
                "organization": "AttackIQ"
            }],
            "description": "In this lightning talk, I'll present in the field observations of what elements of ATT&CK organizations can put into action at each maturity level of their security program to start or continue to incorporate and operationalize the MITRE ATT&CK framework.",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=648"
        }, {
            "title": "Lightning Talk: ATT&CK Poker",
            "presenters": [{
                "names": ["Ivan Ninichuck"],
                "organization": "Cyber Knights"
            }],
            "description": "My talk will be a 5 minute introduction to the concept of applying game theory to our use of Att&ck in predicting adversary actions. I am currently designing a poker style card game along these principles and would like to show off what I have so far.",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=956",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-poker-lightning-talk-ivan-ninichuck-cyber-knights"
        }, {
            "title": "Lightning Talk: Tracking and measuring your ATT&CK coverage with ATT&CK2Jira",
            "presenters": [{
                "names": ["Mauricio Velazco"]
            }],
            "description": "Tracking and measuring coverage against the ATT&CK framework can be a challenging task. This lighting talk will introduce Att&ck2Jira, a tool that leverages Jira and the Att&ck navigator that can help blue teams automate this effort. No more spreadsheets!",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=1199",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-tracking-and-measuring-attck-coverage-with-attack2jira-lightning-talk-mauricio-velazco"
        }, {
            "title": "Lightning Talk: STIX in the Mud",
            "presenters": [{
                "names": ["Bryson Bort"],
                "organization": "SCYTHE"
            }],
            "description": "CTI today = static solutions of yesterday. STIX currently adequately supports today’s requirements. What is if we could operationalize attacks (ATT&CK) with it?",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=1483",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-stix-in-the-mud-lightning-talk-bryson-bort-scythe-193684762"
        }, {
            "title": "Lightning Talk: ATT&CK, Intelligence, and Micro-Purple Teaming",
            "presenters": [{
                "names": ["Emma MacMullan"],
                "organization": "Federal Reserve"
            }],
            "description": "Intel-driven Purple Teaming can enhance simulated attacks by using ATT&CK to create real-time tactical information on current threat actor behaviors, as well as validate existing detections and identify gaps in coverage. This lightning talk will be a snapshot into an ad-hoc side project that showed you don’t need a big report or a lot of man hours to ask some interesting questions; you just need a little spontaneity, a single TTP, and of course, ATT&CK.",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=1796"
        }, {
            "title": "Lightning Talk: #GuardrailsoftheGalaxy: The Prologue",
            "presenters": [{
                "names": ["Nick Carr"],
                "organization": "FireEye"
            }],
            "description": "Providing a quick survey of execution guardrails, environmental keying, and announcing the 2019 nominees for best in-the-wild adversary use of guardrailing.",
            "video": "https://youtu.be/hrzR8TpnjAw?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk&t=2098"
        }, {
            "title": "ATT&CK Updates – PRE Integration",
            "presenters": [{
                "names": ["Adam Pennington"],
                "organization": "MITRE"
            }],
            "description": "Updates from the ATT&CK Team's very own Adam Pennington covering PRE-ATT&CK integration.",
            "video": "https://youtu.be/fEYL0MDvc44?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-20-attck-updates-pre-attck-integration-adam-pennington-mitre"
        },
        {
            "title": "Closing Remarks",
            "presenters": [{
                "names": ["Katie Nickels", "Blake Strom"],
                "organization": "MITRE"
            }],
            "description": "ATT&CK Threat Intelligence Lead Katie Nickels and ATT&CK Lead Blake Strom wrap up the conference and share the results of the ATT&CKcon 2.0 Birds of a Feather sessions.",
            "video": "https://youtu.be/mDKBEsuZvh4?list=PLkTApXQou_8KXWrk0G83QQbNLvspAo-Qk"
        }
    ]
}, {
    "date": "October 2018",
    "title": "ATT&CKcon 2018",
    "description": "Thank you for all the passion and engagement that made ATT&CKcon such a success. Over 250 of you joined us in person at MITRE’s McLean campus for our first ever event that was live streamed to more than 1,000 people at its peak. Our videos have been viewed over 10,000 times already, and there’s a lot of energy around the community to keep improving the ATT&CK framework. Please continue to watch and share these presentations.",
    "blogpost": "https://medium.com/mitre-attack/attackcon-2018-501d62566233",
    "banner_img": "/theme/images/attckcon-banner.jpg",
    "sponsors_img": "/theme/images/ATTACKcon-sponsors-final.jpg",
    "presentations": [
        {
            "title": "Advancing Infosec, Keynote Presentation",
            "presenters": [{
                "names": ["John Lambert"],
                "organization": "Microsoft"
            }],
            "description": "In this presentation at MITRE ATT&CKcon, John Lambert, Distinguished Engineer and General Manager of the Threat Intelligence Center at Microsoft, presents “Advancing InfoSec: Towards an Open, Shareable, Contributor-Friendly Model of Speeding InfoSec Learning.” The talk details a model where infosec know-how is more organized, community sourced, vendor neutral, and shareable by all defenders. It includes a call for the community to publish mappings of ATT&CK techniques used by groups.",
            "video": "https://www.youtube.com/watch?v=yslLIqfOKCU&t=0s&index=2&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-keynote-advancing-infosec-john-lambert-microsoft"
        },
        {
            "title": "How Did We Get Here?",
            "presenters": [{
                "names": ["Blake Strom", "Richard Struse"],
                "organization": "MITRE"
            }],
            "description": "Richard Struse, MITRE’s Principal Strategist for Cyber Threat Intelligence, interviews Blake Strom, MITRE’s principal ATT&CK engineer, on how MITRE ATT&CK was developed, its current state, and future direction.",
            "video": "https://www.youtube.com/watch?v=u8Fnwb-1kMg&t=0s&index=3&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2"
        },
        {
            "title": "Operationalizing ATT&CK",
            "presenters": [{
                "names": ["Bryson Bort"],
                "organization": "SCYTHE"
            }],
            "description": "How do you turn a theoretical framework into something useful? ATT&CK provides a common language while allowing for the development of sophisticated defenses.",
            "video": "https://www.youtube.com/watch?v=ggmdNvJC3sQ&index=4&t=0s&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-operationalizing-attck-bryson-bort-scythe"
        },
        {
            "title": "Summiting the Pyramid of Pain: Operationalizing ATT&CK",
            "presenters": [{
                "names": ["Emma MacMullan", "Justin Sherenco"],
                "organization": "General Electric"
            }],
            "description": "Operationalizing the ATT&CK framework has enabled GE to deploy custom detection to evolving threat actor behaviors. By leveraging an in-house developed tool called TIAMAT (Tactical Intelligence Adversary Mapping and Analysis Tool) the ATT&CK framework is incorporated into an end-to-end operational process from intelligence collection to customized detection deployment. The designing of this new operational process is examined, and a use case presented of how examining a historical incident led to a new method of deploying detection based on ATT&CK and the detection of previously undiscovered activity. There is also a demo that walks the audience through the end-to-end process and explains TIAMATs capabilities.",
            "video": "https://www.youtube.com/watch?v=YhsN5pBDrGY&index=5&t=0s&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-summiting-the-pyramid-of-pain-operationalizing-attck-emma-macmullan-and-justin-sherenco-general-electric"
        },
        {
            "title": "ATT&CK: All the Things",
            "presenters": [{
                "names": ["Neelsen Cyrus", "David Thompson"],
                "organization": "USAA"
            }],
            "description": "USAA has utilized the ATT&CK framework as a unique means to map their current detection infrastructure and assess their ability to defend against the most relevant threats to their network. In this presentation they share some lessons learned during their journey with ATT&CK leading to identified best practices for workflow integration through team composition and custom tool development.",
            "video": "https://www.youtube.com/watch?v=wryPQd2s_V8&index=6&t=0s&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-attck-all-the-things-neelsen-cyrus-and-david-thompson-usaa"
        },
        {
            "title": "Agile Continuous Improvement Using ATT&CK",
            "presenters": [{
                "names": ["Matthew Stiak", "Jason Sinchak"],
                "organization": "Level Nine Group"
            }],
            "description": "Organizations implementing SOC/IR with limited resources confront two issues: prioritization and measurement. Any successful SOC/IR implementation must have a robust way to prioritize content development and technology investment, and measurements that reflect the effectiveness of the investments to drive the next round of prioritization. Organizations can maximize their return on investment by using MITRE ATT&CK to focus resources on repeatable behaviors and provide a simple structure to reporting how well the organization can detect, block, or respond to those behaviors. During this talk security testing and operations experts Matt Stiak and Jason Sinchak share their thoughts on how to operationalize a continuous improvement and measurement framework based on MITRE ATT&CK, as well as some early results from their implementation of that framework.",
            "video": "https://www.youtube.com/watch?v=Bgg6kZBzyhc&index=7&t=0s&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-agile-continuous-improvement-using-attck-matthew-stiak-delta-dental-and-jason-sinchak-level-nine-group"
        },
        {
            "title": "Vendor Panel Discussion",
            "moderator": {
                "name": "Ed Amoroso",
                "organization": "TAG Cyber"
            },
            "panelists": [
                "Devon Kerr, Endgame",
                "Jen Miller-Osborn, Unit 42 at Palo Alto Networks",
                "Ross Rustici, Cybereason",
                "Carl Wright, ATTACKIQ"
            ],
            "topics": [
                "The role of a threat taxonomy in the design of a commercial solution",
                "How commercial providers keep up with a changing threat landscape",
                "Stories around the most intriguing threat scenarios or methods seen",
                "Requirements from commercial clients regarding threat frameworks"
            ],
            "video": "https://www.youtube.com/watch?v=hQIYdCocjbw&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=8&t=0s"
        },
        {
            "title": "VCAF: Expanding the ATT&CK Framework to cover VERIS Threat Action Varieties",
            "presenters": [{
                "names": ["Alex Pinto"],
                "organization": "Verizon"
            }],
            "description": "The Vocabulary for Event Recording and Incident Sharing (VERIS) is a set of metrics designed to provide a common language for describing security incidents in a structured and repeatable manner. VERIS has been the base analysis framework for supporting the Verizon Data Breach Investigations Report (DBIR) since its inception. However, as organizations work to interpret the richness of information present on the DBIR to a more tactical level, the Threat Action Varieties available on VERIS fail to capture the detail present on the incidents recorded. This talk presents the Verizon Common Attack Framework (VCAF), an effort from the Security Data Science team and the DBIR team in Verizon to expand and map the ATT&CK framework in alignment with the DBIR Threat Action Varieties to provide this much-sought level of granularity in recording and analyzing recorded breaches. Additionally, this talk describes possible outcomes when this data is available and organized as such. Examples include applying DBIR-inspired attack vector analytics upon ATT&CK layer information, effectively identifying optimal control choke points on the attack graphs according to specific industries covered by the DBIR.",
            "video": "https://www.youtube.com/watch?v=-NtYYqUGEco&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=9&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-vcaf-expanding-the-attck-framework-to-cover-veris-threat-action-varieties-alex-pinto-verizon"
        },
        {
            "title": "Playing Devil’s Advocate to Security Initiatives with ATT&CK",
            "presenters": [{
                "names": ["David Middlehurst"],
                "organization": "Trustwave"
            }],
            "description": "This talk presents a case study which demonstrates that we should consider the knowledge and wisdom contained within ATT&CK in all organizational security initiatives to make sure by fixing one thing we have not just created an opportunity. The presentation shows how to leverage the analysis and classification of APT tactics and procedures (TTP) to guide research into new and novel techniques, specifically focusing on exfiltration and command and control. DNS over HTTPS (DoH) aims to increase user privacy and security by preventing eavesdropping and manipulation of DNS data by man-in-the-middle attacks. Major web browsers such as Firefox are considering its implementation by default. But what could this possibly mean for exfiltration and command and control? This session provides an end-to-end demo that shows DoH being implemented to provide full command and control in a popular attack simulation framework and discusses associated mitigations.",
            "video": "https://www.youtube.com/watch?v=4sNaScEg32s&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=10&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-playing-devils-advocate-to-security-initiatives-with-attck-david-middlehurst-trustwave"
        },
        {
            "title": "From Red VS Blue to Red Loves Blue",
            "presenters": [{
                "names": ["Olaf Hartong", "Vincent Van Mieghem"],
                "organization": "Deloitte"
            }],
            "description": "This session discusses Deloitte’s purple teaming approach which is using ATT&CK as a guiding principle to help both teams improve. This session shows how this works in a customer scenario, how to scope that scenario, how to plan the scenario and choose the various TTPs to be covered to how we assist the customers blue team in understanding the TTPs and helping them design detective capabilities for them. When the Blue Team is able to connect the dots from offensive activities in the network and what they see in their logs, rewalls, SIEMs, etc. they have the ability to fully understand what adversaries do and what the TTP’s of attackers actually look like if they are active in their network. It’s much easier to find the needle in the haystack if you know there is a needle to find to begin with. Purple teaming is providing this pointy needle, used to accelerate the Blue Team.",
            "video": "https://www.youtube.com/watch?v=7OK3fOZ7NXM&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=11&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-from-red-vs-blue-to-red-blue-olaf-hartong-and-vincent-van-mieghem-deloitte"
        },
        {
            "title": "Helping Your Non-Security Executives Understand ATT&CK in 10 Minutes or Less",
            "presenters": [{
                "names": ["Elly Searle"],
                "organization": "CrowdStrike"
            }],
            "description": "ATT&CK is an incredibly valuable framework for describing and analyzing what’s happening in your environment. Sometimes security professionals not only need a way to understand, but also need a way to clearly articulate to non-security leadership to gain support and investment in needed resourcing. Using UX design methods, CrowdStrike came up with a mental model and more conversational terms to help anyone quickly parse the big picture.",
            "video": "https://www.youtube.com/watch?v=eZsMHSE2PDc&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=12&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-helping-your-nonsecurity-executives-understand-attck-in-10-minutes-or-less-elly-searle-crowdstrike"
        },
        {
            "title": "ATT&CK as a Teacher",
            "presenters": [{
                "names": ["Travis Smith"],
                "organization": "Tripwire"
            }],
            "description": "ATT&CK is valuable for those of us who are heads down in security day in and day out. But what about using ATT&CK to each college interns about security? This presentation details how Tripwire used ATT&CK to build- out a new training regimen for summer interns. By going through and finding quick wins, Tripwire’s interns were actively engaged in learning about security. The detailed break downs of ATT&CK were greatly beneficial in helping teach security concepts to those who were not yet familiar with them. This session shows the program details and how you might be able to adapt it to your requirements.",
            "video": "https://www.youtube.com/watch?v=4s3pZirFCPk&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=13&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-attck-as-a-teacher-travis-smith-tripwire"
        }, {
            "title": "Detection Philosophy, Evolution & ATT&CK",
            "presenters": [{
                "names": ["Fred Stankowski", "Travis McWaters"],
                "organization": "Pepsico"
            }],
            "description": "This lightning talk is a brief discussion around how PepsiCo is managing their ‘detection catalog’ and how it maps and is enhanced by the MITRE ATT&CK framework.",
            "video": "https://www.youtube.com/watch?v=bFFi3Vqrp2o&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=14&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-detection-philosophy-evolution-attck-fred-stankowski-travis-mcwaters"
        },
        {
            "title": "Decision Analysis Applications in Threat Analysis Frameworks",
            "presenters": [{
                "names": ["Emily Shawgo"],
                "organization": "PNC"
            }],
            "description": "In the modern age, all organizations face threats from various types of cyber attacks. Although great strides have been made to consider human factors in cybersecurity and to become more proactive in threat analysis, security is still generally a reactive, technical field. The research presented in this talk seeks to develop a framework which adapts the existing MITRE ATT&CK framework to look at attacks in a less linear, more human-centered framework that focuses on the capabilities and decisions of the threat actor. The framework approaches threat analysis from a binary assessment of success vs. failure in order to see the entire attack and consider the potential for a number of methods and attempts made in a single attack. A detailed methodology and sample charts are included for a reference and a starting point in developing one’s own personalized charts, and recommendations are made for ways to integrate this methodology into the risk management process.",
            "video": "https://www.youtube.com/watch?v=3JMVP6rkY8Y&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=15&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-decision-analysis-applications-in-threat-analysis-frameworks-emily-shawgo-pnc"
        },
        {
            "title": "Building an Atomic Testing Program",
            "presenters": [{
                "names": ["Brian Beyer"],
                "organization": "Red Canary"
            }],
            "description": "Red Canary’s applied research team built the Atomic Red Team project based on a simple idea: encourage security teams to test their systems. Leveraging MITRE ATT&CK, the series of small tests can be combined into chains to help teams gain insight into gaps in their security program at all levels. This talk describes how to use Atomic Red Team and how MITRE ATT&CK is leveraged to write the tests.",
            "video": "https://www.youtube.com/watch?v=MZZzYaNUfjE&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=16&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-building-an-atomic-testing-program-brian-beyer-red-canary"
        },
        {
            "title": "5 Ways to Screw Up Your Security Program with ATT&CK",
            "presenters": [{
                "names": ["Kyle Rainey"],
                "organization": "Red Canary"
            }],
            "description": "Over the past year there has been a significant uptick in adoption of MITRE ATT&CK. Adoption of a common language and taxonomy for adversarial tactics and techniques comes with a few unspoken traps. This talk is to bring awareness to the pitfalls of implementing and adopting any variation of MITRE ATT&CK and how you can avoid falling for them.",
            "video": "https://www.youtube.com/watch?v=MBVxaE9oaMQ&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=17&t=0s"
        },
        {
            "title": "ATT&CK + OSQuery = Love",
            "presenters": [{
                "names": ["Scott Lundgren"],
                "organization": "Carbon Black"
            }],
            "description": "MITRE ATT&CK is cool and it's open, with a heavy emphasis on how attackers behave on the endpoint. OSQuery is cool and it's open, with a heavy emphasis on endpoint visibility. This talk focuses on an open-source extension to OSQuery that provides a free, repeatable mechanism to identify and detect ATT&CK techniques.",
            "video": "https://www.youtube.com/watch?v=scI1AvZUBCo&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=18&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-attck-osquery-love-scott-lundgren-carbon-black"
        },
        {
            "title": "An ATT&CK Review of 200 Hybrid-Analysis Submissions",
            "presenters": [{
                "names": ["James Lerud"],
                "organization": "Verodin"
            }],
            "description": "How can you consistently categorize Techniques a given piece of malware uses? The answer to this question could be provided by sandbox vendors. CrowdStrike has embraced ATT&CK by including Technique detection in their public Hybrid-Analysis reports. This talk reviews the submission results of 100 malicious and 100 benign executables.",
            "video": "https://www.youtube.com/watch?v=GDIPEYdTmCE&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=19&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-an-attck-review-of-200-hybridanalysis-submissions-james-lerud-verodin"
        },
        {
            "title": "From Technique to Detection",
            "presenters": [{
                "names": ["Paul Ewing", "Ross Wolf"],
                "organization": "Endgame"
            }],
            "description": "This session is a practical guide for a rapid prototyping of ATT&CK-based analytics – from technique to detection.",
            "video": "https://www.youtube.com/watch?v=a3hIIzJrH14&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=20&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-from-technique-to-detection-paul-ewing-and-ross-wolf-endgame"
        },
        {
            "title": "Hunters ATT&CKing with the Data",
            "presenters": [{
                "names": ["Roberto Rodriguez"],
                "organization": "SpecterOps"
            }, {
                "names": ["Jose Luis Rodriguez"],
                "organization": "Student"
            }],
            "description": "With the development of the MITRE ATT&CK framework and its categorization of adversary activity during the attack cycle, understanding what to hunt for has become easier and more efficient than ever. However, organizations are still struggling to understand how they can prioritize the development of hunt hypothesis, assess their current security posture, and develop the right analytics with the help of ATT&CK. Even though there are several ways to utilize ATT&CK to accomplish those goals, there are only a few that are focusing primarily on the data that is currently being collected to drive the success of a hunt program. This presentation shows how organizations can benefit from mapping their current visibility from a data perspective to the ATT&CK framework. It focuses on how to identify, document, standardize and model current available data to enhance a hunt program. It presents an updated ThreatHunter-Playbook, a Kibana ATT&CK dashboard, a new project named Open Source Security Events Metadata known as OSSEM and expands on the “data sources” section already provided by ATT&CK on most of the documented adversarial techniques.",
            "video": "https://www.youtube.com/watch?v=QCDBjFJ_C3g&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=21&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-hunters-attcking-with-the-data-robert-rodriguez-specterops-and-jose-luis-rodriguez-student"
        },
        {
            "title": "Analyzing Targeted Intrusions Through the Lens of the ATT&CK Framework",
            "presenters": [{
                "names": ["Karl Scheuerman"],
                "organization": "CrowdStrike"
            }],
            "description": "The security community is quickly adopting the MITRE ATT&CK matrix as a framework for understanding and analyzing targeted intrusions. However, one of its potential limitations is a lack of detailed historical intrusion data for developing accurate and thorough ATT&CK-based threat modeling. Crowdstrike’s Falcon OverWatch threat hunting team analyzes adversary behavior on a regular basis. The amount of OverWatch's malicious intrusion data is significant given the valuable telemetry delivered by Falcon's endpoint technology. As a result, CrowdStrike has amassed a rich data library of malicious activity that can be applied to the ATT&CK model. The OverWatch Strategic Counter-Adversary Research (SCAR) team has now evaluated all OverWatch intrusion data since January 1, 2018 through the lens of the ATT&CK framework. This presentation presents these findings and highlights cases of unique adversary TTP use. The results of this analysis will provide a baseline from which CrowdStrike can better identify changes in threat actor TTP trends moving forward. In addition, the presentation discusses limitations in this type of research.",
            "video": "https://www.youtube.com/watch?v=Rg64nPqqs8s&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=22&t=0s"
        },
        {
            "title": "End User Panel Disussion",
            "moderator": {
                "name": "Katie Nickels",
                "organization": "MITRE"
            },
            "panelists": [
                "Jon Bagg, Booz Allen Hamilton",
                "Daniel Bernholz, JPMorgan Chase",
                "Dave Westgard, Target Corporation"
            ],
            "topics": [
                "What are the best practices and lessons learned for organizations who are just getting started with ATT&CK?",
                "What has been the most difficult part of implementing ATT&CK? What changes could be made to ATT&CK to make it easier for others in the future?",
                "Where would you like to see ATT&CK go in the future that would help make it more useful for your team?",
                "What else haven’t we talked about that you think is important for someone who wants to use ATT&CK to know?"
            ],
            "video": "https://www.youtube.com/watch?v=wJoMKYfM7OQ&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=23&t=0s"
        },{
            "title": "Sofacy 2018 and the Adversary Playbook",
            "presenters": [{
                "names": ["Robert Falcone"],
                "organization": "Palo Alto Networks"
            }],
            "description": "Unit 42 researches threat activity and publishes detailed reports on attack campaigns launched by these adversaries. One of these adversaries, known as Sofacy, has been carrying out attack campaigns on high profile targets for many years and has continued into 2018. To understand how to defend against these threats, an analyst has to read our reports, process them and mentally map them to their defenses. In most cases we expect readers just \"block\" all of the indicators we include in the report and assume they are covered. Last year we started using ATT&CK to codify the techniques we observed, linking those techniques to indicator patterns and encoding them into STIX 2 objects, with the goal of creating something that a defender can use to answer the question: \"How am I defending against this adversary?\" We call these documents, \"Adversary Playbooks\" as they contain our best approximation of how the adversary launches their attacks. This talk describes the concept of Adversary Playbooks, as well as provides an overview of the attack campaigns Unit 42 has attributed to the Sofacy group in 2018. It uses the discussed attacks to show how these playbooks are constructed and explain some of the challenges of incorporating ATT&CK and STIX 2 together for this purpose.",
            "video": "https://www.youtube.com/watch?v=4CBES3xv3Zg&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=24&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-sofacy-2018-and-the-adversary-playbook-robert-falcone-palo-alto-networks"
        },{
            "title": "From Automation to Analytics: Simulating the Adversary to Create Better Detections",
            "presenters": [{
                "names": ["David Herrald", "Ryan Kovar"],
                "organization": "Splunk"
            }],
            "description": "Security teams have more detection tools at their disposal than ever before, yet most are still struggling to find even the most basic malicious activity occurring in their environments. Building effective detection analytics requires realistic data and the ability to iterate quickly in a rapid analytic development cycle. This talk introduces a full lifecycle attack simulation and analytics development environment featuring the MITRE ATT&CK framework and the Atomic Red Team project using Splunk and Splunk Phantom mapped to an imaginary APT group, Taedonggang. It focuses on how security teams can use such a system to rapidly develop and share new detection analytics. Links to all components referenced in the talk are provided, including a cloud-based dataset that can act as a playground for users who want to see the results of the activity.",
            "video": "https://www.youtube.com/watch?v=ZRixr6QshEs&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=25&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-from-automation-to-analytics-simulating-the-adversary-to-create-better-detections-david-herrald-and-ryan-kovar-splunk"
        },{
            "title": "The Use of Game Theory with MITRE ATT&CK",
            "presenters": [{
                "names": ["Matt Summers", "Nick Dunn"],
                "organization": "NCC Group"
            }],
            "description": "This presentation shows how the use of game theory with the ATT&CK framework can produce better attack and defense strategies.",
            "video": "https://www.youtube.com/watch?v=UcZBAY18UXo&list=PLkTApXQou_8JrhtrFDfAskvMqk97Yu2S2&index=26&t=0s",
            "slides": "https://www.slideshare.net/attackcon2018/mitre-attckcon-2018-the-use-of-game-theory-with-mitre-attck-matt-summers-and-nick-dunn-ncc-group"
        }
    ]
}]
