{"description": "Mobile techniques used by Use Recent OS Version, ATT&CK mitigation M1006 v1.0", "name": "Use Recent OS Version (M1006)", "domain": "mobile-attack", "versions": {"layer": "4.2", "attack": "9", "navigator": "4.3"}, "techniques": [{"score": 1, "techniqueID": "T1433", "showSubtechniques": false, "comment": "Decrease likelihood of successful privilege escalation attack."}, {"score": 1, "techniqueID": "T1413", "showSubtechniques": false, "comment": "Starting in Android 4.1, this technique requires privilege escalation for malicious applications to perform, as apps can no longer access the system log (other than log entries added by a particular app itself). (Additionally, with physical access to the device, the system log could be accessed via USB through the Android Debug Bridge.)(Citation: Android-ReadLogs)"}, {"score": 1, "techniqueID": "T1409", "showSubtechniques": false, "comment": "Most new versions of mobile operating systems include patches to newly discovered privilege escalation exploits used to root or jailbreak devices. Further, applications that target Android API level 28 or higher on Android 9.0 and above devices have a policy applied that prevents other applications from reading or writing data in their internal storage directories, regardless of file permissions.(Citation: Android-9.0-API-Changes)"}, {"score": 1, "techniqueID": "T1402", "showSubtechniques": false, "comment": "In Android 8, broadcast intent behavior was changed, limiting the implicit intents that applications can register for in the manifest.(Citation: Android Changes to System Broadcasts)"}, {"score": 1, "techniqueID": "T1429", "showSubtechniques": false, "comment": "Android 9 and above restricts access to microphone, camera, and other sensors from background applications.(Citation: Android Capture Sensor 2019)"}, {"score": 1, "techniqueID": "T1512", "showSubtechniques": false, "comment": "Android 9 and above restricts access to mic, camera, and other sensors from background applications.(Citation: Android Capture Sensor 2019) "}, {"score": 1, "techniqueID": "T1414", "showSubtechniques": false, "comment": "Android 10 prevents applications from accessing clipboard data unless the application is on the foreground or is set as the device’s default input method editor (IME).(Citation: Android 10 Privacy Changes)"}, {"score": 1, "techniqueID": "T1448", "showSubtechniques": false, "comment": "Starting with Android 4.2 the user must provide consent before applications can send SMS messages to premium numbers.(Citation: AndroidSecurity2014)"}, {"score": 1, "techniqueID": "T1510", "showSubtechniques": false, "comment": "Android 10 prevents applications from accessing clipboard data unless the application is on the foreground or is set as the device’s default input method editor (IME).(Citation: Android 10 Privacy Changes)"}, {"score": 1, "techniqueID": "T1577", "showSubtechniques": false, "comment": "Many vulnerabilities related to injecting code into existing applications have been patched in previous Android releases."}, {"score": 1, "techniqueID": "T1401", "showSubtechniques": false, "comment": "Changes were introduced in Android 7 to make abuse of device administrator permissions more difficult.(Citation: GoogleIO2016)"}, {"score": 1, "techniqueID": "T1407", "showSubtechniques": false, "comment": "On Android 10 and above devices, applications that target Android API level 29 or higher cannot execute native code stored in the application's internal data storage directory, limiting the ability of applications to download and execute native code at runtime.(Citation: Android 10 Execute)"}, {"score": 1, "techniqueID": "T1458", "showSubtechniques": false, "comment": "Newer OS versions generally will include security patches against discovered vulnerabilities that become known to the vendor. Additionally, iOS 11.4.1 and higher introduce USB Restricted Mode, which under certain conditions disables data access through the device's charging port (making the port only usable for power), likely preventing this technique from working.(Citation: Elcomsoft-iOSRestricted)"}, {"score": 1, "techniqueID": "T1420", "showSubtechniques": false, "comment": "Increase difficulty of escalating privileges, as security architecture improvements in each new version of Android and iOS make it more difficult to escalate privileges. Additionally, newer versions of Android have strengthened the sandboxing applied to applications, restricting their ability to enumerate file system contents."}, {"score": 1, "techniqueID": "T1581", "showSubtechniques": false, "comment": "New OS releases frequently contain additional limitations or controls around device location access."}, {"score": 1, "techniqueID": "T1478", "showSubtechniques": false, "comment": "iOS 10.3 and higher add an additional step for users to install new trusted CA certificates to make it more difficult to trick users into installing them. On Android, apps that target compatibility with Android 7 and higher (API Level 24) default to only trusting CA certificates that are bundled with the operating system, not CA certificates that are added by the user or administrator, hence decreasing their susceptibility to successful man-in-the-middle attack.(Citation: Symantec-iOSProfile2)(Citation: Android-TrustedCA)"}, {"score": 1, "techniqueID": "T1579", "showSubtechniques": false, "comment": "Newer OS releases typically patch known root exploits disclosed in previous versions."}, {"score": 1, "techniqueID": "T1403", "showSubtechniques": false, "comment": "For applications running on Android 10 and higher devices, application developers can indicate that DEX code should always be executed directly from the application package.(Citation: Android 10 DEX)"}, {"score": 1, "techniqueID": "T1424", "showSubtechniques": false, "comment": "As stated in the technical description, Android 7 and above prevent applications from accessing this information."}, {"score": 1, "techniqueID": "T1422", "showSubtechniques": false, "comment": "Starting in Android 6.0, applications can no longer access MAC addresses of network interfaces.(Citation: Android60Changes)"}, {"score": 1, "techniqueID": "T1416", "showSubtechniques": false, "comment": "iOS 11 introduced a first-come-first-served principle for URIs, allowing only the prior installed app to be launched via the URI.(Citation: Trend Micro iOS URL Hijacking)"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Use Recent OS Version", "color": "#66b1ff"}]}