{"description": "Mobile techniques used by Pegasus for iOS, ATT&CK software S0289 v1.1", "name": "Pegasus for iOS (S0289)", "domain": "mitre-mobile", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1433", "comment": "Pegasus for iOS captures call logs."}, {"score": 1, "techniqueID": "T1432", "comment": "Pegasus for iOS gathers contacts from the system by dumping the victim's address book."}, {"score": 1, "techniqueID": "T1409", "comment": "Pegasus for iOS accesses sensitive data in files, such as saving Skype calls by reading them out of the Skype database files."}, {"score": 1, "techniqueID": "T1438", "comment": "Pegasus for iOS uses SMS for command and control."}, {"score": 1, "techniqueID": "T1412", "comment": "Pegasus for iOS captures SMS messages that the victim sends or receives."}, {"score": 1, "techniqueID": "T1456", "comment": "Pegasus for iOS was distributed through a web site by exploiting vulnerabilities in the Safari web browser on iOS devices."}, {"score": 1, "techniqueID": "T1404", "comment": "Pegasus for iOS exploits iOS vulnerabilities to escalate privileges."}, {"score": 1, "techniqueID": "T1477", "comment": "Pegasus for iOS was delivered via an SMS message containing a link to a web site with malicious code."}, {"score": 1, "techniqueID": "T1430", "comment": "Pegasus for iOS update and sends the location of the phone."}, {"score": 1, "techniqueID": "T1429", "comment": "Pegasus for iOS has the ability to record audio."}, {"score": 1, "techniqueID": "T1400", "comment": "Pegasus for iOS modifies the system partition to maintain persistence."}, {"score": 1, "techniqueID": "T1426", "comment": "Pegasus for iOS monitors the victim for status and disables other access to the phone by other jailbreaking software."}, {"score": 1, "techniqueID": "T1422", "comment": "Pegasus for iOS monitors the connection state and tracks which types of networks the phone is connected to, potentially to determine the bandwidth and ability to send full data across the network."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Pegasus for iOS", "color": "#66b1ff"}]}