{"description": "Enterprise techniques used by Turla, ATT&CK group G0010 v1.2", "name": "Turla (G0010)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1134", "comment": "Turla RPC backdoors can impersonate or steal process tokens before executing commands. "}, {"score": 1, "techniqueID": "T1110", "comment": "Turla may attempt to connect to systems within a victim's network using net use commands and a predefined list or collection of passwords."}, {"score": 1, "techniqueID": "T1059", "comment": "Turla RPC backdoors have used cmd.exe to execute commands."}, {"score": 1, "techniqueID": "T1090", "comment": "Turla RPC backdoors have included local UPnP RPC proxies.  "}, {"score": 1, "techniqueID": "T1081", "comment": "Turla has gathered credentials from the Windows Credential Manager tool.   "}, {"score": 1, "techniqueID": "T1022", "comment": "Turla has encrypted files stolen from connected USB drives into a RAR file before exfiltration."}, {"score": 1, "techniqueID": "T1005", "comment": "Turla RPC backdoors can upload files from victim machines."}, {"score": 1, "techniqueID": "T1025", "comment": "Turla RPC backdoors can collect files from USB thumb drives."}, {"score": 1, "techniqueID": "T1140", "comment": "Turla has used a custom decryption routine, which pulls key and salt values from other artifacts such as a WMI filter or PowerShell Profile, to decode encrypted PowerShell payloads."}, {"score": 1, "techniqueID": "T1089", "comment": "Turla has used a AMSI bypass, which patches the in-memory amsi.dll, in PowerShell scripts to bypass Windows antimalware products."}, {"score": 1, "techniqueID": "T1106", "comment": "Turla and its RPC backdoors have used APIs calls for various tasks related to subverting AMSI and accessing then executing commands through RPC and/or named pipes."}, {"score": 1, "techniqueID": "T1048", "comment": "Turla has used WebDAV to upload stolen USB files to a cloud drive."}, {"score": 1, "techniqueID": "T1083", "comment": "Turla surveys a system upon check-in to discover files in specific locations on the hard disk %TEMP% directory, the current user's desktop, and in the Program Files directory. Turla RPC backdoors have also searched for files matching the lPH*.dll pattern."}, {"score": 1, "techniqueID": "T1066", "comment": "Based on comparison of Gazer versions, Turla made an effort to obfuscate strings in the malware that could be used as IoCs, including the mutex name and named pipe."}, {"score": 1, "techniqueID": "T1112", "comment": "Turla has used the Registry to store encrypted payloads."}, {"score": 1, "techniqueID": "T1027", "comment": "Turla has used encryption (including salted 3DES via PowerSploit's Out-EncryptedScript.ps1), random variable names, and base64 encoding to obfuscate PowerShell commands and payloads."}, {"score": 1, "techniqueID": "T1086", "comment": "Turla has used PowerShell to execute commands/scripts, in some cases via a custom executable or code from Empire's PSInject. Turla has also used PowerShell scripts to load and execute malware in memory."}, {"score": 1, "techniqueID": "T1057", "comment": "Turla surveys a system upon check-in to discover running processes using the tasklist /v command. Turla RPC backdoors have also enumerated processes associated with specific open ports or named pipes."}, {"score": 1, "techniqueID": "T1055", "comment": "Turla has used Metasploit to perform reflective DLL injection in order to escalate privileges. Turla has also used PowerSploit's Invoke-ReflectivePEInjection.ps1 to reflectively load a PowerShell payload into a random process on the victim system."}, {"score": 1, "techniqueID": "T1012", "comment": "Turla surveys a system upon check-in to discover information in the Windows Registry with the reg query command. Turla has also retrieved PowerShell payloads hidden in Registry keys as well as checking keys associated with null session named pipes ."}, {"score": 1, "techniqueID": "T1060", "comment": "A Turla Javascript backdoor added a local_update_check value under the Registry key HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run to establish persistence. Additionally, a Turla custom executable containing Metasploit shellcode is saved to the Startup folder to gain persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "Turla has used shellcode to download Meterpreter after compromising a victim. Turla RPC backdoors can also download files onto victim machines."}, {"score": 1, "techniqueID": "T1018", "comment": "Turla surveys a system upon check-in to discover remote systems on a local network using the net view and net view /DOMAIN commands."}, {"score": 1, "techniqueID": "T1064", "comment": "Turla has used PowerShell and VBS scripts throughout its operations.   "}, {"score": 1, "techniqueID": "T1193", "comment": "Turla has used spearphishing emails to deliver BrainTest as a malicious attachment."}, {"score": 1, "techniqueID": "T1192", "comment": "Turla attempted to trick targets into clicking on a link featuring a seemingly legitimate domain from Adobe.com to download their malware and gain initial access."}, {"score": 1, "techniqueID": "T1071", "comment": "Turla has used HTTP and HTTPS for C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "Turla surveys a system upon check-in to discover operating system configuration details using the systeminfo and set commands."}, {"score": 1, "techniqueID": "T1016", "comment": "Turla surveys a system upon check-in to discover network configuration details using the arp -a, nbtstat -n, nbtscan, and net config commands. Turla RPC backdoors have also retrieved registered RPC interface information from process memory."}, {"score": 1, "techniqueID": "T1049", "comment": "Turla surveys a system upon check-in to discover active local network connections using the netstat -an, net use, net file, and net session commands. Turla RPC backdoors have also enumerated the IPv4 TCP connection table via the GetTcpTable2 API call."}, {"score": 1, "techniqueID": "T1007", "comment": "Turla surveys a system upon check-in to discover running services and associated processes using the tasklist /svc command."}, {"score": 1, "techniqueID": "T1124", "comment": "Turla surveys a system upon check-in to discover the system time by using the net time command."}, {"score": 1, "techniqueID": "T1204", "comment": "Turla has used spearphishing via a link to get users to download and run their malware."}, {"score": 1, "techniqueID": "T1102", "comment": "A Turla JavaScript backdoor has used Google Apps Script as its C2 server."}, {"score": 1, "techniqueID": "T1077", "comment": "Turla used net use commands to connect to lateral systems within a network."}, {"score": 1, "techniqueID": "T1084", "comment": "Turla has used WMI event filters and consumers to establish persistence."}, {"score": 1, "techniqueID": "T1004", "comment": "Turla established persistence by adding a Shell value under the Registry key HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion]Winlogon."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Turla", "color": "#66b1ff"}]}