{"description": "Enterprise techniques used by USBStealer, ATT&CK software S0136 v1.0", "name": "USBStealer (S0136)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "For all non-removable drives on a victim, USBStealer executes automated collection of certain files for later exfiltration."}, {"score": 1, "techniqueID": "T1020", "comment": "USBStealer automatically exfiltrates collected files via removable media when an infected device is connected to the second victim after receiving commands from the first victim."}, {"score": 1, "techniqueID": "T1092", "comment": "USBStealer drops commands for a second victim onto a removable media drive inserted into the first victim, and commands are executed when the drive is inserted into the second victim."}, {"score": 1, "techniqueID": "T1025", "comment": "Once a removable media device is inserted back into the first victim, USBStealer collects data from it that was exfiltrated from a second victim."}, {"score": 1, "techniqueID": "T1074", "comment": "USBStealer collects files matching certain criteria from the victim and stores them in a local directory for later exfiltration."}, {"score": 1, "techniqueID": "T1052", "comment": "USBStealer exfiltrates collected files via removable media from air-gapped victims."}, {"score": 1, "techniqueID": "T1083", "comment": "USBStealer searches victim drives for files matching certain extensions (“.skr”,“.pkr” or “.key”) or names."}, {"score": 1, "techniqueID": "T1107", "comment": "USBStealer has several commands to delete files associated with the malware from the victim."}, {"score": 1, "techniqueID": "T1036", "comment": "USBStealer mimics a legitimate Russian program called USB Disk Security."}, {"score": 1, "techniqueID": "T1027", "comment": "Most strings in USBStealer are encrypted using 3DES and XOR and reversed."}, {"score": 1, "techniqueID": "T1120", "comment": "USBStealer monitors victims for insertion of removable drives. When dropped onto a second victim, it also enumerates drives connected to the system."}, {"score": 1, "techniqueID": "T1060", "comment": "USBStealer registers itself under a Registry Run key with the name \"USB Disk Security.\""}, {"score": 1, "techniqueID": "T1091", "comment": "USBStealer drops itself onto removable media and relies on Autorun to execute the malicious file when a user opens the removable media on another system."}, {"score": 1, "techniqueID": "T1099", "comment": "USBStealer sets the timestamps of its dropper files to the last-access and last-write timestamps of a standard Windows library chosen on the system."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by USBStealer", "color": "#66b1ff"}]}