{"description": "Enterprise techniques used by Stealth Falcon, ATT&CK group G0038 v1.0", "name": "Stealth Falcon (G0038)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1003", "comment": "Stealth Falcon malware gathers passwords from multiple sources, including Windows Credential Vault, Internet Explorer, Firefox, Chrome, and Outlook."}, {"score": 1, "techniqueID": "T1005", "comment": "Stealth Falcon malware gathers data from the local victim system."}, {"score": 1, "techniqueID": "T1041", "comment": "After data is collected by Stealth Falcon malware, it is exfiltrated over the existing C2 channel."}, {"score": 1, "techniqueID": "T1086", "comment": "Stealth Falcon malware uses PowerShell commands to perform various functions, including gathering system information via WMI and executing commands from its C2 server."}, {"score": 1, "techniqueID": "T1057", "comment": "Stealth Falcon malware gathers a list of running processes."}, {"score": 1, "techniqueID": "T1012", "comment": "Stealth Falcon malware attempts to determine the installed version of .NET by querying the Registry."}, {"score": 1, "techniqueID": "T1053", "comment": "Stealth Falcon malware creates a scheduled task entitled “IE Web Cache” to execute a malicious file hourly."}, {"score": 1, "techniqueID": "T1064", "comment": "Stealth Falcon malware uses PowerShell and WMI to script data collection and command execution on the victim."}, {"score": 1, "techniqueID": "T1071", "comment": "Stealth Falcon malware communicates with its C2 server via HTTPS."}, {"score": 1, "techniqueID": "T1032", "comment": "Stealth Falcon malware encrypts C2 traffic using RC4 with a hard-coded key."}, {"score": 1, "techniqueID": "T1082", "comment": "Stealth Falcon malware gathers system information via WMI, including the system directory, build number, serial number, version, manufacturer, model, and total physical memory."}, {"score": 1, "techniqueID": "T1016", "comment": "Stealth Falcon malware gathers the Address Resolution Protocol (ARP) table from the victim."}, {"score": 1, "techniqueID": "T1033", "comment": "Stealth Falcon malware gathers the registered user and primary owner name via WMI."}, {"score": 1, "techniqueID": "T1047", "comment": "Stealth Falcon malware gathers system information via Windows Management Instrumentation (WMI)."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Stealth Falcon", "color": "#66b1ff"}]}