{"description": "Enterprise techniques used by FIN6, ATT&CK group G0037 v1.1", "name": "FIN6 (G0037)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "FIN6 has used Metasploit’s PsExec NTDSGRAB module to obtain a copy of the victim's Active Directory database."}, {"score": 1, "techniqueID": "T1119", "comment": "FIN6 has used a script to iterate through a list of compromised PoS systems, copy data to a log file, and remove the original data files."}, {"score": 1, "techniqueID": "T1003", "comment": "FIN6 has used Windows Credential Editor for credential dumping, as well as Metasploit’s PsExec NTDSGRAB module to obtain a copy of the victim's Active Directory database.   "}, {"score": 1, "techniqueID": "T1002", "comment": "Following data collection, FIN6 has compressed log files into a ZIP archive prior to staging and exfiltration."}, {"score": 1, "techniqueID": "T1022", "comment": "TRINITY malware used by FIN6 encodes data gathered from the victim with a simple substitution cipher and single-byte XOR using the 0xAA key."}, {"score": 1, "techniqueID": "T1074", "comment": "TRINITY malware used by FIN6 identifies payment card track data on the victim and then copies it to a local file in a subdirectory of C:\\Windows\\. Once the malware collects the data, FIN6 actors compressed data and moved it to another staging system before exfiltration."}, {"score": 1, "techniqueID": "T1068", "comment": "FIN6 has used tools to exploit Windows vulnerabilities in order to escalate privileges. The tools targeted CVE-2013-3660, CVE-2011-2005, and CVE-2010-4398, all of which could allow local users to access kernel-level privileges."}, {"score": 1, "techniqueID": "T1036", "comment": "FIN6 has renamed the \"psexec\" service name to \"mstdc\" to masquerade as a legitimate Windows executable.    "}, {"score": 1, "techniqueID": "T1046", "comment": "FIN6 used publicly available tools (including Microsoft's built-in SQL querying tool, osql.exe) to map the internal network and conduct reconnaissance against Active Directory, Structured Query Language (SQL) servers, and NetBIOS."}, {"score": 1, "techniqueID": "T1069", "comment": "FIN6 has used tools like Adfind to query users, groups, organizational units, and trusts.  "}, {"score": 1, "techniqueID": "T1086", "comment": "FIN6 has used a Metasploit PowerShell module to download and execute shellcode and to set up a local listener."}, {"score": 1, "techniqueID": "T1060", "comment": "FIN6 has used Registry Run keys to establish persistence for its downloader tools known as HARDTACK and SHIPBREAD."}, {"score": 1, "techniqueID": "T1076", "comment": "FIN6 used RDP to move laterally in victim networks."}, {"score": 1, "techniqueID": "T1018", "comment": "FIN6 used publicly available tools (including Microsoft's built-in SQL querying tool, osql.exe) to map the internal network and conduct reconnaissance against Active Directory, Structured Query Language (SQL) servers, and NetBIOS."}, {"score": 1, "techniqueID": "T1053", "comment": "FIN6 has used scheduled tasks to establish persistence for various malware it uses, including downloaders known as HARDTACK and SHIPBREAD and PoS malware known as TRINITY."}, {"score": 1, "techniqueID": "T1064", "comment": "FIN6 has used a Metasploit PowerShell module to download and execute shellcode and to set up a local listener. FIN6 has also used scripting to iterate through a list of compromised PoS systems, copy data to a log file, and remove the original data files."}, {"score": 1, "techniqueID": "T1035", "comment": "FIN6 has created Windows services to execute encoded PowerShell commands."}, {"score": 1, "techniqueID": "T1071", "comment": "FIN6 used the Plink command-line utility to create SSH tunnels to C2 servers."}, {"score": 1, "techniqueID": "T1032", "comment": "FIN6 used the Plink command-line utility to create SSH tunnels to C2 servers."}, {"score": 1, "techniqueID": "T1078", "comment": "To move laterally on a victim network, FIN6 has used credentials stolen from various systems on which it gathered usernames and password hashes."}, {"score": 1, "techniqueID": "T1102", "comment": "FIN6 has used Pastebin to host content for the operation.  "}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by FIN6", "color": "#66b1ff"}]}