{"description": "Mobile techniques used by Rotexy, ATT&CK software S0411 v1.0", "name": "Rotexy (S0411)", "domain": "mitre-mobile", "version": "2.2", "techniques": [{"score": 1, "techniqueID": "T1432", "comment": "Rotexy can access and upload the contacts list to the command and control server.[1]"}, {"score": 1, "techniqueID": "T1438", "comment": "Rotexy can be controlled through SMS messages.[1]"}, {"score": 1, "techniqueID": "T1418", "comment": "Rotexy retrieves a list of installed applications and sends it to the command and control server.[1]"}, {"score": 1, "techniqueID": "T1412", "comment": "Rotexy processes incoming SMS messages by filtering based on phone numbers, keywords, and regular expressions, focusing primarily on banks, payment systems, and mobile network operators. Rotexy can automatically reply to SMS messages, and optionally delete them. Rotexy can also send a list of all SMS messages on the device to the command and control server.[1]"}, {"score": 1, "techniqueID": "T1476", "comment": "Rotexy is distributed through phishing links sent in SMS messages as AvitoPay.apk.[1]"}, {"score": 1, "techniqueID": "T1446", "comment": "Rotexy can lock an HTML page in the foreground, requiring the user enter credit card information that matches information previously intercepted in SMS messages, such as the last 4 digits of a credit card number. If attempts to revoke administrator permissions are detected, Rotexy periodically switches off the phone screen to inhibit permission removal.[1]"}, {"score": 1, "techniqueID": "T1520", "comment": "Rotexy procedurally generates subdomains for command and control communication.[1]"}, {"score": 1, "techniqueID": "T1523", "comment": "Rotexy checks if it is running in an analysis environment. [1]"}, {"score": 1, "techniqueID": "T1411", "comment": "Rotexy can use phishing overlays to capture users' credit card information.[1]"}, {"score": 1, "techniqueID": "T1406", "comment": "Starting in 2017, the Rotexy DEX file was packed with garbage strings and/or operations.[1]"}, {"score": 1, "techniqueID": "T1424", "comment": "Rotexy collects information about running processes.[1]"}, {"score": 1, "techniqueID": "T1437", "comment": "Rotexy can communicate with the command and control server using JSON payloads sent in HTTP POST request bodies. It can also communicate by using JSON messages sent through Google Cloud Messaging.[1]"}, {"score": 1, "techniqueID": "T1521", "comment": "Rotexy encrypts JSON HTTP payloads with AES. [1]"}, {"score": 1, "techniqueID": "T1508", "comment": "Rotexy hides its icon after first launch.[1]"}, {"score": 1, "techniqueID": "T1426", "comment": "Rotexy collects information about the compromised device, including phone number, network operator, OS version, device model, and the device registration country.[1]"}, {"score": 1, "techniqueID": "T1422", "comment": "Rotexy collects the device's IMEI and sends it to the command and control server.[1]"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Rotexy", "color": "#66b1ff"}]}