{"description": "Enterprise techniques used by Credential Access Protection, ATT&CK mitigation M1043 v1.1", "name": "Credential Access Protection (M1043)", "domain": "enterprise-attack", "versions": {"layer": "4.2", "attack": "9", "navigator": "4.3"}, "techniques": [{"techniqueID": "T1547", "showSubtechniques": true}, {"score": 1, "techniqueID": "T1547.008", "showSubtechniques": true, "comment": "On Windows 10 and Server 2016, enable Windows Defender Credential Guard (Citation: Microsoft Enable Cred Guard April 2017) to run lsass.exe in an isolated virtualized environment without any device drivers. (Citation: Microsoft Credential Guard April 2017)"}, {"score": 1, "techniqueID": "T1601", "showSubtechniques": true, "comment": "Some embedded network devices are capable of storing passwords for local accounts in either plain-text or encrypted formats.  Ensure that, where available, local passwords are always encrypted, per vendor recommendations. (Citation: Cisco IOS Software Integrity Assurance - Credentials Management)"}, {"score": 1, "techniqueID": "T1601.001", "showSubtechniques": true, "comment": "Some embedded network devices are capable of storing passwords for local accounts in either plain-text or encrypted formats.  Ensure that, where available, local passwords are always encrypted, per vendor recommendations. (Citation: Cisco IOS Software Integrity Assurance - Credentials Management)"}, {"score": 1, "techniqueID": "T1601.002", "showSubtechniques": true, "comment": "Some embedded network devices are capable of storing passwords for local accounts in either plain-text or encrypted formats.  Ensure that, where available, local passwords are always encrypted, per vendor recommendations. (Citation: Cisco IOS Software Integrity Assurance - Credentials Management)"}, {"score": 1, "techniqueID": "T1599", "showSubtechniques": true, "comment": "Some embedded network devices are capable of storing passwords for local accounts in either plain-text or encrypted formats.  Ensure that, where available, local passwords are always encrypted, per vendor recommendations.(Citation: Cisco IOS Software Integrity Assurance - AAA)"}, {"score": 1, "techniqueID": "T1599.001", "showSubtechniques": true, "comment": "Some embedded network devices are capable of storing passwords for local accounts in either plain-text or encrypted formats.  Ensure that, where available, local passwords are always encrypted, per vendor recommendations. (Citation: Cisco IOS Software Integrity Assurance - AAA)"}, {"score": 1, "techniqueID": "T1003", "showSubtechniques": true, "comment": "With Windows 10, Microsoft implemented new protections called Credential Guard to protect the LSA secrets that can be used to obtain credentials through forms of credential dumping. It is not configured by default and has hardware and firmware system requirements. (Citation: TechNet Credential Guard) It also does not protect against all forms of credential dumping. (Citation: GitHub SHB Credential Guard)"}, {"score": 1, "techniqueID": "T1003.001", "showSubtechniques": true, "comment": "With Windows 10, Microsoft implemented new protections called Credential Guard to protect the LSA secrets that can be used to obtain credentials through forms of credential dumping. It is not configured by default and has hardware and firmware system requirements. It also does not protect against all forms of credential dumping.(Citation: TechNet Credential Guard)(Citation: GitHub SHB Credential Guard)"}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Credential Access Protection", "color": "#66b1ff"}]}