{"description": "Enterprise techniques used by Emissary, ATT&CK software S0082 v1.0", "name": "Emissary (S0082)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1009", "comment": "A variant of Emissary appends junk data to the end of its DLL file to create a large file that may exceed the maximum size that anti-virus programs can scan."}, {"score": 1, "techniqueID": "T1059", "comment": "Emissary has the capability to create a remote shell and execute specified commands."}, {"score": 1, "techniqueID": "T1024", "comment": "The C2 server response to a beacon sent by a variant of Emissary contains a 36-character GUID value that is used as an encryption key for subsequent network communications. Some variants of Emissary use various XOR operations to encrypt C2 data."}, {"score": 1, "techniqueID": "T1050", "comment": "Emissary is capable of configuring itself as a service."}, {"score": 1, "techniqueID": "T1027", "comment": "Variants of Emissary encrypt payloads using various XOR ciphers, as well as a custom algorithm that uses the \"srand\" and \"rand\" functions."}, {"score": 1, "techniqueID": "T1069", "comment": "Emissary has the capability to execute the command net localgroup administrators."}, {"score": 1, "techniqueID": "T1055", "comment": "Emissary injects its DLL file into a newly spawned Internet Explorer process."}, {"score": 1, "techniqueID": "T1060", "comment": "Variants of Emissary have added Run Registry keys to establish persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "Emissary has the capability to download files from the C2 server."}, {"score": 1, "techniqueID": "T1085", "comment": "Variants of Emissary have used rundll32.exe in Registry values added to establish persistence."}, {"score": 1, "techniqueID": "T1071", "comment": "Emissary uses HTTP or HTTPS for C2."}, {"score": 1, "techniqueID": "T1082", "comment": "Emissary has the capability to execute ver, systeminfo, and gpresult commands."}, {"score": 1, "techniqueID": "T1016", "comment": "Emissary has the capability to execute the command ipconfig /all."}, {"score": 1, "techniqueID": "T1007", "comment": "Emissary has the capability to execute the command net start to interact with services."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Emissary", "color": "#66b1ff"}]}