{"description": "Enterprise techniques used by Proxysvc, ATT&CK software S0238 v1.1", "name": "Proxysvc (S0238)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "Proxysvc automatically collects data about the victim and sends it to the control server."}, {"score": 1, "techniqueID": "T1059", "comment": "Proxysvc executes a binary on the system and logs the results into a temp file by using: cmd.exe /c \" &gt; %temp%\\PM* .tmp 2&gt;&amp;1\"."}, {"score": 1, "techniqueID": "T1043", "comment": "Proxysvc uses port 443 for the control server communications."}, {"score": 1, "techniqueID": "T1485", "comment": "Proxysvc can overwrite files indicated by the attacker before deleting them."}, {"score": 1, "techniqueID": "T1005", "comment": "Proxysvc searches the local system and gathers data."}, {"score": 1, "techniqueID": "T1041", "comment": "Proxysvc performs data exfiltration over the control server channel using a custom protocol."}, {"score": 1, "techniqueID": "T1083", "comment": "Proxysvc lists files in directories."}, {"score": 1, "techniqueID": "T1107", "comment": "Proxysvc can delete files indicated by the attacker and remove itself from disk using a batch file."}, {"score": 1, "techniqueID": "T1057", "comment": "Proxysvc lists processes running on the system."}, {"score": 1, "techniqueID": "T1012", "comment": "Proxysvc gathers product names from the Registry key: HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion ProductName and the processor description from the Registry key HKLM\\HARDWARE\\DESCRIPTION\\System\\CentralProcessor\\0 ProcessorNameString."}, {"score": 1, "techniqueID": "T1064", "comment": "Proxysvc uses a batch file to delete itself."}, {"score": 1, "techniqueID": "T1035", "comment": "Proxysvc registers itself as a service on the victim’s machine to run as a standalone process."}, {"score": 1, "techniqueID": "T1071", "comment": "Proxysvc uses HTTP over SSL to communicate commands with the control server."}, {"score": 1, "techniqueID": "T1082", "comment": "Proxysvc collects the OS version, country name, MAC address, computer name, physical memory statistics, and volume information for all drives on the system."}, {"score": 1, "techniqueID": "T1016", "comment": "Proxysvc collects the network adapter information and domain/username information based on current remote sessions."}, {"score": 1, "techniqueID": "T1124", "comment": "As part of the data reconnaissance phase, Proxysvc grabs the system time to send back to the control server."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Proxysvc", "color": "#66b1ff"}]}