{"description": "Enterprise techniques used by Helminth, ATT&CK software S0170 v1.0", "name": "Helminth (S0170)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "A Helminth VBScript receives a batch script to execute a set of commands in a command prompt."}, {"score": 1, "techniqueID": "T1115", "comment": "The executable version of Helminth has a module to log clipboard contents."}, {"score": 1, "techniqueID": "T1116", "comment": "Helminth samples have been signed with legitimate, compromised code signing certificates owned by software company AI Squared."}, {"score": 1, "techniqueID": "T1059", "comment": "Helminth can provide a remote shell."}, {"score": 1, "techniqueID": "T1132", "comment": "For C2 over HTTP, Helminth encodes data with base64 and sends it via the \"Cookie\" field of HTTP requests. For C2 over DNS, Helminth converts ASCII characters into their hexadecimal values and sends the data in cleartext."}, {"score": 1, "techniqueID": "T1074", "comment": "Helminth creates folders to store output from batch scripts prior to sending the information to its C2 server."}, {"score": 1, "techniqueID": "T1030", "comment": "Helminth splits data into chunks up to 23 bytes and sends the data in DNS queries to its C2 server."}, {"score": 1, "techniqueID": "T1056", "comment": "The executable version of Helminth has a module to log keystrokes."}, {"score": 1, "techniqueID": "T1027", "comment": "The Helminth config file is encrypted with RC4."}, {"score": 1, "techniqueID": "T1069", "comment": "Helminth has checked for the local admin group domain admin group and Exchange Trusted Subsystem groups using the commands net group Exchange Trusted Subsystem /domain and net group domain admins /domain."}, {"score": 1, "techniqueID": "T1086", "comment": "One version of Helminth uses a PowerShell script."}, {"score": 1, "techniqueID": "T1057", "comment": "Helminth has used Tasklist to get information on processes."}, {"score": 1, "techniqueID": "T1060", "comment": "Helminth establishes persistence by creating a shortcut in the Start Menu folder."}, {"score": 1, "techniqueID": "T1105", "comment": "Helminth can download additional files."}, {"score": 1, "techniqueID": "T1053", "comment": "Helminth has used a scheduled task for persistence."}, {"score": 1, "techniqueID": "T1064", "comment": "One version of Helminth consists of VBScript and PowerShell scripts. The malware also uses batch scripting."}, {"score": 1, "techniqueID": "T1023", "comment": "Helminth establishes persistence by creating a shortcut."}, {"score": 1, "techniqueID": "T1071", "comment": "Helminth can use HTTP or DNS for C2."}, {"score": 1, "techniqueID": "T1032", "comment": "Helminth encrypts data sent to its C2 server over HTTP with RC4."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Helminth", "color": "#66b1ff"}]}