{"description": "Enterprise techniques used by Xbash, ATT&CK software S0341 v1.1", "name": "Xbash (S0341)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1110", "comment": "Xbash can obtain a list of weak passwords from the C2 server to use for brute forcing as well as attempt to brute force services with open ports."}, {"score": 1, "techniqueID": "T1485", "comment": "Xbash has destroyed Linux-based databases as part of its ransomware capabilities.    "}, {"score": 1, "techniqueID": "T1486", "comment": "Xbash has maliciously encrypted victim's database systems and demanded a cryptocurrency ransom be paid."}, {"score": 1, "techniqueID": "T1203", "comment": "Xbash can attempt to exploit known vulnerabilities in Hadoop, Redis, or ActiveMQ when it finds those services running in order to conduct further execution."}, {"score": 1, "techniqueID": "T1168", "comment": "Xbash can create a cronjob for persistence if it determines it is on a Linux system."}, {"score": 1, "techniqueID": "T1170", "comment": "Xbash can use mshta for executing scripts."}, {"score": 1, "techniqueID": "T1046", "comment": "Xbash can perform port scanning of TCP and UDP ports."}, {"score": 1, "techniqueID": "T1086", "comment": "Xbash can use scripts to invoke PowerShell to download a malicious PE executable or PE DLL for execution."}, {"score": 1, "techniqueID": "T1060", "comment": "Xbash can create a Startup item for persistence if it determines it is on a Windows system."}, {"score": 1, "techniqueID": "T1117", "comment": "Xbash can use regsvr32 for executing scripts."}, {"score": 1, "techniqueID": "T1105", "comment": "Xbash can download additional malicious files from its C2 server."}, {"score": 1, "techniqueID": "T1064", "comment": "Xbash can execute malicious JavaScript and VBScript payloads on the victim’s machine."}, {"score": 1, "techniqueID": "T1071", "comment": "Xbash uses HTTP for C2 communications."}, {"score": 1, "techniqueID": "T1016", "comment": "Xbash can collect IP addresses and local intranet information from a victim’s machine."}, {"score": 1, "techniqueID": "T1102", "comment": "Xbash can obtain a webpage hosted on Pastebin to update its C2 domain list."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Xbash", "color": "#66b1ff"}]}