{"description": "Mobile techniques used by User Guidance, ATT&CK mitigation M1011 v1.0", "name": "User Guidance (M1011)", "domain": "mobile-attack", "versions": {"layer": "4.2", "attack": "10", "navigator": "4.3"}, "techniques": [{"score": 1, "techniqueID": "T1427", "showSubtechniques": false, "comment": "Advise users to only connect mobile devices to PCs when a justified need exists (e.g., mobile app development and debugging)."}, {"score": 1, "techniqueID": "T1616", "showSubtechniques": false, "comment": "Users should be encouraged to be very careful with what applications they grant phone call-based permissions to. Further, users should not change their default call handler to applications they do not recognize."}, {"score": 1, "techniqueID": "T1447", "showSubtechniques": false, "comment": "Users should be trained on what device administrator permission request prompts look like, and how to avoid granting permissions on phishing popups."}, {"score": 1, "techniqueID": "T1475", "showSubtechniques": false, "comment": "Encourage developers to protect their account credentials and enable multi-factor authentication if available. Encourage developers to protect their signing keys."}, {"score": 1, "techniqueID": "T1476", "showSubtechniques": false, "comment": "iOS 9 and above requires explicit user consent before allowing installation of applications signed with enterprise distribution keys rather than installed from Apple's App Store. Users should be encouraged to not agree to installation of applications signed with enterprise distribution keys unless absolutely certain of the source of the application. On Android, the \"Unknown Sources\" setting must be enabled for users to install apps from sources other than an authorized app store (such as the Google Play Store), so users should be encouraged not to enable that setting."}, {"score": 1, "techniqueID": "T1401", "showSubtechniques": false, "comment": "Users should be told that it is very rare for an app to request device administrator permissions, and that any requests for the permissions should be scrutinized. "}, {"score": 1, "techniqueID": "T1458", "showSubtechniques": false, "comment": "Users should be advised not to use public charging stations or computers to charge their devices. Instead, users should be issued a charger acquired from a trustworthy source. Users should be advised not to click on device prompts to trust attached computers unless absolutely necessary."}, {"score": 1, "techniqueID": "T1541", "showSubtechniques": false, "comment": "If a user sees a persistent notification they do not recognize, they should uninstall the source application and look for other unwanted applications or anomalies."}, {"score": 1, "techniqueID": "T1581", "showSubtechniques": false, "comment": "Users should be advised to be extra scrutinous of applications that request location permissions, and to deny any permissions requests for applications they do not recognize."}, {"score": 1, "techniqueID": "T1417", "showSubtechniques": false, "comment": "Users should be weary of granting applications dangerous or privacy-intrusive permissions, such as keyboard registration and accessibility permissions requests."}, {"score": 1, "techniqueID": "T1516", "showSubtechniques": false, "comment": "Users should be warned against granting access to accessibility features, and to carefully scrutinize applications that request this dangerous permission."}, {"score": 1, "techniqueID": "T1478", "showSubtechniques": false, "comment": "Typically, insecure or malicious configuration settings are not installed without the user's consent. Users should be advised not to install unexpected configuration settings (CA certificates, iOS Configuration Profiles, Mobile Device Management server provisioning)."}, {"score": 1, "techniqueID": "T1444", "showSubtechniques": false, "comment": "Users should be encouraged to only install apps from authorized app stores, which are less likely to contain malicious repackaged apps."}, {"score": 1, "techniqueID": "T1470", "showSubtechniques": false, "comment": "Encourage users to protect their account credentials and to enable available multi-factor authentication options."}, {"score": 1, "techniqueID": "T1468", "showSubtechniques": false, "comment": "Encourage users to protect their account credentials and to enable available multi-factor authentication options."}, {"score": 1, "techniqueID": "T1469", "showSubtechniques": false, "comment": "Encourage users to protect their account credentials and to enable available multi-factor authentication options."}, {"score": 1, "techniqueID": "T1513", "showSubtechniques": false, "comment": "Users should be advised not to grant consent for screen captures to occur unless expected. Users should avoid enabling USB debugging (Android Debug Bridge) unless explicitly required."}, {"score": 1, "techniqueID": "T1451", "showSubtechniques": false, "comment": "Users should be instructed to use forms of multifactor authentication not subject to being intercepted by a SIM card swap, where possible. More secure methods include application-based one-time passcodes (such as Google Authenticator), hardware tokens, and biometrics."}, {"score": 1, "techniqueID": "T1582", "showSubtechniques": false, "comment": "Users should be encouraged to be very careful with what applications they grant SMS access to. Further, users should not change their default SMS handler to applications they do not recognize.(Citation: SMS KitKat)"}, {"score": 1, "techniqueID": "T1576", "showSubtechniques": false, "comment": "Inform users that device rooting or granting unnecessary access to the accessibility service presents security risks that could be taken advantage of without their knowledge."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by User Guidance", "color": "#66b1ff"}]}