{"description": "Enterprise techniques used by Shamoon, ATT&CK software S0140 v2.0", "name": "Shamoon (S0140)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1088", "comment": "Shamoon attempts to disable UAC remote restrictions by modifying the Registry."}, {"score": 1, "techniqueID": "T1043", "comment": "Shamoon has used TCP port 8080 for C2."}, {"score": 1, "techniqueID": "T1485", "comment": "Shamoon attempts to overwrite operating system files and disk structures with image files. In a later variant, randomly generated data was used for data overwrites."}, {"score": 1, "techniqueID": "T1486", "comment": "Shamoon has an operational mode for encrypting data instead of overwriting it."}, {"score": 1, "techniqueID": "T1487", "comment": "Shamoon has been seen overwriting features of disk structure such as the MBR."}, {"score": 1, "techniqueID": "T1036", "comment": "Shamoon creates a new service named “ntssrv” that attempts to appear legitimate; the service's display name is “Microsoft Network Realtime Inspection Service” and its description is “Helps guard against time change attempts targeting known and newly discovered vulnerabilities in network time protocols.”"}, {"score": 1, "techniqueID": "T1112", "comment": "Once Shamoon has access to a network share, it enables the RemoteRegistry service on the target system. It will then connect to the system with RegConnectRegistryW and modify the Registry to disable UAC remote restrictions by setting SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\LocalAccountTokenFilterPolicy to 1."}, {"score": 1, "techniqueID": "T1050", "comment": "Shamoon creates a new service named “ntssrv” to execute the payload."}, {"score": 1, "techniqueID": "T1027", "comment": "Shamoon contains base64-encoded strings."}, {"score": 1, "techniqueID": "T1012", "comment": "Shamoon queries several Registry keys to identify hard disk partitions to overwrite."}, {"score": 1, "techniqueID": "T1105", "comment": "Shamoon can download an executable to run on the victim."}, {"score": 1, "techniqueID": "T1018", "comment": "Shamoon scans the C-class subnet of the IPs on the victim's interfaces."}, {"score": 1, "techniqueID": "T1053", "comment": "Shamoon copies an executable payload to the target system by using Windows Admin Shares and then scheduling an unnamed task to execute the malware."}, {"score": 1, "techniqueID": "T1035", "comment": "Shamoon creates a new service named “ntssrv” to execute the payload."}, {"score": 1, "techniqueID": "T1071", "comment": "Shamoon uses HTTP for C2."}, {"score": 1, "techniqueID": "T1082", "comment": "Shamoon obtains the victim's operating system version and keyboard layout and sends the information to the C2 server."}, {"score": 1, "techniqueID": "T1016", "comment": "Shamoon obtains the target's IP address and local network segment."}, {"score": 1, "techniqueID": "T1124", "comment": "Shamoon obtains the system time and will only activate if it is greater than a preset date."}, {"score": 1, "techniqueID": "T1078", "comment": "If Shamoon cannot access shares using current privileges, it attempts access using hard coded, domain-specific credentials gathered earlier in the intrusion."}, {"score": 1, "techniqueID": "T1077", "comment": "Shamoon accesses network share(s), enables share access to the target device, copies an executable payload to the target system, and uses a Scheduled Task to execute the malware."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Shamoon", "color": "#66b1ff"}]}