{"description": "Enterprise techniques used by OopsIE, ATT&CK software S0264 v1.1", "name": "OopsIE (S0264)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1059", "comment": "OopsIE uses the command prompt to execute commands on the victim's machine."}, {"score": 1, "techniqueID": "T1002", "comment": "OopsIE compresses collected files with both the GZipStream class and a simple character replacement scheme before sending them to its C2 server."}, {"score": 1, "techniqueID": "T1132", "comment": "OopsIE encodes data in hexadecimal format over the C2 channel."}, {"score": 1, "techniqueID": "T1074", "comment": "OopsIE stages the output from command execution and collected files in specific folders before exfiltration."}, {"score": 1, "techniqueID": "T1030", "comment": "OopsIE exfiltrates command output and collected files to its C2 server in 1500-byte blocks."}, {"score": 1, "techniqueID": "T1140", "comment": "OopsIE concatenates then decompresses multiple resources to load an embedded .Net Framework assembly."}, {"score": 1, "techniqueID": "T1041", "comment": "OopsIE can upload files from the victim's machine to its C2 server."}, {"score": 1, "techniqueID": "T1107", "comment": "OopsIE has the capability to delete files and scripts from the victim's machine."}, {"score": 1, "techniqueID": "T1027", "comment": "OopsIE uses the Confuser protector to obfuscate an embedded .Net Framework assembly used for C2. OopsIE also encodes collected data in hexadecimal format before writing to files on disk and obfuscates strings."}, {"score": 1, "techniqueID": "T1105", "comment": "OopsIE can download files from its C2 server to the victim's machine."}, {"score": 1, "techniqueID": "T1053", "comment": "OopsIE creates a scheduled task to run itself every three minutes."}, {"score": 1, "techniqueID": "T1064", "comment": "OopsIE creates and uses a VBScript as part of its persistent execution."}, {"score": 1, "techniqueID": "T1045", "comment": "OopsIE uses the SmartAssembly obfuscator to pack an embedded .Net Framework assembly used for C2."}, {"score": 1, "techniqueID": "T1071", "comment": "OopsIE uses HTTP for C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "OopsIE checks for information on the CPU fan, temperature, mouse, hard disk, and motherboard as part of its anti-VM checks."}, {"score": 1, "techniqueID": "T1124", "comment": "OopsIE checks to see if the system is configured with \"Daylight\" time and checks for a specific region to be set for the timezone."}, {"score": 1, "techniqueID": "T1497", "comment": "OopsIE performs several anti-VM and sandbox checks on the victim's machine. One technique the group has used was to perform a WMI query SELECT * FROM MSAcpi_ThermalZoneTemperature to check the temperature to see if it’s running in a virtual environment."}, {"score": 1, "techniqueID": "T1047", "comment": "OopsIE uses WMI to perform discovery techniques."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by OopsIE", "color": "#66b1ff"}]}