{"description": "Enterprise techniques used by APT32, ATT&CK group G0050 v2.0", "name": "APT32 (G0050)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "APT32 enumerated administrative users and DC servers using the commands net localgroup administrators and net group \"Domain Controllers\" /domain."}, {"score": 1, "techniqueID": "T1017", "comment": "APT32 compromised McAfee ePO to move laterally by distributing malware as a software deployment task."}, {"score": 1, "techniqueID": "T1009", "comment": "APT32 includes garbage code to mislead anti-malware software and researchers."}, {"score": 1, "techniqueID": "T1059", "comment": "APT32 has used cmd.exe for execution. "}, {"score": 1, "techniqueID": "T1043", "comment": "APT32 has used port 80 for C2 communications."}, {"score": 1, "techniqueID": "T1003", "comment": "APT32 used Mimikatz, GetPassword_x64, and  customized versions of Windows Credential Dumper, HookChangePassword, and Outlook Credential Dumper to harvest credentials."}, {"score": 1, "techniqueID": "T1094", "comment": "APT32 uses Cobalt Strike's malleable C2 functionality to blend in with network traffic. The group's backdoor can also exfiltrate data by encoding it in the subdomain field of DNS packets. Additionally, one of the group's macOS backdoors implements a specific format for the C2 packet involving random values."}, {"score": 1, "techniqueID": "T1002", "comment": "APT32's backdoor has used LZMA compression before exfiltration.    "}, {"score": 1, "techniqueID": "T1022", "comment": "APT32 backdoors have encrypted data before exfiltration, including by using RC4 encryption."}, {"score": 1, "techniqueID": "T1073", "comment": "APT32 ran legitimately-signed executables from Symantec and McAfee which load a malicious DLL. The group also side-loads its backdoor by dropping a library and a legitimate, signed executable (AcroTranscoder)."}, {"score": 1, "techniqueID": "T1189", "comment": "APT32 has infected victims by tricking them into visiting compromised watering hole websites."}, {"score": 1, "techniqueID": "T1041", "comment": "APT32's backdoor has exfiltrated data using the already opened channel with its C&amp;C server."}, {"score": 1, "techniqueID": "T1203", "comment": "APT32 has used RTF document that includes an exploit to execute malicious code. (CVE-2017-11882)"}, {"score": 1, "techniqueID": "T1068", "comment": "APT32 has used CVE-2016-7255 to escalate privileges."}, {"score": 1, "techniqueID": "T1083", "comment": "APT32's backdoor possesses the capability to list files and directories on a machine.  "}, {"score": 1, "techniqueID": "T1107", "comment": "APT32's macOS backdoor can receive a “delete” command."}, {"score": 1, "techniqueID": "T1222", "comment": "APT32's macOS backdoor changes the permission of the file it wants to execute to 755."}, {"score": 1, "techniqueID": "T1158", "comment": "APT32's macOS backdoor hides the clientID file via a chflags function."}, {"score": 1, "techniqueID": "T1070", "comment": "APT32 has cleared select event log entries."}, {"score": 1, "techniqueID": "T1036", "comment": "APT32 has used hidden or non-printing characters to help masquerade file names on a system, such as appending a Unicode no-break space character to a legitimate service name. They have also used by moving and renaming pubprn.vbs to a .txt file to avoid detection. Additionally, the group has renamed a NetCat binary to kb-10233.exe to masquerade as a Windows update."}, {"score": 1, "techniqueID": "T1031", "comment": "APT32 modified Windows Services to ensure PowerShell scripts were loaded on the system."}, {"score": 1, "techniqueID": "T1112", "comment": "APT32's backdoor has modified the Windows Registry to store the backdoor's configuration.  "}, {"score": 1, "techniqueID": "T1170", "comment": "APT32 has used mshta.exe for code execution."}, {"score": 1, "techniqueID": "T1046", "comment": "APT32 performed network scanning on the network to search for open ports, services, OS finger-printing, and other vulnerabilities."}, {"score": 1, "techniqueID": "T1050", "comment": "APT32 creates a Windows service to establish persistence."}, {"score": 1, "techniqueID": "T1096", "comment": "APT32 used NTFS alternate data stream to hide their payloads."}, {"score": 1, "techniqueID": "T1027", "comment": "APT32 uses the Invoke-Obfuscation framework to obfuscate their PowerShell and also performs other code obfuscation. APT32 has also encoded payloads using Base64 and a framework called \"Dont-Kill-My-Cat (DKMC). APT32 also encrypts the library used for network exfiltration with AES-256 in CBC mode in their macOS backdoor."}, {"score": 1, "techniqueID": "T1137", "comment": "APT32 installed a backdoor macro in Microsoft Outlook for persistence."}, {"score": 1, "techniqueID": "T1075", "comment": "APT32 has used pass the hash for lateral movement."}, {"score": 1, "techniqueID": "T1097", "comment": "APT32 successfully gained remote access by using pass the ticket."}, {"score": 1, "techniqueID": "T1086", "comment": "APT32 has used PowerShell-based tools, PowerShell one-liners, and shellcode loaders for execution."}, {"score": 1, "techniqueID": "T1012", "comment": "APT32's backdoor can query the Windows Registry to gather system information."}, {"score": 1, "techniqueID": "T1060", "comment": "APT32 established persistence using Registry Run keys, both to execute PowerShell and VBS scripts as well as to execute their backdoor directly."}, {"score": 1, "techniqueID": "T1117", "comment": "APT32 created a Scheduled Task that used regsvr32.exe to execute a COM scriptlet that dynamically downloaded a backdoor and injected it into memory. The group has also used regsvr32 to run their backdoor."}, {"score": 1, "techniqueID": "T1105", "comment": "APT32 has added JavaScript to victim websites to download additional frameworks that profile and compromise website visitors."}, {"score": 1, "techniqueID": "T1018", "comment": "APT32 used the net view command to show all shares available, including the administrative shares such as C$ and ADMIN$. APT32 also used the ping command."}, {"score": 1, "techniqueID": "T1053", "comment": "APT32 has used scheduled tasks to persist on victim systems."}, {"score": 1, "techniqueID": "T1064", "comment": "APT32 has used macros, PowerShell scripts, COM scriptlets, and VBS scripts."}, {"score": 1, "techniqueID": "T1035", "comment": "APT32's backdoor has used Windows services as a way to execute its malicious payload."}, {"score": 1, "techniqueID": "T1216", "comment": "APT32 has used PubPrn.vbs within execution scripts to execute malware, possibly bypassing defenses."}, {"score": 1, "techniqueID": "T1045", "comment": "APT32 uses UPX to pack their macOS backdoor."}, {"score": 1, "techniqueID": "T1193", "comment": "APT32 has sent spearphishing emails with a malicious executable disguised as a document or spreadsheet."}, {"score": 1, "techniqueID": "T1192", "comment": "APT32 has sent spearphishing emails containing malicious links."}, {"score": 1, "techniqueID": "T1071", "comment": "APT32 has used JavaScript that communicates over HTTP or HTTPS to attacker controlled domains to download additional frameworks. The group has also used email for C2 via an Office macro. The group's backdoor can also exfiltrate data by encoding it in the subdomain field of DNS packets."}, {"score": 1, "techniqueID": "T1082", "comment": "APT32 has collected the OS version and computer name from victims. One of the group's backdoors can also query the Windows Registry to gather system information, and another macOS backdoor performs a fingerprint of the machine on its first connection to the C&amp;C server."}, {"score": 1, "techniqueID": "T1016", "comment": "APT32 used the ipconfig /all command to gather the IP address from the system."}, {"score": 1, "techniqueID": "T1049", "comment": "APT32 used the netstat -anpo tcp command to display TCP connections on the victim's machine."}, {"score": 1, "techniqueID": "T1033", "comment": "APT32 collected the victim's username and executed the whoami command on the victim's machine."}, {"score": 1, "techniqueID": "T1099", "comment": "APT32 has used scheduled task raw XML with a backdated timestamp of June 2, 2016. The group has also set the creation time of the files dropped by the second stage of the exploit to match the creation time of kernel32.dll. Additionally, APT32 has used a random value to modify the timestamp of the file storing the clientID."}, {"score": 1, "techniqueID": "T1065", "comment": "APT32 backdoor can use HTTP over an uncommon TCP port (e.g 14146) which is specified in the backdoor configuration."}, {"score": 1, "techniqueID": "T1204", "comment": "APT32 has attempted to lure users to execute a malicious dropper delivered via a spearphishing attachment."}, {"score": 1, "techniqueID": "T1078", "comment": "APT32 has used legitimate local admin account credentials."}, {"score": 1, "techniqueID": "T1100", "comment": "APT32 has used Web shells to maintain access to victim websites."}, {"score": 1, "techniqueID": "T1077", "comment": "APT32 used Net to use Windows' hidden network shares to copy their tools to remote machines for execution."}, {"score": 1, "techniqueID": "T1047", "comment": "APT32 used WMI to deploy their tools on remote machines and to gather information about the Outlook process."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by APT32", "color": "#66b1ff"}]}