{"description": "Enterprise techniques used by Agent Tesla, ATT&CK software S0331 v1.0", "name": "Agent Tesla (S0331)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1087", "comment": "Agent Tesla collects account information from the victim’s machine."}, {"score": 1, "techniqueID": "T1115", "comment": "Agent Tesla can steal data from the victim’s clipboard."}, {"score": 1, "techniqueID": "T1022", "comment": "Agent Tesla encrypts the data with 3DES before sending it over the C2 server."}, {"score": 1, "techniqueID": "T1089", "comment": "Agent Tesla has the capability to kill any running analysis processes and AV software."}, {"score": 1, "techniqueID": "T1048", "comment": "Agent Tesla has routines for exfiltration over SMTP, FTP, and HTTP."}, {"score": 1, "techniqueID": "T1203", "comment": "Agent Tesla exploits CVE-2017-11882 in Microsoft’s Equation Editor to execute a process."}, {"score": 1, "techniqueID": "T1056", "comment": "Agent Tesla can log keystrokes on the victim’s machine."}, {"score": 1, "techniqueID": "T1027", "comment": "Agent Tesla obfuscates its code in an apparent attempt to make analysis difficult."}, {"score": 1, "techniqueID": "T1057", "comment": "Agent Tesla lists the current running processes on the system."}, {"score": 1, "techniqueID": "T1060", "comment": "Agent Tesla adds itself to the Registry as a startup program to establish persistence."}, {"score": 1, "techniqueID": "T1105", "comment": "Agent Tesla can download additional files for execution on the victim’s machine."}, {"score": 1, "techniqueID": "T1113", "comment": "Agent Tesla can capture screenshots of the victim’s desktop."}, {"score": 1, "techniqueID": "T1071", "comment": "Agent Tesla has used HTTP and SMTP for C2 communications."}, {"score": 1, "techniqueID": "T1082", "comment": "Agent Tesla collects the system's computer name and also has the capability to collect information on the processor, memory, and video card from the system."}, {"score": 1, "techniqueID": "T1016", "comment": "Agent Tesla can collect the IP address of the victim machine."}, {"score": 1, "techniqueID": "T1033", "comment": "Agent Tesla collects the username from the victim’s machine."}, {"score": 1, "techniqueID": "T1124", "comment": "Agent Tesla can collect the timestamp from the victim’s machine."}, {"score": 1, "techniqueID": "T1065", "comment": "Agent Tesla has enabled TCP on port 587 for C2 communications."}, {"score": 1, "techniqueID": "T1125", "comment": "Agent Tesla can access the victim’s webcam and record video."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Agent Tesla", "color": "#66b1ff"}]}