{"description": "Enterprise techniques used by FIN4, ATT&CK group G0085 v1.0", "name": "FIN4 (G0085)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1114", "comment": "FIN4 has accessed and hijacked email communications using stolen credentials."}, {"score": 1, "techniqueID": "T1056", "comment": "FIN4 has captured credentials via fake Outlook Web App (OWA) login pages and has also used a .NET based keylogger."}, {"score": 1, "techniqueID": "T1141", "comment": "FIN4 has presented victims with spoofed Windows Authentication prompts to collect their credentials."}, {"score": 1, "techniqueID": "T1188", "comment": "FIN4 has used Tor to log in to victims' email accounts."}, {"score": 1, "techniqueID": "T1064", "comment": "FIN4 has used VBA macros to display a dialog box and collect victim credentials."}, {"score": 1, "techniqueID": "T1193", "comment": "FIN4 has used spearphishing emails containing attachments (which are often stolen, legitimate documents sent from compromised accounts) with embedded malicious macros."}, {"score": 1, "techniqueID": "T1192", "comment": "FIN4 has used spearphishing emails (often sent from compromised accounts) containing malicious links."}, {"score": 1, "techniqueID": "T1071", "comment": "FIN4 has used HTTP POST requests to transmit data."}, {"score": 1, "techniqueID": "T1492", "comment": "FIN4 has created rules in victims' Microsoft Outlook accounts to automatically delete emails containing words such as “hacked,\" \"phish,\" and “malware\" in a likely attempt to prevent organizations from communicating about their activities."}, {"score": 1, "techniqueID": "T1204", "comment": "FIN4 has lured victims to launch malicious attachments and click malicious links delivered via spearphishing emails (often sent from compromised accounts)."}, {"score": 1, "techniqueID": "T1078", "comment": "FIN4 has used legitimate credentials to hijack email communications."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by FIN4", "color": "#66b1ff"}]}