{"description": "Enterprise techniques used by Emotet, ATT&CK software S0367 v1.1", "name": "Emotet (S0367)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1110", "comment": "Emotet has been observed using a hard coded list of passwords to brute force user accounts. "}, {"score": 1, "techniqueID": "T1059", "comment": "Emotet has used cmd.exe to run a PowerShell script."}, {"score": 1, "techniqueID": "T1043", "comment": "Emotet has used ports 20, 22, 80, 443, 8080, and 8443."}, {"score": 1, "techniqueID": "T1003", "comment": "Emotet has been observed dropping browser and password grabber modules including Mimikatz."}, {"score": 1, "techniqueID": "T1081", "comment": "Emotet has been observed leveraging a module that retrieves passwords stored on a system for the current logged-on user."}, {"score": 1, "techniqueID": "T1094", "comment": "Emotet has been observed using an encrypted, modified protobuf-based protocol for command and control messaging."}, {"score": 1, "techniqueID": "T1022", "comment": "Emotet has been observed encrypting the data it collects before sending it to the C2 server."}, {"score": 1, "techniqueID": "T1114", "comment": "Emotet has been observed leveraging a module that scrapes email data from Outlook."}, {"score": 1, "techniqueID": "T1041", "comment": "Emotet has been seen exfiltrating system information stored within cookies sent within an HTTP GET request back to its C2 servers."}, {"score": 1, "techniqueID": "T1210", "comment": "Emotet has been seen exploiting SMB via a vulnerability exploit like ETERNALBLUE (MS17-010) to achieve lateral movement and propagation. "}, {"score": 1, "techniqueID": "T1040", "comment": "Emotet has been observed to hook network APIs to monitor network traffic."}, {"score": 1, "techniqueID": "T1050", "comment": "Emotet has been observed creating new services to maintain persistence. "}, {"score": 1, "techniqueID": "T1027", "comment": "Emotet has obfuscated macros within malicious documents to hide the URLs hosting the malware,  CMD.exe arguments, and PowerShell scripts."}, {"score": 1, "techniqueID": "T1086", "comment": "Emotet has used Powershell to retrieve the malicious payload and download additional resources like Mimikatz."}, {"score": 1, "techniqueID": "T1057", "comment": "Emotet has been observed enumerating local processes."}, {"score": 1, "techniqueID": "T1055", "comment": "Emotet has been observed injecting in to Explorer.exe and other processes."}, {"score": 1, "techniqueID": "T1060", "comment": "Emotet has been observed adding the downloaded payload to the HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run key to maintain persistence."}, {"score": 1, "techniqueID": "T1053", "comment": "Emotet has maintained persistence through a scheduled task."}, {"score": 1, "techniqueID": "T1064", "comment": "Emotet has sent Microsoft Word documents with embedded macros that will invoke scripts to download additional payloads."}, {"score": 1, "techniqueID": "T1045", "comment": "Emotet has used custom packers to protect its payloads."}, {"score": 1, "techniqueID": "T1193", "comment": "Emotet has been delivered by phishing emails containing attachments."}, {"score": 1, "techniqueID": "T1192", "comment": "Emotet has been delivered by phishing emails containing links."}, {"score": 1, "techniqueID": "T1032", "comment": "Emotet is known to use RSA keys for encrypting C2 traffic."}, {"score": 1, "techniqueID": "T1065", "comment": "Emotet has been observed communicating over non standard ports, including 7080 and 50000."}, {"score": 1, "techniqueID": "T1204", "comment": "Emotet has relied upon users clicking on a malicious link or attachment delivered through spearphishing."}, {"score": 1, "techniqueID": "T1078", "comment": "Emotet can brute force a local admin password, then use it to facilitate lateral movement."}, {"score": 1, "techniqueID": "T1077", "comment": "Emotet leverages the Admin$ share for lateral movement once the local admin password has been brute forced. "}, {"score": 1, "techniqueID": "T1047", "comment": "Emotet has used WMI to execute powershell.exe."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Emotet", "color": "#66b1ff"}]}