{"description": "Enterprise techniques used by Rover, ATT&CK software S0090 v1.0", "name": "Rover (S0090)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1119", "comment": "Rover automatically collects files from the local system and removable drives based on a predefined list of file extensions on a regular timeframe."}, {"score": 1, "techniqueID": "T1020", "comment": "Rover automatically searches for files on local drives based on a predefined list of file extensions and sends them to the command and control server every 60 minutes. Rover also automatically sends keylogger files and screenshots to the C2 server on a regular timeframe."}, {"score": 1, "techniqueID": "T1005", "comment": "Rover searches for files on local drives based on a predefined list of file extensions."}, {"score": 1, "techniqueID": "T1025", "comment": "Rover searches for files on attached removable drives based on a predefined list of file extensions every five seconds."}, {"score": 1, "techniqueID": "T1074", "comment": "Rover copies files from removable drives to C:\\system."}, {"score": 1, "techniqueID": "T1083", "comment": "Rover automatically searches for files on local drives based on a predefined list of file extensions."}, {"score": 1, "techniqueID": "T1056", "comment": "Rover has keylogging functionality."}, {"score": 1, "techniqueID": "T1112", "comment": "Rover has functionality to remove Registry Run key persistence as a cleanup procedure."}, {"score": 1, "techniqueID": "T1060", "comment": "Rover persists by creating a Registry entry in HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\."}, {"score": 1, "techniqueID": "T1113", "comment": "Rover takes screenshots of the compromised system's desktop and saves them to C:\\system\\screenshot.bmp for exfiltration every 60 minutes."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by Rover", "color": "#66b1ff"}]}