{"description": "Enterprise techniques used by DustySky, ATT&CK software S0062 v1.0", "name": "DustySky (S0062)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1008", "comment": "DustySky has two hard-coded domains for C2 servers; if the first does not respond, it will try the second."}, {"score": 1, "techniqueID": "T1083", "comment": "DustySky scans the victim for files that contain certain keywords from a list that is obtained from the C2 as a text file. It also collects information about installed software."}, {"score": 1, "techniqueID": "T1056", "comment": "DustySky contains a keylogger."}, {"score": 1, "techniqueID": "T1027", "comment": "The DustySky dropper uses a function to obfuscate the name of functions and other parts of the malware."}, {"score": 1, "techniqueID": "T1057", "comment": "DustySky collects information about running processes from victims."}, {"score": 1, "techniqueID": "T1060", "comment": "DustySky achieves persistence by creating a Registry entry in HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run."}, {"score": 1, "techniqueID": "T1105", "comment": "DustySky searches for network drives and removable media and duplicates itself onto them."}, {"score": 1, "techniqueID": "T1091", "comment": "DustySky searches for removable media and duplicates itself onto it."}, {"score": 1, "techniqueID": "T1063", "comment": "DustySky checks for the existence of anti-virus."}, {"score": 1, "techniqueID": "T1071", "comment": "DustySky has used both HTTP and HTTPS for C2."}, {"score": 1, "techniqueID": "T1082", "comment": "DustySky extracts basic information about the operating system."}, {"score": 1, "techniqueID": "T1047", "comment": "The DustySky dropper uses Windows Management Instrumentation to extract information about the operating system and whether an anti-virus is active."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by DustySky", "color": "#66b1ff"}]}