{"description": "Enterprise techniques used by WannaCry, ATT&CK software S0366 v1.0", "name": "WannaCry (S0366)", "domain": "mitre-enterprise", "version": "2.1", "techniques": [{"score": 1, "techniqueID": "T1024", "comment": "WannaCry uses a custom cryptographic protocol over the Tor circuit."}, {"score": 1, "techniqueID": "T1486", "comment": "WannaCry encrypts user files and demands that a ransom be paid in Bitcoin to decrypt those files."}, {"score": 1, "techniqueID": "T1210", "comment": "WannaCry uses an exploit in SMBv1 to spread itself to other remote systems on a network."}, {"score": 1, "techniqueID": "T1083", "comment": "WannaCry searches for variety of user files by file extension before encrypting them using RSA and AES, including Office, PDF, image, audio, video, source code, archive/compression format, and key and certificate files."}, {"score": 1, "techniqueID": "T1222", "comment": "WannaCry uses attrib +h and icacls . /grant Everyone:F /T /C /Q to make some of its files hidden and grant all users full access controls."}, {"score": 1, "techniqueID": "T1158", "comment": "WannaCry uses attrib +h to make some of its files hidden."}, {"score": 1, "techniqueID": "T1490", "comment": "WannaCry uses vssadmin, wbadmin, bcdedit, and wmic to delete and disable operating system recovery features."}, {"score": 1, "techniqueID": "T1188", "comment": "WannaCry uses Tor for command and control traffic."}, {"score": 1, "techniqueID": "T1079", "comment": "WannaCry uses Tor for command and control traffic and routes a custom cryptographic protocol over the Tor circuit."}, {"score": 1, "techniqueID": "T1050", "comment": "WannaCry creates the service \"mssecsvc2.0\" with the display name \"Microsoft Security Center (2.0) Service.\""}, {"score": 1, "techniqueID": "T1120", "comment": "WannaCry contains a thread that will attempt to scan for new attached drives every few seconds. If one is identified, it will encrypt the files on the attached device."}, {"score": 1, "techniqueID": "T1076", "comment": "WannaCry enumerates current remote desktop sessions and tries to execute the malware on each session."}, {"score": 1, "techniqueID": "T1105", "comment": "WannaCry attempts to copy itself to remote computers after gaining access via an SMB exploit."}, {"score": 1, "techniqueID": "T1018", "comment": "WannaCry scans its local network segment for remote systems to try to exploit and copy itself to."}, {"score": 1, "techniqueID": "T1489", "comment": "WannaCry attempts to kill processes associated with Exchange, Microsoft SQL Server, and MySQL to make it possible to encrypt their data stores."}, {"score": 1, "techniqueID": "T1016", "comment": "WannaCry will attempt to determine the local network segment it is a part of."}, {"score": 1, "techniqueID": "T1047", "comment": "WannaCry utilizes wmic to delete shadow copies."}], "gradient": {"colors": ["#ffffff", "#66b1ff"], "minValue": 0, "maxValue": 1}, "legendItems": [{"label": "used by WannaCry", "color": "#66b1ff"}]}